[
    "\n                Devil May Cry is a very strange series. It does its thing nicely for a bit but then goes and ruins it with some silly nonsense. I have no idea why or how that happened. I mean, the games are pretty consistently decent—so why isn't this show the same?\n\r\nLet's begin with this totally alien concept called the story. Of which you won't be getting any for about 9 episodes in a row (yes, out of 12 total). No joke—this is essentially a slice-of-life series about Dante showing off. And before you ask the obvious question—yes, it has less of a story than the action games\n                  \n\nthe setting is taken from. Furthermore—just to tease you—at several points you get an impression that some general plot is about to emerge (it eventually does, but already after you have lost all hope for it), but the very next moment you have your expectations casually ruined once again. You could probably even watch episodes 2–9 in any order without disturbing the narrative. For that exact reason you shouldn't worry about spoilers when discussing this series, as it's virtually impossible to spoil anything of substance. Rating the story with 3 is me being generous here, owing it mostly to the universe created by the DMC game series.\n\r\nOh yeah, Dante. As I mentioned earlier, everything in this series is about showing Dante in the process of, uh... being cool? He tries so hard he transcends the meaning of the word \"cool\", being the living embodiment of coolness never seen since the cool came to cool town. He always has that swag going, and his sense of fashion oozes style—as imagined by a 14-year-old. Obviously, he only eats the most badass food in existence... you guessed it, as imagined by a 14-year-old: pizza, strawberry sundae, beer—none of your chump gourmet garbage. He has the craziest, totally overpowered weapons—because dramatic stakes are for pussies. Even his name has that aristocratic feel to it. Unsurprisingly, every time he's up for a job, he always does it single-handedly—be it a bike race, gambling, or butchering a several-stories-tall demon in mere seconds—always with that detached facial expression that serves to underline his towering superiority. Yet somehow he always fails to complete his primary objective because he's just too damn righteous or whatever. Ermagherd, what an impossibly cool dude! And even during all that action, he appears to be bored out of his mind, almost depressed by doing something so utterly mundane. One-Punch Man too popular for you? Take a look at this gem then: DMC did the \"overpowered MC bored by flaccid antagonists\" shtick some 8 years before everyone's favorite egghead came into being. Hellsing Ultimate has too much of that annoying character development? DMC should be right up your alley—it doesn't have any of that. Ladies and gentlemen, we have officially reached peak shallow. If you aren't sure what \"peak shallow\" looks like, imagine a zit on the ground; that should work.\n\r\nOn the topic of characters, the entire cast is mainly there to support Dante by... yes, being glorified foils, looking deliberately uncool in comparison. First, we have Morrison, who is old-fashioned, intelligent, and an exemplary gentleman, almost a polar opposite of Dante. Then there's Patty, the token loli moe-blob comic relief character whose presence is never justified despite screenwriter's best efforts (which fail spectacularly, of course). A notable character is the creatively-named Lady, who is also quite a cool, uh, lady—but... still not quite there, you know? This, however, doesn't prevent her from being far more capable at her job. But hey, if Dante doesn't bother doing the thing, it must not be very cool after all, right? There's also Trish, who is somewhere between Lady and Dante on the scale on coolness and never gets any screen time. The distribution of screen time in general seems to be decided by a coin toss, befitting the interchangeable, meandering nature of the support cast. (That said, I gotta give some credit to designs and the fact that they're occasionally entertaining (if only because they try so hard) and evoke memories of better-written characters from the action anime of the days past; really makes you wish they were put in capable hands.) Lastly, there is that typical cartoony small fry antagonist who, despite being an obnoxious eyesore, behaves like a plot-significant character and—in a great plot twist (gasp!)—actually ends up being one. At that point you'll just have to be a man and brace yourself for the trainwreck. Even if you're a woman, become a man and then brace yourself; there is no sweeter imagery than a man bracing himself for a trainwreck.\n\r\nThere isn't much to say about the show's sound and visuals. They're generally competently made and adequate for the subject matter, though some scenes could have definitely been animated better (as in *actually animated* rather than panned across the screen), and the music somewhat lacks variety—almost all of it is mere variations on the three dominant themes.\n\r\nAll in all, DMC is the kind of show you'd want for some simple braindead entertainment when you've run out of the more entertaining content to watch. Don't expect anything beyond that, as you'll be met with nothing but disappointment. Just get your beverage of choice, a pack of favorite snacks, press play, and tune out. Alternatively, go play the original games and forget the anime adaptation ever existed.",
    "\n                If you’ve never heard of Devil May Cry before and are looking for a good action anime, this is not it. If you’re a fan of the video games and want to see more stylish ass-kickery, prepare to be disappointed. \n\r\nStory: Dante is running his business, performing mundane tasks for clients like demon-slaying, saving the world, the usual. Almost every episode starts and concludes one of Dante’s assigned cases, involving nasty monsters that inevitably end up dead. There is some cheap drama that focuses on a young girl whom Dante saved and a loser demon who wants to become a god, but you’re not seriously\n                  \n\nhere for the plot are you?\n\r\nArt: The art style is able to create a dark, gothic atmosphere where Dante spills plenty of demon blood. However, it is not enough to keep you tense at all since fight scenes are way too short. Battles involve more talking than fighting and tend to be settled with one stroke (by guess who). There is a significant lack of spectacularly choreographed fight sequences as seen in the games, which will no doubt be a major letdown. Animation quality is only mediocre for when there is actually action. If you're hoping Dante will pull devil trigger, unleash some insane combos, or wield his other devil arms, guess what? He won't!\r\nOh and yes, Trish and Lady are in this, but they’re drawn rather unattractively. No eye candy here. \n\r\nSound: Some heavy rock, some gothic choir tracks, all very forgettable. Seems even the lowliest of demons can speak Japanese. Voice acting and sound effects are acceptable, but nothing noteworthy. \n\r\nCharacters: Here it is, the reason you may be considering this anime: to see Dante kick plenty of ass. And here is also the show’s main failure: Dante is simply overpowered. Yes we know he’s super cool and skilled, but he faces absolutely no challenging adversaries at all. This entire anime is a series of totally one sided fights like I've never seen. Dante spends some time cracking jokes, his opponent says something stupid like “I stand a chance!”, and then Dante proceeds with delivering the pain. Except not in a spectacular, SSSmoking SSSick fashion. More like finishing it with one bullet from Ebony/Ivory or a couple swings of Rebellion. For fans of the games, this is a major kick to the balls and won’t leave you satisfied at all.\r\nOh, and apparently Dante loves eating strawberry sundaes on sunny afternoons, while getting bossed around by a precocious little girl. Who would've thought.\n\r\nEnjoyment: I loved the video games for their dramatic fight sequences, challenging bosses, cheesy humor and impossible physics. What the anime tries to duplicate, it does so without success. Dante is not so much kicking ass in this show as he is absentmindedly swatting flies. Your time would be better spent trying/ replaying the DMC video games. Except DMC2, let’s just forget that ever existed.\n\r\n5/10",
    "\n                Can you name a single video game that was turned into a movie that wasn't an extremely terrible film that failed in all regards?  Now can you name a good videogame that was turned into an anime that wasn't terrible?  Alright...you can probably name a whole bunch, alot from the choose-your-own-adventure genres.  However Devil May Cry is more like a terrible video game movie.  If you've ever played, or seen someone play, Devil May Cry then you know the style of the game quite well.  The quality and feel of the anime is nothing like that of the original videogame.\n\r\nStory:\n                  \n\nLame.  That single, bland word perfectly describes the storyline of this anime.  I wonder sometimes what the storywriters were thinking when they sat down to write this anime.  They clearly didn't put any heart or soul into this, and I hope that they had other projects that they deemed more important than this.  The real storyline begins in about episode 4-5.  When you have 12 episodes to tell a story in, and you spend the first third of the anime doing self contained episodes you know that you're off to a terrible start.  Even the story that they decide to throw in is terrible and quickly forgettable.\n\r\nArt: Some people praise the art, I however find it terrible to anything it tries to do.  The art is very clunky, the people seem to be squares and triangles and circles thrown together, the fluidity of the people is nonexistant.  Anyone who's seen the game knows what Dante looks like, and in the anime version he loses everything that makes him so cool in the game.  I got a very generic feeling from the art, it didn't seem that they were taking any risks, they were just doing the same old things over and over and the art seemed really stale.\n\r\nSound: The sound is good, the effects are good, the music is good.  I believe with almost absolute certainty that they took a lot of the music from the game itself and I found it was the single thing that I was connecting with as I watched with.\n\r\nCharacter: On the outside Dante is a badass. A pizza-eating, Strawberry Sundae drinking badass.  And on the inside?  Well...he's a badass.  And he's lazy.  He will beat up anyone, especially demons, because they piss him off.  And while he's exorcising the demons and doing whatever it is he does he doesn't seem to care at all.  Cause nothing is more badass than killing bad guys while not seeming to care about it at all.  Now....as the writers sat down they must have thought &quot;hmm...how exactly do we make a better anime when the main character is a rude, pizza-eating badass?&quot; and some guy went &quot;OH! MY! GOD! We add....a CUTE LITTLE GIRL! Who talks a lot and is a central part of the storyline so basically Dante is forced to stick beside her...people will LOVE IT!&quot; However...it doesn't work because it's been done a thousand times before, and it was original 10 years ago....and it was fresh then too.  But now it's not.  They also throw in characters from the games, but it feels forced and is quite annoying for anyone who's played the games.\n\r\nEnjoyment: Honestly, after episode 4 I stopped paying attention at all.  I really, really didn't care after episode 6. After episode 8 I could barely sit through each episode.  So I can honestly say that I didn't enjoy this anime at all.  At all.\n\r\nI wouldn't really recommend this to anyone who enjoys the game series.  It's such a huge disappointment if you're expecting it to be the game. However some people might really enjoy this anime, however I've never met anyone who enjoyed it.  The only good point is that it's only 12 episodes, so even if you hate it it's only 4 hours of your life....that you'll never get back.",
    "\n                Story (6) - Well, to avaluate devil may cry in this aspect is a bit hard..if we look at the anime it has almost no relation between episodes, and thats a negative point. Well, there are some connections, but the way the story goes is not directly connected, it is like each episode has is own story. By the story of all anime i give a 3. But i think each episode story is well made, so i give a 8 as an average of each episode story.\r\n(3+8)/2=5,5=6. If you like anime with good story, from the first episode to the last one, this is\n                  \n\nnot your kind of anime. I personally dont mind, and im opening for different kind of stories.\n\r\nArt (7) - Art is good, but nothing special in my opinion. Sometime it could be better, but is fine anyways, this is neither the strongest point neather the weakest.\n\r\nSound (10) - When i watched Dmc the first thing that got my attention was the opening..i liked it. Besides, character voices are good, the ending is also something great, background music is also nice. I have nothing negative to say about this aspect, so 10.\n\r\nCharacter (8) - Dante is great, and his personality  is well made. Some other suportt characters are also nice, but there are some that are not good at all. I think besides dante and 1 or 2 more, the rest is not anything special. \n\r\nEnjoyment (9) - I will only say this. i watched the first episode, and became interested in watching, and this is always a good aspect. I saw all the episodes really fast, and believe me, that is rare for me, because if it is nothing special i take more time to see all the episodes. \n\r\nOverall (8) - I agree when people says that devil may cry is nothing special, i already saw much better, but i cant say it is horrible, because it isnt. Its a fine and entretaining show, not the best, but good enough to be worth of watching.",
    "\n                Overall the Devil May Cry anime was pretty good. It's 12 episodes long. The animation and sound are good and it has action and humor. Many of the episodes look like one shots but everything is linked in the end. It won't confuse people who have not played the game and it won't bore those who have.\n\r\nMy criticism is that some of the action scenes are little cut. Dante starts fighting and a few seconds later fast forward, he's at home after winning the battle. \n\r\nAnother thing isn't really a critic as much as an observation, but I noticed after watching some game videos that\n                  \n\nanime Dante is more serious then game Dante. Sure he still loves pizza and strawberry sundaes, and he's still cocky and confident, and a little cheesy; but game Dante is cheesier, louder and more cheerful. I'm not saying anime Dante is an emo, far from it, he's just quiet, practically never smiles and he takes a lot of naps. While game Dante would say &quot;This party's getting crazy! :D&quot; and proceed to beat up the bad guys while eating pizza, I honestly can't imagine anime Dante saying such a line. Fighting while eating pizza and being cocky yes, but he would instead say with a serious face &quot;it gets R rated from here.&quot;\n\r\nAs for what's new in the anime. You'll get some more information about Dante's past and certain characters who have appeared in different games will finally meet. You'll also see Dante in his day to day life. My favorites are episodes 5, 9 and 12.",
    "\n                Devil May Cry\r\nI saw a lot of reviews hating this anime knowing nothing about the games and not knowing this was to promote DMC4 so one should keep in mind that, and also this was made by one of the writers of the game, so his personality is the same like in the games; The anime is set chronologically between DMC1 and DMC4, showing what heppened between the gap of the two and also how Lady and Trish met; This anime was refreshing and it's different from the games, less action than what the games offer but i enjoyed it, Dante doesn't even use all\n                  \n\nhis powers and the only one that can fight and even kill Dante is Vergil but he doesn't appear here for obvious reasons and it could seem Dante is immortal, well, he's immortal even in his human form in DMC4, but the thing is, only Vergil can kill him, that's why he kills demons so easily; oh and for me this is a great anime more for the enjoyment that i had than what the story offered.\n\r\nStory\r\nIt follows an episodic formula in which Dante does all kind of jobs, specially killing demons and everything related with demons, he will accept the jobs so he can pay his debts, and the causing of the big amount of debts are Trish and Lady because they're always taking a share of the payment he earns without their help; Almost at the last eps. the story will continue what was left in the first two and conclude with a good story but not surprising and predictable also at the very end everyone heading to the same place, the events of DMC4.\n\r\nArt & Animation\r\nThe animation was great, there's not much to say, it was well done, the character design was surprising, i was expecting something bad just because it was different from the character design of the games but Dante looks good, i really liked it and i was wrong to think it was going to be bad just because it wasn't like the games but yeah, the art style/animation was great considering it was from 2007.\n\r\nSound\r\nThe sound was great, the OP, the backrgound music, the weird thing was the ED, i don't think it was fitting; The VA made a great job specially for Dante, i thought Dante's voice was going to be bad, but it was on point of who he was at that point.\n\r\nCharacter\r\nBecause one writer helped to make the anime, the characters are just exactly like in the games and that's what i loved it, they didn't change it, they had the same personalities just a little changes on Lady tho and for the new characters, they were interesting, i liked that Dante had a contractor looking for jobs to offer him and i kind of liked the character of Patty, always cleaning the local and bothering him like if she was her little sister and he being cool about it. The enemies are weak but looking at the amount of enemies that appear at once or how many they appear in the whole anime, it's obvious they're not going to do anything to him, it's not even the amount that appears on any first chapter of the games but the characters were very good.\n\r\nEnjoyment\r\nGreat enjoyment, I liked this anime because i wanted to see something different from the games, i wanted to see how Dante handles his business, how he approached the jobs, this was a refreshing turn from the games, that's why it's a 9 well, mostly for the enjoyment but the surprising animation and great sound were decisive to give it a high score despite the weak but good story.",
    "\n                MUSIC:\n\r\nThe OP theme is fantabulous! (READ: Fantastic and Fabulous)\r\nIt really suits the anime, the theme of the anime. Somehow, I feel nostalgic every time I hear that instrumental song. But yeah, it's really nice.\n\r\nThe ED theme is a mellow&quot;Engrish&quot; song, but I don't get its meaning. Anyhow, it's a nice slowing down song for an action-packed anime.\n\r\nART/DRAWING/ANIMATION:\n\r\nThe art is superb! Even though it's based from a game, the animation/art of the characters is very nice, unlike other animes that are nice but fails in art, this one's great!\n\n\n\r\nThe animation is great! Being action-packed and blood-oriented, it's really captivating!\n\r\nSTORY:\n\r\nIt really doesn't have a plot, but in the end, you'll see the connection of the other episodes in its climax.\r\nAs I watched the first episode, I really got hooked that I continued watching it until it came to the &quot;stylish&quot; end. I guess this &quot;getting hooked&quot; thing is one factor of an anime that is good.\r\nEvery episode is a mission, meaning there are different stories, so don't expect a story for this anime.\n\r\nENJOYMENT:\r\nI really enjoyed every bit of this anime, and I don't know why. Somehow it gets repetitive, still, I love it! You can also see the protagonist being &quot;cold&quot; having a &quot;cute&quot; side too... It can also make you laugh at times, but rarely as this is a serious action anime with the guns and the swords and everything. All in all, enjoyment is seen in this anime.\n\r\nOVERALL:\r\nThis is a superb anime that you may want to watch! =)",
    "\n                At the time of my writing this review, I have attempted to watch past the first episode of the Devil May Cry anime four times. After I completerd the first episode I decided to leave it for a while, hoping that one day I would be in the mood for a stylish but brainless anime. Months later... I have realised this will not happen.\n\r\nThe story - or lack thereof - is disgusting. Fair enough, the DMC series never was known for its plot lines, but there is a huge difference between playing and watching (which is highlighted particularly by this anime).  I actually had\n                  \n\nto force myself to finish the first episode. There was a basic 'transport this girl to this place' thing going on... punctuated by a bunch of demons popping up and almost killing someone,  before Dante appeared out of nowhere and killed them EVERY SINGLE TIME. There was no character development either... just a stereotypically cool Dante doing all the stylish stuff we could make him do in the games. The sound was predictable and boring - Dante listens to hard rock because he's awesome; we get it. \n\r\nThe one thing this anime does have going for it is the art. It is relatively well-presented and ultra-stylish. That really doesn't make up for how remarkably poor every other aspect of it is.\n\r\nIn all honesty, I wish that I had discovered this anime somewhere in the middle of puberty, when I might actually have been content to kill brain cells by watching a guy shoot monsters over and over and over again. This is the only anime that I have abandoned to date. Steer clear.",
    "\n                This 12-episode anime was produced by Mad House, who had a hand in shows like Death Note, Hellsing, Chobits, etc. \n\r\nSo what went so @#%&amp; WRONG?! Come on, people, you have 3 games, 2 books, and 2 manga volumes worth of background to draw on and you give us Dante playing... death poker?? Are you @#%&amp; kidding me?? \n\r\nThe series has one story per episode for the first 10 episodes, and only develops a coherent plot in 11 and 12. The stories are boring, the action is practically nonexistent, and Dante is more of a cameo than the main character. \n\r\nWho the hell is the\n                  \n\ntarget audience here?? DMC demons do not haunt the world like ghosts and manipulate people from the sidelines. They drop down from portals and immediately get in your face with claws and lasers! But there's barely 10 seconds of action per episode, and crappy action at that. \n\r\nMost of it involved Dante shooting something in the head. If anything interesting does happen, it happens offscreen and is never explained. \r\nHow do you get that from a gaming franchise built on outlandishly stylish fighting?? By the way, Dante hardly talks and has no attitude. Yeah, out of DMC1 and DMC3 they picked DMC2 zombie-Dante. And whose idea was it to make Dante babysit an annoying little girl?? Ugh...",
    "\n                I'm not surprised one bit. No, really I'm not. It's a video game to anime/movie translation. Normally, these types of projects are horrible anyway. I'm sure many people know that this is based on the game of the same name, as it followed Dante completing missions by exterminating demons in some very stylish ways. Unfortunately, although the demon killing is present in the series. The greatness that was found in the games is completely lost. Those out there who sat through the Street Fighter Alpha series, Fatal Fury movies, or heaven forbid Art of Fighting. More than likely shouldn't be surprised and already have an\n                  \n\nidea on just how often the mark is missed. The only thing surprising to me is that the fans didn't outright obliterate this bullshit on release date like they did Street Fighter: Generations.\n\r\nVideo game to anime are mainly meant for one particular fan base, and that is fans of the games. However, as a fan of the game myself. I can tell you that this series doesn't do the game any justice at all, and as an anime, Devil May Cry is pretty much unwatchable. Devil May Cry has almost nothing to offer. \n\r\nThere's a dumpster load of reasons to hate this series. Right from the very beginning, I knew this series was going to be bad because Dante was given a chibi character named Patty to baby sit. This character along with many others serves absolutely no purpose, except to provide small repeated comedy relief which was never funny to begin with, and this is among the cliches that are present in this series. \n\r\nThe characters are incredibly bland, and the secondary characters make appearances for no reason other than to squeeze in popular faces from the video game. Outside of the way they fight, the viewer can forget about learning anything about them. The secondary characters who make their appearances are Trish and Lady: two female fighters that aren't even slightly developed, with only very small hints about them thrown out there.\n\r\nDante is a decent character sort of yet he's very lame as well. He deals out death packing his usual two pistols with a large sword, but his full abilities are never fully displayed. Even fans of the game should come away disappointed here. Try to imagine Ryu from Street Fighter never using his ultimate attack, which would be the \"Hadoken\", and you will get the picture. In addition, I find nothing cool about a character whom fights demons, but loses to children and everybody in grown up games. Plus, has a love for cherry sundaes? It just comes off weird to me. Instead, he should be drinking beer, some fuckin' robust, full bodied, imperial stouts or some shit.\n\r\nThe direction is atrocious. The series utilizes an episodic format which happens to become quite repetitive and very predictable. Clients would appear to Dante requesting his services, and each episode ends with some type of battle with a demon. Hints at a greater plot are mentioned very early. Only to be completely dropped and never mentioned again. \n\r\nGiving a tad bit of credit where it's due. Some of the villains are somewhat interesting with decent abilities, but every last one of them are poorly used in delivering good battles. The action sequences are very boring and lack a lot of imagination. Many of the fight scenes either consist of off screen and unseen action, or are decided in one move victories. This also includes demons that are heavily hyped in to being real threats. The battles are colossal disappointments, and they are cut too short for an action oriented fan whom has binged on a lot of action anime to really be pleased. There are too many action titles out there that very far surpasses this, and I'm talking titles that pre-date this at least a decade.  The ending is every bit as unsatisfying, bland, and nonsensical, as every thing that came before it. This series is almost a bigger waste of time than Hell Girl, and that's saying a lot.\n\r\nDevil May Cry at least stands out with its production values. It definitely looks pretty, and it smoothly blends in 3-D with CG. The artwork brings the Madhouse flavor with scantily clad chicks almost baring it all, and the character designs are very faithful to their video game counterparts. I didn't find any of the designs for the demons to be impressive. Only passable at the very best. \n\r\nThe soundtrack contains a real good opening theme, which is titled \"d.m.c.\", and quite honestly displays the best animation in the series. Plus, the ending theme is a nice song performed by Rin Oikawa called \"I'll Be Your Home\", but it's not worth sitting through 20+ minutes of bad anime to hear it. The voice work from the English cast was fine to me. Dante at times delivered some profanity filled lines, which were kind of funny. I can't comment on the Japanese cast, because I would never sit through this more than once. \n\r\nDevil May Cry is a nightmare for the anime vet and non fans of the game; but as a fan of the game, all this series does is make me want to play through the games for two reasons. Number one: to remind me that Devil May Cry really is a cool and entertaining franchise. Number two: to cleanse my mind of the vacuous tripe I've wasted my time on. I would say avoid this shit, but since it has a high rating I'm probably wasting my time.",
    "\n                I finished watching the whole series last night. DMC was simply awesome! \n\r\nI was looking for an anime that is shonen or seinen with a genre of action and with top priority on cool graphics - so I picked Devil May Cry with a lot of hesitations. \n\r\nI also thought I would never watched this kind of anime because I was tired with so detailed-like graphics and animation TV series I used to watch back then. But then again I thought, I'll give it a try. Man, I was wrong! I was hooked up right after I watched the first episode. \n\r\nI'll break down my\n                  \n\nthoughts on the anime without giving spoilers (hopefully). :)\n\r\nArt:\n\r\nWhen I watched the first episode, I said, &quot;WOW!&quot;.  The graphics left me in awe with nicely drawn characters and backgrounds. Colors used were also great - with Dante in red dress and white-grey hair of which I thought before was boring if this is his &quot;uniform&quot; but then again, I was wrong if you&rsquo;re caught up with the story.\n\r\nI give the art as 10/10.\n\r\nSound: \n\r\nThe OP soundtrack was superb and in sync with (flashes of) characters in their little scene. I did not read that entire lyrics of the ED soundtrack but the melody was nice. \n\r\nSound effects were also superb. \n\r\nOverall, sound is top-notch and I give it 10/10.\n\r\nStory: \n\r\nI like how the anime story was somewhat divided per episode but each ep was connected in reaching to the climax. I really like the last episode. It left me smiling after watching it. I like to watch more of this anime!\n\r\nI also like the fact that they employ humor in the story for the main character; though humors here are little as this anime focus on serious action. \n\r\nWhy it's not 10? Maybe because it's a short series and I would like watch more about the main character's development as he is in the anime.\n\r\nIt's 9/10 for me.\n\r\nCharacter:\n\r\nI say the main characters were cool with cool moves and were nicely drawn. I even found Dante sexy. Now, don&rsquo;t get me wrong. :D His moves were cool and sexy especially with his guns and sword. The lead female characters were also pretty cool and sexy. \n\r\nI give them 10/10.\n\r\nEnjoyment:\n\r\nThe entire series is a total enjoyment for me. Pretty cool characters and their moves with top notch graphics to go with. Story is not so intricate for me but it also gives mysteries which were unfolded in the climax. \n\r\nI totally enjoyed this anime, so it&rsquo;s 10/10. 2 thumbs up!\n\r\nI highly recommend this to those who look for action anime with very nice graphics, cool characters, superb sound, and story in one package.",
    "\n                Devil May Cry is something I desperately hoped would turn out great. Most things based off a video game- whether it be a movie, a book, or even an anime- are damned to fail. So for Devil May Cry, based on the video games of the same title, my hopes were that this work might succeed in its attempt to become a great anime. They might have been foolish, selfish wishes, but I wished that it at least would at least try.\r\nWas this anime as good as it could have been? The general consensus is no, as it seems. Why? To illustrate how an anime\n                  \n\nbecomes boring, a list, featuring Devil May Cry:\n\r\n1. Dante doesn’t have flaws.\r\nIf he does, they barely exist. He’s a freaking blank slate. He always defeats every demon in his way, EVERY TIME. Conflict? What conflict. If there isn’t anyone he can’t kill, then why even bother watching. Even Dante is aware of his extreme powers, and is constantly bored by his opponents. If he’s bored, we’re bored. You won’t be at the edge of your seat, because you know he can defeat whoever comes his way. It’s healthy to have the character lose once in a while, because it keeps the audience on edge. It’s permissible to never have the characters lose, but at least let them break a sweat. If Dante ever breaks a sweat, which he won’t, it’ll be the cool kind, like a strawberry sundae oozing down his face or a pizza slice breaking out of his pores and sliding with a greasy trail down to his- scratch that, that’s disturbing. I actually wanted Dante to lose or die in the end, because it would be a major twist from the usual formula of ‘I can’t defeat this guy… just kidding’ that Dante relies on all too often. It’s a level of boring that can only be matched by watching plastic grass grow. \n\r\n2. Being something all the time = boring.\r\nDante should not be cool 24/7. It gets boring and grating to watch. He’s cool when he sleeps. He’s cool when he eats his cool food. He’s cool when he walks all alone in the dark, in his cool outfit with his cool sword and cool shiny guns strapped to him and his cool poker face. He walks out of a fight without even a single speck of soil landing on his clothes and his hair immaculate. The coolness is great at first, but after the same thing all the goddamn time, you might even find yourself switching to “Mars of Destruction” instead of this crap. At least you can laugh at MoD.\n\r\n3. The plot comes at the last minute.\r\nLook at the picture for Devil May Cry. Go ahead, look at it. The white haired guy in front, as you probably know, is Dante. The other two guys are central to the plot, but show up at the next to last episode. That means the rest of the time was spent on NOTHING. The rest of the time is spent on Patty, who is basically Ciel’s fiancé Elizabeth from Kuroshitsuji mixed with Renge from Ouran High School Host Club. If you don’t know who those people are, the mishmash would be a grotesque mass of blonde hair, clingy personality, no point, and a really annoying tendency to appear at the worst times. That’s Patty for you, a girl who should’ve left after the first episode, but stuck around just to add another element of suck to the DMC headquarters.\n\r\nNow that we’ve got that out of the way, more about the plot. The plot is so rushed into the ending that they shouldn’t have even bothered. Most of the anime is just one episode dramas which have zero conflict because as I said before, Dante doesn’t lose. Ever. Devil May Cry is about Dante and friends having wonderful romps through their zany adventures of killing bloodthirsty demons. And Patty’s there too, I guess. It wasn’t very good, it’s very obvious it was based off a video game. There’s really no explanation of anything- I would have loved to hear the limitations of the demons, the limitations of Dante, or how Devil May Cry got started. Nobody gets that much of a backstory, no rules of the universe are explained, and no real emotional ties between characters are developed. It’s cripplingly average. The majority of the anime is Dante strutting around eating his strawberry sundaes and pizza and beer while shooting demons. It’s not very fun once you get passed the first episode.\r\nOn the technical side, it’s obvious that they did do a bit of demonology research, evidenced by names such as Baal, Modeus, and Dante. That, however, is to be expected and it‘s not very impressive.\n\r\nMoving right along to the art, there are a few things that need to be said about the dreaded art. It’s blasphemous to see an otherwise gorgeous characters massacred by unsavory art. Dante’s really hot, but you wouldn’t be able to tell because the damn animation could turn caviar into feces with a garnish of roadkill. Trish the sexbomb was reduced to Trish the kill-it-with-fire bomb. Lady went from looking like Meagan Fox to looking like something a fox just killed. The animation’s boxy and has a freaking ugly style. However, it gets a four because it’s not bad enough to deter you from watching the series. Most of the other things might.\n\r\nRight about here’s where characters are discussed, and it’s a real shame that they’re basically cardboard cut outs with traits slapped on to them. In fact, each character can be described in one sentence without fear of missing a personality aspect. They are all so flat that pieces of soggy paper say to their children, “Honey, some day you’ll be like Dante.”\r\nDante isn’t the only character at fault here. Lady is a chick who basically fills the screen when the animators take a break from Dante’s face, Patty is a chick who is there for comic relief, but it’s more like comic agony, and Trish is the girl who’s supposed to be really hot, but as I said before, the fault lies in the sub par animation. It’s notable that Patty is one of the few original (to this anime) characters here. The actual demons are transparent and you can see their explanations for their actions coming from a mile away (I wanted to battle the infamous Dante, I need to prove myself to master, I knew your father, etc).\n\r\nThe sound of the whole thing was okay. It was just alright. The choices were very obvious, like “DANT’S BAD@ZZ SO OBVSLY HE LURVES ROCKNROLL OMG LOL!!!1” It’s sickeningly mediocre rock, by the way. Nothing particularly hardcore.\n\r\nAs for the enjoyment, if you watch DMC, watch it for the ride. If you get tired of the same cool shtick over and over then watch a few episodes and don’t finish it, the ending does not carry a great payoff. Otherwise, I recommend this anime to those who are intrigued by badassery and badassery alone.",
    "\n                Basically, Devil  May Cry is about a half demon half human who takes on a job as a Demon Hunter. If you love shiny guns, motorcycles, blood and shiny swords, this may be the anime for you.\n\r\nStory: (6/10)\r\nThe story isn't really bad. It has the right materials which are pretty substantial. In other words, the background of the story was great! It's very interesting; European setting, demons, Demon Hunter and so on. But then, the materials weren't used properly. So the story flow became really dull. The story development wasn't really visible. It was only until the 11th episode that the climax was drawn.\n                  \n\nAnd as soon as you're finally enjoying the climax, you suddenly get lost because the series has already ended. Personally, I think that the series was simply too rushed. I believe this would have been a better series if the story was more developed.\n\r\nArt: (9/10)\r\nThe drawings are good. The proportions are great. But what I love most about this anime are the shiny guns, Dante's sword, some motorcycle scenes and the bloody scenes. Graphics' really good. The art complemented with the story and the atmosphere it was trying to give off.\n\r\nSound: (5/10)\r\nSorry to say, I did not notice the sound at all. I only heard the gunshots and the dubs. Maybe it was part of the main idea of the story. But I think that more sounds would help define the atmosphere. That aside, I did NOT enjoy the OP and ED at all.\n\r\nCharacter: (6/10)\r\nThe characters are interesting, but they were not developed well. The same comment as the story. They good materials but were not used well. For one thing, Dante's father and mother could have been given some light, but they weren't.The other two female characters, Lady and the girl that could use thunder could have also been given some emphasis. Simply put, there were not enough interesting flashbacks for the viewers to sympathize are empathize with.\n\r\nEnjoyment: (8/10)\r\nWell, it was funny and action packed. Again, you'll really enjoy this if you love guns and blood.\n\r\nOverall: (7/10)\r\nThough the story and characters were underdeveloped, the anime's decently enjoyable.",
    "\n                This is a bit of an odd show for me to talk about. On the one hand, looking at it critically is pretty difficult. It's based on a game series that I really like, and they really do the games justice, and trying to look at it critically makes me feel like I'm nitpicking issues that didn't really impact my enjoyment at the end of it all. However, I do want to be somewhat fair with it, so I'll give them two ratings: one as a fan of the games, and one just looking at it as is.\n\r\nAs a fan of the games, the show\n                  \n\ndoes just about everything that I could've hoped for. If all you're looking for is a show that represents what the games are all about while also getting a new story, this does the job pretty well. I am honestly surprised that this show isn't brought up more when it comes to good video game adaptations, at least when talking about representing the source material in a good way. There's a few things that I feel like they could've improved on when making the show, like sometimes I feel like Dante's a bit too much of an asshole at times, but they're pretty nit-picky, and it's not really a distracting issue, just something I feel like fans would pick up on. I really can't say much more about it from the perspective of a fan, so I suppose it's time to talk about specific things about the show.\n\r\nBefore I get to the thing that some people might have an issue with, I actually want to praise a couple of things before I get to that. First: the animation. It's pretty damn good looking, which is pretty common for shows made by Studio Madhouse. The show was made just around the time when digital animation started to look really good in TV shows, and it looks really good, especially for the time. It's all mainly hand drawn, but mixes some CGI in there, but only for very specific moments when you'd probably not even notice the CGI. It also just looks good stylistically. The day time/bright scenes look decent, albeit kinda standard, but the show looks especially good in the night/dark. I could go into way more detail, but there's a lot of layers to making stuff look good in different lightings, so... I dunno, watch a YouTube video explaining it.\n\r\nThe other thing I want to talk about is the music. The music in this show is pretty damn awesome. Some of the tracks feel like your typical anime tracks, nothing good, nothing bad, but the tracks they play in fight scenes are pretty friggin' rad, especially near the end. The track \"Evil Spirit\" in particular really sticks out as a really good track. The opening theme and ending are pretty damn good too. I don't really have much else to say about the music, it's just really good, and I wish it was available regularly.\n\r\nNow, for the one issue I feel like a lot of people might have. If you aren't a fan of the games, then I can't really see this doing that much for you. I mean, on its own, it's decent, but nothing too special. The characters feel like standard anime characters, the story is pretty standard, it would most likely just feel standard if you aren't really familiar with the source material. It's fine, but having knowledge of the games makes it way more enjoyable.\n\r\nSo, as a fan of the games, it's like an 8/10. Very much a must watch if you like the Devil May Cry series. Looking at it without knowing the games, it's like a 5 or 6/10.",
    "\n                A lot of gamers are, at least, familiar with Capcom's Devil May Cry. The franchise is pretty beloved, except for that reboot one where Dante had dark hair and was, objectively, a piece of shit. In 2007, after the third instalment but before the fourth, our old friends at Madhouse started releasing an anime based off of the games. That's right, the studio that brought us such adaptations as X-men, Metropolis, and FF Legend of the Crystals was behind this. Well, maybe this one isn't a pile of garbage like those were. Well, except Metropolis. It was just sub-par. \n\r\nStory:\n\r\nWe open with Morrison bringing Dante\n                  \n\na job. Now, you might find yourself asking “who the hell is  Morrison?” He's an original character who basically exists to bring Dante work and, occasionally, drive him around. The job is simple, Dante just has to safely escort a young orphan girl to the estate of the deceased father she never met to claim her inheritance. Naturally, she's being hunted by demons. \n\r\nThis is one of those anime where the underlying plot is pretty light and most episodes are just doing their own thing. Dante gets a job that somehow involves demons and then he goes out to slay them. In fact, the weakest part of the series is the big underlying plot. You get little snippets of it in quite a few episodes, but it ultimately involves a lot of contrivance and it's just not very good in general. Even the ongoing stuff that's meant to draw your attention to the fact that something is afoot is largely just dull and really obvious. To the point where it's just “this again” after a few times. The episodes also have a general problem of trying way too hard to give happy endings. To the point where they can just go completely off the rails and not make much sense. There are quite a few episodes that set things up for sad or, at the very least, bitter-sweet endings and then pull happy ones out of their anuses. I guess I missed the memo about DMC being for small children who can't process tragedy on account of the PEGI 16 ratings. \n\r\nWith that being said, a lot of the episodic scenarios are pretty interesting. Varied too. Yeah, you know that Dante is going to fight some demon,  but there's a lot of variation in what kinds of demons he'll fight and how they'll approach. Some of them use stealthy approaches or try to use guile, others prefer the direct approach. Some are after him specifically, others just happen to stumble upon him while going about their terrible business. And some of the scenarios are really intricate. The death poker game being a prime example. \n\r\nCharacters:\n\r\nThe characters from the games, Dante, Trish & Lady are all portrayed pretty true to character. Which is more than a certain reboot managed. In terms of original characters, some of the ones Dante encounters on his missions are kind of interesting. Others are pretty mediocre. Then we have our reoccurring Ocs, Morrison & Patty. Morrison is a boring character. We don't know why he's bringing Dante jobs, how they met or anything beyond “he brings Dante jobs.” He's pretty much on par with the plot coupon guy from your average PreCure series. And those can get by with it because they are actually for children. Then we have Patty. Have you ever wondered what Devil May Cry would be like if Dante had a slightly annoying child sidekick? No? Well, it's not the best decision that Madhouse could have made. She spends a lot of time pestering Dante, having to be rescued and contributing virtually nothing. \n\r\nArt:\n\r\nThe artwork is pretty decent. The characters look like themselves and Madhouse clearly made an effort to make the aesthetic look like DMC. The demon designs are generally pretty good as well. The trouble is that the action sequences themselves aren't all that good. In a series that relies heavily on action sequences. A lot of the “big” Dante fights end very quickly without having much content. And a lot of the sequences focus heavily on scenes of Dante attacking while not showing, or barely showing, his opponent. It would've benefited from showing them striking at one another in the same frames a bit more, is what I'm saying. Oh, and expect a lot of deaths to go the blood fountain route. I guess demon blood streams are highly pressurised. \n\r\nSound:\n\r\nThe series did get some good voice actors. We've got Morikawa Toshiyuki as Dante. Yes, Dante and Sephiroth are the same guy. We all suspected it given the resemblance. We've got Orikasa Fumiko and Tanaka Atsuko, both of whom are damn good actresses, as Lady and Trish respectively. Even the less interesting characters got some decent voices. The musical score by Hama Takeshi & Tsutsumi Hiroaki is pretty close to fantastic. \n\r\nHo-yay:\n\r\nThere isn't any, really. The closest you're going to get is Lady and Trish forming a friendship. \n\r\nFinal Thoughts:\n\r\nDevil May Cry is an anime that had some potential. After all, there's a lot to work with from the games. Unfortunately, it's held back by a dull underlying plot, trying too hard to provide happy endings, the slightly annoying child sidekick and mundane action sequences. Ultimately, I'd still say it's all right  but it certainly could have been better. My final rating is a 6/10. Next week we'll continue video game month with a look at Street Fighter Alpha.",
    "\n                Have you guys ever heard that video game base on movie are just merely a product? Well, i remember some crappy video game base on movie game like Transformers, or ET. But maybe some game like Lord of the Ring or maybe the recent Wolverine game for the PC is good. Speaking of game, now i going comment a anime that was base from one of the best game from Capcom call 'Devil May Cry' (wahhhhh.....), and how that i think about it; well, let's find out!\n\r\nDMC, when it say it going to become an anime; i like any other DMC player are jump for\n                  \n\njoy for it adaption. But after going through all the 12 episode of DMC, i like any other DMC player are down with sorrow and anger that what the hell the director has done on DMC.\n\r\nThe story in this anime are all episodic, each episode are stand alone story until episode 9 or 10 where the real plot has finally started. And each episode are all the same: \n\r\n1,there is a demon case\r\n2,Dante sitting around and do nothing (or maybe try to annoy Patty stupid problem) until Morrison say 'get your ass up! We got work to do, blah blah blah....'\r\n3,He goes to work, have some help from Lady and Trish\r\n4,He blew the work, mission accomplish and his debt is increase. The End!\n\r\nThat it! Nothing new, no plot that connected to other plot, zero! Until episode 9 or 10.\n\r\nSure you have character like Dante, Lady, and Trish to be animated here, and you do have character only for this anime, like Patty, she has been on the series since episode only has 'finally' been serve as a important character on episode 9 or 10, for the rest of the episode she just serve as a annoying brat! And Morrison, Dante agent always try to bring him a good job but end getting mess up by Dante.\n\r\nFor Dante, Lady, and Trish (i still want make a comment on them!), Dante still Dante, like pizza and strawberry, and weild Ebony & Ivory and Rebellion to fight off demon. And the funny thing is, he use his gun more than his sword! Even the director finally let him use it, the sword battle are just temporary! But Trish and Lady still play their role where they supposed to be, to support Dante and take Dante credit!\n\r\nAnimation is good, no less. The shading and everything was good. Even the bike scene in episode 2 are well done. Plus the OP of the series was nice, able to blend in the series as well. But the ED (though i didn't listen that often) was smooth and relax.\n\r\nWhat is the credit for us finishing DMC anime? Zero!\r\nWhat is the credit for them finishing DMC anime?Promoting DMC4!\r\nWhat is the credit for us buying DMC anime DVD?More DMC4 bonus!\n\r\nAnd in my opinion, this bonus are come to nothing and pointless after the real thing is out. The anime just bring down Dante good point and completely destroy the DMC atmosphere. And DMC is not the only one being anime, other like 'Tales of...', '.Hack' did make the series well and on going. And heck, even the live action Resident Evil movie was better than this!\n\r\nThat why product movie, animation, comic or anything that is base on something are mostly not a good thing!",
    "\n                Devil May Cry is a very strange series. It does its thing nicely for a bit but then goes and ruins it with some silly nonsense. I have no idea why or how that happened. I mean, the games are pretty consistently decent—so why isn't this show the same?\n\r\nLet's begin with this totally alien concept called the story. Of which you won't be getting any for about 9 episodes in a row (yes, out of 12 total). No joke—this is essentially a slice-of-life series about Dante showing off. And before you ask the obvious question—yes, it has less of a story than the action games\n                  \n\nthe setting is taken from. Furthermore—just to tease you—at several points you get an impression that some general plot is about to emerge (it eventually does, but already after you have lost all hope for it), but the very next moment you have your expectations casually ruined once again. You could probably even watch episodes 2–9 in any order without disturbing the narrative. For that exact reason you shouldn't worry about spoilers when discussing this series, as it's virtually impossible to spoil anything of substance. Rating the story with 3 is me being generous here, owing it mostly to the universe created by the DMC game series.\n\r\nOh yeah, Dante. As I mentioned earlier, everything in this series is about showing Dante in the process of, uh... being cool? He tries so hard he transcends the meaning of the word \"cool\", being the living embodiment of coolness never seen since the cool came to cool town. He always has that swag going, and his sense of fashion oozes style—as imagined by a 14-year-old. Obviously, he only eats the most badass food in existence... you guessed it, as imagined by a 14-year-old: pizza, strawberry sundae, beer—none of your chump gourmet garbage. He has the craziest, totally overpowered weapons—because dramatic stakes are for pussies. Even his name has that aristocratic feel to it. Unsurprisingly, every time he's up for a job, he always does it single-handedly—be it a bike race, gambling, or butchering a several-stories-tall demon in mere seconds—always with that detached facial expression that serves to underline his towering superiority. Yet somehow he always fails to complete his primary objective because he's just too damn righteous or whatever. Ermagherd, what an impossibly cool dude! And even during all that action, he appears to be bored out of his mind, almost depressed by doing something so utterly mundane. One-Punch Man too popular for you? Take a look at this gem then: DMC did the \"overpowered MC bored by flaccid antagonists\" shtick some 8 years before everyone's favorite egghead came into being. Hellsing Ultimate has too much of that annoying character development? DMC should be right up your alley—it doesn't have any of that. Ladies and gentlemen, we have officially reached peak shallow. If you aren't sure what \"peak shallow\" looks like, imagine a zit on the ground; that should work.\n\r\nOn the topic of characters, the entire cast is mainly there to support Dante by... yes, being glorified foils, looking deliberately uncool in comparison. First, we have Morrison, who is old-fashioned, intelligent, and an exemplary gentleman, almost a polar opposite of Dante. Then there's Patty, the token loli moe-blob comic relief character whose presence is never justified despite screenwriter's best efforts (which fail spectacularly, of course). A notable character is the creatively-named Lady, who is also quite a cool, uh, lady—but... still not quite there, you know? This, however, doesn't prevent her from being far more capable at her job. But hey, if Dante doesn't bother doing the thing, it must not be very cool after all, right? There's also Trish, who is somewhere between Lady and Dante on the scale on coolness and never gets any screen time. The distribution of screen time in general seems to be decided by a coin toss, befitting the interchangeable, meandering nature of the support cast. (That said, I gotta give some credit to designs and the fact that they're occasionally entertaining (if only because they try so hard) and evoke memories of better-written characters from the action anime of the days past; really makes you wish they were put in capable hands.) Lastly, there is that typical cartoony small fry antagonist who, despite being an obnoxious eyesore, behaves like a plot-significant character and—in a great plot twist (gasp!)—actually ends up being one. At that point you'll just have to be a man and brace yourself for the trainwreck. Even if you're a woman, become a man and then brace yourself; there is no sweeter imagery than a man bracing himself for a trainwreck.\n\r\nThere isn't much to say about the show's sound and visuals. They're generally competently made and adequate for the subject matter, though some scenes could have definitely been animated better (as in *actually animated* rather than panned across the screen), and the music somewhat lacks variety—almost all of it is mere variations on the three dominant themes.\n\r\nAll in all, DMC is the kind of show you'd want for some simple braindead entertainment when you've run out of the more entertaining content to watch. Don't expect anything beyond that, as you'll be met with nothing but disappointment. Just get your beverage of choice, a pack of favorite snacks, press play, and tune out. Alternatively, go play the original games and forget the anime adaptation ever existed.",
    "\n                If you’ve never heard of Devil May Cry before and are looking for a good action anime, this is not it. If you’re a fan of the video games and want to see more stylish ass-kickery, prepare to be disappointed. \n\r\nStory: Dante is running his business, performing mundane tasks for clients like demon-slaying, saving the world, the usual. Almost every episode starts and concludes one of Dante’s assigned cases, involving nasty monsters that inevitably end up dead. There is some cheap drama that focuses on a young girl whom Dante saved and a loser demon who wants to become a god, but you’re not seriously\n                  \n\nhere for the plot are you?\n\r\nArt: The art style is able to create a dark, gothic atmosphere where Dante spills plenty of demon blood. However, it is not enough to keep you tense at all since fight scenes are way too short. Battles involve more talking than fighting and tend to be settled with one stroke (by guess who). There is a significant lack of spectacularly choreographed fight sequences as seen in the games, which will no doubt be a major letdown. Animation quality is only mediocre for when there is actually action. If you're hoping Dante will pull devil trigger, unleash some insane combos, or wield his other devil arms, guess what? He won't!\r\nOh and yes, Trish and Lady are in this, but they’re drawn rather unattractively. No eye candy here. \n\r\nSound: Some heavy rock, some gothic choir tracks, all very forgettable. Seems even the lowliest of demons can speak Japanese. Voice acting and sound effects are acceptable, but nothing noteworthy. \n\r\nCharacters: Here it is, the reason you may be considering this anime: to see Dante kick plenty of ass. And here is also the show’s main failure: Dante is simply overpowered. Yes we know he’s super cool and skilled, but he faces absolutely no challenging adversaries at all. This entire anime is a series of totally one sided fights like I've never seen. Dante spends some time cracking jokes, his opponent says something stupid like “I stand a chance!”, and then Dante proceeds with delivering the pain. Except not in a spectacular, SSSmoking SSSick fashion. More like finishing it with one bullet from Ebony/Ivory or a couple swings of Rebellion. For fans of the games, this is a major kick to the balls and won’t leave you satisfied at all.\r\nOh, and apparently Dante loves eating strawberry sundaes on sunny afternoons, while getting bossed around by a precocious little girl. Who would've thought.\n\r\nEnjoyment: I loved the video games for their dramatic fight sequences, challenging bosses, cheesy humor and impossible physics. What the anime tries to duplicate, it does so without success. Dante is not so much kicking ass in this show as he is absentmindedly swatting flies. Your time would be better spent trying/ replaying the DMC video games. Except DMC2, let’s just forget that ever existed.\n\r\n5/10",
    "\n                Can you name a single video game that was turned into a movie that wasn't an extremely terrible film that failed in all regards?  Now can you name a good videogame that was turned into an anime that wasn't terrible?  Alright...you can probably name a whole bunch, alot from the choose-your-own-adventure genres.  However Devil May Cry is more like a terrible video game movie.  If you've ever played, or seen someone play, Devil May Cry then you know the style of the game quite well.  The quality and feel of the anime is nothing like that of the original videogame.\n\r\nStory:\n                  \n\nLame.  That single, bland word perfectly describes the storyline of this anime.  I wonder sometimes what the storywriters were thinking when they sat down to write this anime.  They clearly didn't put any heart or soul into this, and I hope that they had other projects that they deemed more important than this.  The real storyline begins in about episode 4-5.  When you have 12 episodes to tell a story in, and you spend the first third of the anime doing self contained episodes you know that you're off to a terrible start.  Even the story that they decide to throw in is terrible and quickly forgettable.\n\r\nArt: Some people praise the art, I however find it terrible to anything it tries to do.  The art is very clunky, the people seem to be squares and triangles and circles thrown together, the fluidity of the people is nonexistant.  Anyone who's seen the game knows what Dante looks like, and in the anime version he loses everything that makes him so cool in the game.  I got a very generic feeling from the art, it didn't seem that they were taking any risks, they were just doing the same old things over and over and the art seemed really stale.\n\r\nSound: The sound is good, the effects are good, the music is good.  I believe with almost absolute certainty that they took a lot of the music from the game itself and I found it was the single thing that I was connecting with as I watched with.\n\r\nCharacter: On the outside Dante is a badass. A pizza-eating, Strawberry Sundae drinking badass.  And on the inside?  Well...he's a badass.  And he's lazy.  He will beat up anyone, especially demons, because they piss him off.  And while he's exorcising the demons and doing whatever it is he does he doesn't seem to care at all.  Cause nothing is more badass than killing bad guys while not seeming to care about it at all.  Now....as the writers sat down they must have thought &quot;hmm...how exactly do we make a better anime when the main character is a rude, pizza-eating badass?&quot; and some guy went &quot;OH! MY! GOD! We add....a CUTE LITTLE GIRL! Who talks a lot and is a central part of the storyline so basically Dante is forced to stick beside her...people will LOVE IT!&quot; However...it doesn't work because it's been done a thousand times before, and it was original 10 years ago....and it was fresh then too.  But now it's not.  They also throw in characters from the games, but it feels forced and is quite annoying for anyone who's played the games.\n\r\nEnjoyment: Honestly, after episode 4 I stopped paying attention at all.  I really, really didn't care after episode 6. After episode 8 I could barely sit through each episode.  So I can honestly say that I didn't enjoy this anime at all.  At all.\n\r\nI wouldn't really recommend this to anyone who enjoys the game series.  It's such a huge disappointment if you're expecting it to be the game. However some people might really enjoy this anime, however I've never met anyone who enjoyed it.  The only good point is that it's only 12 episodes, so even if you hate it it's only 4 hours of your life....that you'll never get back.",
    "\n                Story (6) - Well, to avaluate devil may cry in this aspect is a bit hard..if we look at the anime it has almost no relation between episodes, and thats a negative point. Well, there are some connections, but the way the story goes is not directly connected, it is like each episode has is own story. By the story of all anime i give a 3. But i think each episode story is well made, so i give a 8 as an average of each episode story.\r\n(3+8)/2=5,5=6. If you like anime with good story, from the first episode to the last one, this is\n                  \n\nnot your kind of anime. I personally dont mind, and im opening for different kind of stories.\n\r\nArt (7) - Art is good, but nothing special in my opinion. Sometime it could be better, but is fine anyways, this is neither the strongest point neather the weakest.\n\r\nSound (10) - When i watched Dmc the first thing that got my attention was the opening..i liked it. Besides, character voices are good, the ending is also something great, background music is also nice. I have nothing negative to say about this aspect, so 10.\n\r\nCharacter (8) - Dante is great, and his personality  is well made. Some other suportt characters are also nice, but there are some that are not good at all. I think besides dante and 1 or 2 more, the rest is not anything special. \n\r\nEnjoyment (9) - I will only say this. i watched the first episode, and became interested in watching, and this is always a good aspect. I saw all the episodes really fast, and believe me, that is rare for me, because if it is nothing special i take more time to see all the episodes. \n\r\nOverall (8) - I agree when people says that devil may cry is nothing special, i already saw much better, but i cant say it is horrible, because it isnt. Its a fine and entretaining show, not the best, but good enough to be worth of watching.",
    "\n                Overall the Devil May Cry anime was pretty good. It's 12 episodes long. The animation and sound are good and it has action and humor. Many of the episodes look like one shots but everything is linked in the end. It won't confuse people who have not played the game and it won't bore those who have.\n\r\nMy criticism is that some of the action scenes are little cut. Dante starts fighting and a few seconds later fast forward, he's at home after winning the battle. \n\r\nAnother thing isn't really a critic as much as an observation, but I noticed after watching some game videos that\n                  \n\nanime Dante is more serious then game Dante. Sure he still loves pizza and strawberry sundaes, and he's still cocky and confident, and a little cheesy; but game Dante is cheesier, louder and more cheerful. I'm not saying anime Dante is an emo, far from it, he's just quiet, practically never smiles and he takes a lot of naps. While game Dante would say &quot;This party's getting crazy! :D&quot; and proceed to beat up the bad guys while eating pizza, I honestly can't imagine anime Dante saying such a line. Fighting while eating pizza and being cocky yes, but he would instead say with a serious face &quot;it gets R rated from here.&quot;\n\r\nAs for what's new in the anime. You'll get some more information about Dante's past and certain characters who have appeared in different games will finally meet. You'll also see Dante in his day to day life. My favorites are episodes 5, 9 and 12.",
    "\n                Devil May Cry\r\nI saw a lot of reviews hating this anime knowing nothing about the games and not knowing this was to promote DMC4 so one should keep in mind that, and also this was made by one of the writers of the game, so his personality is the same like in the games; The anime is set chronologically between DMC1 and DMC4, showing what heppened between the gap of the two and also how Lady and Trish met; This anime was refreshing and it's different from the games, less action than what the games offer but i enjoyed it, Dante doesn't even use all\n                  \n\nhis powers and the only one that can fight and even kill Dante is Vergil but he doesn't appear here for obvious reasons and it could seem Dante is immortal, well, he's immortal even in his human form in DMC4, but the thing is, only Vergil can kill him, that's why he kills demons so easily; oh and for me this is a great anime more for the enjoyment that i had than what the story offered.\n\r\nStory\r\nIt follows an episodic formula in which Dante does all kind of jobs, specially killing demons and everything related with demons, he will accept the jobs so he can pay his debts, and the causing of the big amount of debts are Trish and Lady because they're always taking a share of the payment he earns without their help; Almost at the last eps. the story will continue what was left in the first two and conclude with a good story but not surprising and predictable also at the very end everyone heading to the same place, the events of DMC4.\n\r\nArt & Animation\r\nThe animation was great, there's not much to say, it was well done, the character design was surprising, i was expecting something bad just because it was different from the character design of the games but Dante looks good, i really liked it and i was wrong to think it was going to be bad just because it wasn't like the games but yeah, the art style/animation was great considering it was from 2007.\n\r\nSound\r\nThe sound was great, the OP, the backrgound music, the weird thing was the ED, i don't think it was fitting; The VA made a great job specially for Dante, i thought Dante's voice was going to be bad, but it was on point of who he was at that point.\n\r\nCharacter\r\nBecause one writer helped to make the anime, the characters are just exactly like in the games and that's what i loved it, they didn't change it, they had the same personalities just a little changes on Lady tho and for the new characters, they were interesting, i liked that Dante had a contractor looking for jobs to offer him and i kind of liked the character of Patty, always cleaning the local and bothering him like if she was her little sister and he being cool about it. The enemies are weak but looking at the amount of enemies that appear at once or how many they appear in the whole anime, it's obvious they're not going to do anything to him, it's not even the amount that appears on any first chapter of the games but the characters were very good.\n\r\nEnjoyment\r\nGreat enjoyment, I liked this anime because i wanted to see something different from the games, i wanted to see how Dante handles his business, how he approached the jobs, this was a refreshing turn from the games, that's why it's a 9 well, mostly for the enjoyment but the surprising animation and great sound were decisive to give it a high score despite the weak but good story.",
    "\n                MUSIC:\n\r\nThe OP theme is fantabulous! (READ: Fantastic and Fabulous)\r\nIt really suits the anime, the theme of the anime. Somehow, I feel nostalgic every time I hear that instrumental song. But yeah, it's really nice.\n\r\nThe ED theme is a mellow&quot;Engrish&quot; song, but I don't get its meaning. Anyhow, it's a nice slowing down song for an action-packed anime.\n\r\nART/DRAWING/ANIMATION:\n\r\nThe art is superb! Even though it's based from a game, the animation/art of the characters is very nice, unlike other animes that are nice but fails in art, this one's great!\n\n\n\r\nThe animation is great! Being action-packed and blood-oriented, it's really captivating!\n\r\nSTORY:\n\r\nIt really doesn't have a plot, but in the end, you'll see the connection of the other episodes in its climax.\r\nAs I watched the first episode, I really got hooked that I continued watching it until it came to the &quot;stylish&quot; end. I guess this &quot;getting hooked&quot; thing is one factor of an anime that is good.\r\nEvery episode is a mission, meaning there are different stories, so don't expect a story for this anime.\n\r\nENJOYMENT:\r\nI really enjoyed every bit of this anime, and I don't know why. Somehow it gets repetitive, still, I love it! You can also see the protagonist being &quot;cold&quot; having a &quot;cute&quot; side too... It can also make you laugh at times, but rarely as this is a serious action anime with the guns and the swords and everything. All in all, enjoyment is seen in this anime.\n\r\nOVERALL:\r\nThis is a superb anime that you may want to watch! =)",
    "\n                At the time of my writing this review, I have attempted to watch past the first episode of the Devil May Cry anime four times. After I completerd the first episode I decided to leave it for a while, hoping that one day I would be in the mood for a stylish but brainless anime. Months later... I have realised this will not happen.\n\r\nThe story - or lack thereof - is disgusting. Fair enough, the DMC series never was known for its plot lines, but there is a huge difference between playing and watching (which is highlighted particularly by this anime).  I actually had\n                  \n\nto force myself to finish the first episode. There was a basic 'transport this girl to this place' thing going on... punctuated by a bunch of demons popping up and almost killing someone,  before Dante appeared out of nowhere and killed them EVERY SINGLE TIME. There was no character development either... just a stereotypically cool Dante doing all the stylish stuff we could make him do in the games. The sound was predictable and boring - Dante listens to hard rock because he's awesome; we get it. \n\r\nThe one thing this anime does have going for it is the art. It is relatively well-presented and ultra-stylish. That really doesn't make up for how remarkably poor every other aspect of it is.\n\r\nIn all honesty, I wish that I had discovered this anime somewhere in the middle of puberty, when I might actually have been content to kill brain cells by watching a guy shoot monsters over and over and over again. This is the only anime that I have abandoned to date. Steer clear.",
    "\n                This 12-episode anime was produced by Mad House, who had a hand in shows like Death Note, Hellsing, Chobits, etc. \n\r\nSo what went so @#%&amp; WRONG?! Come on, people, you have 3 games, 2 books, and 2 manga volumes worth of background to draw on and you give us Dante playing... death poker?? Are you @#%&amp; kidding me?? \n\r\nThe series has one story per episode for the first 10 episodes, and only develops a coherent plot in 11 and 12. The stories are boring, the action is practically nonexistent, and Dante is more of a cameo than the main character. \n\r\nWho the hell is the\n                  \n\ntarget audience here?? DMC demons do not haunt the world like ghosts and manipulate people from the sidelines. They drop down from portals and immediately get in your face with claws and lasers! But there's barely 10 seconds of action per episode, and crappy action at that. \n\r\nMost of it involved Dante shooting something in the head. If anything interesting does happen, it happens offscreen and is never explained. \r\nHow do you get that from a gaming franchise built on outlandishly stylish fighting?? By the way, Dante hardly talks and has no attitude. Yeah, out of DMC1 and DMC3 they picked DMC2 zombie-Dante. And whose idea was it to make Dante babysit an annoying little girl?? Ugh...",
    "\n                I'm not surprised one bit. No, really I'm not. It's a video game to anime/movie translation. Normally, these types of projects are horrible anyway. I'm sure many people know that this is based on the game of the same name, as it followed Dante completing missions by exterminating demons in some very stylish ways. Unfortunately, although the demon killing is present in the series. The greatness that was found in the games is completely lost. Those out there who sat through the Street Fighter Alpha series, Fatal Fury movies, or heaven forbid Art of Fighting. More than likely shouldn't be surprised and already have an\n                  \n\nidea on just how often the mark is missed. The only thing surprising to me is that the fans didn't outright obliterate this bullshit on release date like they did Street Fighter: Generations.\n\r\nVideo game to anime are mainly meant for one particular fan base, and that is fans of the games. However, as a fan of the game myself. I can tell you that this series doesn't do the game any justice at all, and as an anime, Devil May Cry is pretty much unwatchable. Devil May Cry has almost nothing to offer. \n\r\nThere's a dumpster load of reasons to hate this series. Right from the very beginning, I knew this series was going to be bad because Dante was given a chibi character named Patty to baby sit. This character along with many others serves absolutely no purpose, except to provide small repeated comedy relief which was never funny to begin with, and this is among the cliches that are present in this series. \n\r\nThe characters are incredibly bland, and the secondary characters make appearances for no reason other than to squeeze in popular faces from the video game. Outside of the way they fight, the viewer can forget about learning anything about them. The secondary characters who make their appearances are Trish and Lady: two female fighters that aren't even slightly developed, with only very small hints about them thrown out there.\n\r\nDante is a decent character sort of yet he's very lame as well. He deals out death packing his usual two pistols with a large sword, but his full abilities are never fully displayed. Even fans of the game should come away disappointed here. Try to imagine Ryu from Street Fighter never using his ultimate attack, which would be the \"Hadoken\", and you will get the picture. In addition, I find nothing cool about a character whom fights demons, but loses to children and everybody in grown up games. Plus, has a love for cherry sundaes? It just comes off weird to me. Instead, he should be drinking beer, some fuckin' robust, full bodied, imperial stouts or some shit.\n\r\nThe direction is atrocious. The series utilizes an episodic format which happens to become quite repetitive and very predictable. Clients would appear to Dante requesting his services, and each episode ends with some type of battle with a demon. Hints at a greater plot are mentioned very early. Only to be completely dropped and never mentioned again. \n\r\nGiving a tad bit of credit where it's due. Some of the villains are somewhat interesting with decent abilities, but every last one of them are poorly used in delivering good battles. The action sequences are very boring and lack a lot of imagination. Many of the fight scenes either consist of off screen and unseen action, or are decided in one move victories. This also includes demons that are heavily hyped in to being real threats. The battles are colossal disappointments, and they are cut too short for an action oriented fan whom has binged on a lot of action anime to really be pleased. There are too many action titles out there that very far surpasses this, and I'm talking titles that pre-date this at least a decade.  The ending is every bit as unsatisfying, bland, and nonsensical, as every thing that came before it. This series is almost a bigger waste of time than Hell Girl, and that's saying a lot.\n\r\nDevil May Cry at least stands out with its production values. It definitely looks pretty, and it smoothly blends in 3-D with CG. The artwork brings the Madhouse flavor with scantily clad chicks almost baring it all, and the character designs are very faithful to their video game counterparts. I didn't find any of the designs for the demons to be impressive. Only passable at the very best. \n\r\nThe soundtrack contains a real good opening theme, which is titled \"d.m.c.\", and quite honestly displays the best animation in the series. Plus, the ending theme is a nice song performed by Rin Oikawa called \"I'll Be Your Home\", but it's not worth sitting through 20+ minutes of bad anime to hear it. The voice work from the English cast was fine to me. Dante at times delivered some profanity filled lines, which were kind of funny. I can't comment on the Japanese cast, because I would never sit through this more than once. \n\r\nDevil May Cry is a nightmare for the anime vet and non fans of the game; but as a fan of the game, all this series does is make me want to play through the games for two reasons. Number one: to remind me that Devil May Cry really is a cool and entertaining franchise. Number two: to cleanse my mind of the vacuous tripe I've wasted my time on. I would say avoid this shit, but since it has a high rating I'm probably wasting my time.",
    "\n                I finished watching the whole series last night. DMC was simply awesome! \n\r\nI was looking for an anime that is shonen or seinen with a genre of action and with top priority on cool graphics - so I picked Devil May Cry with a lot of hesitations. \n\r\nI also thought I would never watched this kind of anime because I was tired with so detailed-like graphics and animation TV series I used to watch back then. But then again I thought, I'll give it a try. Man, I was wrong! I was hooked up right after I watched the first episode. \n\r\nI'll break down my\n                  \n\nthoughts on the anime without giving spoilers (hopefully). :)\n\r\nArt:\n\r\nWhen I watched the first episode, I said, &quot;WOW!&quot;.  The graphics left me in awe with nicely drawn characters and backgrounds. Colors used were also great - with Dante in red dress and white-grey hair of which I thought before was boring if this is his &quot;uniform&quot; but then again, I was wrong if you&rsquo;re caught up with the story.\n\r\nI give the art as 10/10.\n\r\nSound: \n\r\nThe OP soundtrack was superb and in sync with (flashes of) characters in their little scene. I did not read that entire lyrics of the ED soundtrack but the melody was nice. \n\r\nSound effects were also superb. \n\r\nOverall, sound is top-notch and I give it 10/10.\n\r\nStory: \n\r\nI like how the anime story was somewhat divided per episode but each ep was connected in reaching to the climax. I really like the last episode. It left me smiling after watching it. I like to watch more of this anime!\n\r\nI also like the fact that they employ humor in the story for the main character; though humors here are little as this anime focus on serious action. \n\r\nWhy it's not 10? Maybe because it's a short series and I would like watch more about the main character's development as he is in the anime.\n\r\nIt's 9/10 for me.\n\r\nCharacter:\n\r\nI say the main characters were cool with cool moves and were nicely drawn. I even found Dante sexy. Now, don&rsquo;t get me wrong. :D His moves were cool and sexy especially with his guns and sword. The lead female characters were also pretty cool and sexy. \n\r\nI give them 10/10.\n\r\nEnjoyment:\n\r\nThe entire series is a total enjoyment for me. Pretty cool characters and their moves with top notch graphics to go with. Story is not so intricate for me but it also gives mysteries which were unfolded in the climax. \n\r\nI totally enjoyed this anime, so it&rsquo;s 10/10. 2 thumbs up!\n\r\nI highly recommend this to those who look for action anime with very nice graphics, cool characters, superb sound, and story in one package.",
    "\n                Devil May Cry is something I desperately hoped would turn out great. Most things based off a video game- whether it be a movie, a book, or even an anime- are damned to fail. So for Devil May Cry, based on the video games of the same title, my hopes were that this work might succeed in its attempt to become a great anime. They might have been foolish, selfish wishes, but I wished that it at least would at least try.\r\nWas this anime as good as it could have been? The general consensus is no, as it seems. Why? To illustrate how an anime\n                  \n\nbecomes boring, a list, featuring Devil May Cry:\n\r\n1. Dante doesn’t have flaws.\r\nIf he does, they barely exist. He’s a freaking blank slate. He always defeats every demon in his way, EVERY TIME. Conflict? What conflict. If there isn’t anyone he can’t kill, then why even bother watching. Even Dante is aware of his extreme powers, and is constantly bored by his opponents. If he’s bored, we’re bored. You won’t be at the edge of your seat, because you know he can defeat whoever comes his way. It’s healthy to have the character lose once in a while, because it keeps the audience on edge. It’s permissible to never have the characters lose, but at least let them break a sweat. If Dante ever breaks a sweat, which he won’t, it’ll be the cool kind, like a strawberry sundae oozing down his face or a pizza slice breaking out of his pores and sliding with a greasy trail down to his- scratch that, that’s disturbing. I actually wanted Dante to lose or die in the end, because it would be a major twist from the usual formula of ‘I can’t defeat this guy… just kidding’ that Dante relies on all too often. It’s a level of boring that can only be matched by watching plastic grass grow. \n\r\n2. Being something all the time = boring.\r\nDante should not be cool 24/7. It gets boring and grating to watch. He’s cool when he sleeps. He’s cool when he eats his cool food. He’s cool when he walks all alone in the dark, in his cool outfit with his cool sword and cool shiny guns strapped to him and his cool poker face. He walks out of a fight without even a single speck of soil landing on his clothes and his hair immaculate. The coolness is great at first, but after the same thing all the goddamn time, you might even find yourself switching to “Mars of Destruction” instead of this crap. At least you can laugh at MoD.\n\r\n3. The plot comes at the last minute.\r\nLook at the picture for Devil May Cry. Go ahead, look at it. The white haired guy in front, as you probably know, is Dante. The other two guys are central to the plot, but show up at the next to last episode. That means the rest of the time was spent on NOTHING. The rest of the time is spent on Patty, who is basically Ciel’s fiancé Elizabeth from Kuroshitsuji mixed with Renge from Ouran High School Host Club. If you don’t know who those people are, the mishmash would be a grotesque mass of blonde hair, clingy personality, no point, and a really annoying tendency to appear at the worst times. That’s Patty for you, a girl who should’ve left after the first episode, but stuck around just to add another element of suck to the DMC headquarters.\n\r\nNow that we’ve got that out of the way, more about the plot. The plot is so rushed into the ending that they shouldn’t have even bothered. Most of the anime is just one episode dramas which have zero conflict because as I said before, Dante doesn’t lose. Ever. Devil May Cry is about Dante and friends having wonderful romps through their zany adventures of killing bloodthirsty demons. And Patty’s there too, I guess. It wasn’t very good, it’s very obvious it was based off a video game. There’s really no explanation of anything- I would have loved to hear the limitations of the demons, the limitations of Dante, or how Devil May Cry got started. Nobody gets that much of a backstory, no rules of the universe are explained, and no real emotional ties between characters are developed. It’s cripplingly average. The majority of the anime is Dante strutting around eating his strawberry sundaes and pizza and beer while shooting demons. It’s not very fun once you get passed the first episode.\r\nOn the technical side, it’s obvious that they did do a bit of demonology research, evidenced by names such as Baal, Modeus, and Dante. That, however, is to be expected and it‘s not very impressive.\n\r\nMoving right along to the art, there are a few things that need to be said about the dreaded art. It’s blasphemous to see an otherwise gorgeous characters massacred by unsavory art. Dante’s really hot, but you wouldn’t be able to tell because the damn animation could turn caviar into feces with a garnish of roadkill. Trish the sexbomb was reduced to Trish the kill-it-with-fire bomb. Lady went from looking like Meagan Fox to looking like something a fox just killed. The animation’s boxy and has a freaking ugly style. However, it gets a four because it’s not bad enough to deter you from watching the series. Most of the other things might.\n\r\nRight about here’s where characters are discussed, and it’s a real shame that they’re basically cardboard cut outs with traits slapped on to them. In fact, each character can be described in one sentence without fear of missing a personality aspect. They are all so flat that pieces of soggy paper say to their children, “Honey, some day you’ll be like Dante.”\r\nDante isn’t the only character at fault here. Lady is a chick who basically fills the screen when the animators take a break from Dante’s face, Patty is a chick who is there for comic relief, but it’s more like comic agony, and Trish is the girl who’s supposed to be really hot, but as I said before, the fault lies in the sub par animation. It’s notable that Patty is one of the few original (to this anime) characters here. The actual demons are transparent and you can see their explanations for their actions coming from a mile away (I wanted to battle the infamous Dante, I need to prove myself to master, I knew your father, etc).\n\r\nThe sound of the whole thing was okay. It was just alright. The choices were very obvious, like “DANT’S BAD@ZZ SO OBVSLY HE LURVES ROCKNROLL OMG LOL!!!1” It’s sickeningly mediocre rock, by the way. Nothing particularly hardcore.\n\r\nAs for the enjoyment, if you watch DMC, watch it for the ride. If you get tired of the same cool shtick over and over then watch a few episodes and don’t finish it, the ending does not carry a great payoff. Otherwise, I recommend this anime to those who are intrigued by badassery and badassery alone.",
    "\n                Basically, Devil  May Cry is about a half demon half human who takes on a job as a Demon Hunter. If you love shiny guns, motorcycles, blood and shiny swords, this may be the anime for you.\n\r\nStory: (6/10)\r\nThe story isn't really bad. It has the right materials which are pretty substantial. In other words, the background of the story was great! It's very interesting; European setting, demons, Demon Hunter and so on. But then, the materials weren't used properly. So the story flow became really dull. The story development wasn't really visible. It was only until the 11th episode that the climax was drawn.\n                  \n\nAnd as soon as you're finally enjoying the climax, you suddenly get lost because the series has already ended. Personally, I think that the series was simply too rushed. I believe this would have been a better series if the story was more developed.\n\r\nArt: (9/10)\r\nThe drawings are good. The proportions are great. But what I love most about this anime are the shiny guns, Dante's sword, some motorcycle scenes and the bloody scenes. Graphics' really good. The art complemented with the story and the atmosphere it was trying to give off.\n\r\nSound: (5/10)\r\nSorry to say, I did not notice the sound at all. I only heard the gunshots and the dubs. Maybe it was part of the main idea of the story. But I think that more sounds would help define the atmosphere. That aside, I did NOT enjoy the OP and ED at all.\n\r\nCharacter: (6/10)\r\nThe characters are interesting, but they were not developed well. The same comment as the story. They good materials but were not used well. For one thing, Dante's father and mother could have been given some light, but they weren't.The other two female characters, Lady and the girl that could use thunder could have also been given some emphasis. Simply put, there were not enough interesting flashbacks for the viewers to sympathize are empathize with.\n\r\nEnjoyment: (8/10)\r\nWell, it was funny and action packed. Again, you'll really enjoy this if you love guns and blood.\n\r\nOverall: (7/10)\r\nThough the story and characters were underdeveloped, the anime's decently enjoyable.",
    "\n                This is a bit of an odd show for me to talk about. On the one hand, looking at it critically is pretty difficult. It's based on a game series that I really like, and they really do the games justice, and trying to look at it critically makes me feel like I'm nitpicking issues that didn't really impact my enjoyment at the end of it all. However, I do want to be somewhat fair with it, so I'll give them two ratings: one as a fan of the games, and one just looking at it as is.\n\r\nAs a fan of the games, the show\n                  \n\ndoes just about everything that I could've hoped for. If all you're looking for is a show that represents what the games are all about while also getting a new story, this does the job pretty well. I am honestly surprised that this show isn't brought up more when it comes to good video game adaptations, at least when talking about representing the source material in a good way. There's a few things that I feel like they could've improved on when making the show, like sometimes I feel like Dante's a bit too much of an asshole at times, but they're pretty nit-picky, and it's not really a distracting issue, just something I feel like fans would pick up on. I really can't say much more about it from the perspective of a fan, so I suppose it's time to talk about specific things about the show.\n\r\nBefore I get to the thing that some people might have an issue with, I actually want to praise a couple of things before I get to that. First: the animation. It's pretty damn good looking, which is pretty common for shows made by Studio Madhouse. The show was made just around the time when digital animation started to look really good in TV shows, and it looks really good, especially for the time. It's all mainly hand drawn, but mixes some CGI in there, but only for very specific moments when you'd probably not even notice the CGI. It also just looks good stylistically. The day time/bright scenes look decent, albeit kinda standard, but the show looks especially good in the night/dark. I could go into way more detail, but there's a lot of layers to making stuff look good in different lightings, so... I dunno, watch a YouTube video explaining it.\n\r\nThe other thing I want to talk about is the music. The music in this show is pretty damn awesome. Some of the tracks feel like your typical anime tracks, nothing good, nothing bad, but the tracks they play in fight scenes are pretty friggin' rad, especially near the end. The track \"Evil Spirit\" in particular really sticks out as a really good track. The opening theme and ending are pretty damn good too. I don't really have much else to say about the music, it's just really good, and I wish it was available regularly.\n\r\nNow, for the one issue I feel like a lot of people might have. If you aren't a fan of the games, then I can't really see this doing that much for you. I mean, on its own, it's decent, but nothing too special. The characters feel like standard anime characters, the story is pretty standard, it would most likely just feel standard if you aren't really familiar with the source material. It's fine, but having knowledge of the games makes it way more enjoyable.\n\r\nSo, as a fan of the games, it's like an 8/10. Very much a must watch if you like the Devil May Cry series. Looking at it without knowing the games, it's like a 5 or 6/10.",
    "\n                A lot of gamers are, at least, familiar with Capcom's Devil May Cry. The franchise is pretty beloved, except for that reboot one where Dante had dark hair and was, objectively, a piece of shit. In 2007, after the third instalment but before the fourth, our old friends at Madhouse started releasing an anime based off of the games. That's right, the studio that brought us such adaptations as X-men, Metropolis, and FF Legend of the Crystals was behind this. Well, maybe this one isn't a pile of garbage like those were. Well, except Metropolis. It was just sub-par. \n\r\nStory:\n\r\nWe open with Morrison bringing Dante\n                  \n\na job. Now, you might find yourself asking “who the hell is  Morrison?” He's an original character who basically exists to bring Dante work and, occasionally, drive him around. The job is simple, Dante just has to safely escort a young orphan girl to the estate of the deceased father she never met to claim her inheritance. Naturally, she's being hunted by demons. \n\r\nThis is one of those anime where the underlying plot is pretty light and most episodes are just doing their own thing. Dante gets a job that somehow involves demons and then he goes out to slay them. In fact, the weakest part of the series is the big underlying plot. You get little snippets of it in quite a few episodes, but it ultimately involves a lot of contrivance and it's just not very good in general. Even the ongoing stuff that's meant to draw your attention to the fact that something is afoot is largely just dull and really obvious. To the point where it's just “this again” after a few times. The episodes also have a general problem of trying way too hard to give happy endings. To the point where they can just go completely off the rails and not make much sense. There are quite a few episodes that set things up for sad or, at the very least, bitter-sweet endings and then pull happy ones out of their anuses. I guess I missed the memo about DMC being for small children who can't process tragedy on account of the PEGI 16 ratings. \n\r\nWith that being said, a lot of the episodic scenarios are pretty interesting. Varied too. Yeah, you know that Dante is going to fight some demon,  but there's a lot of variation in what kinds of demons he'll fight and how they'll approach. Some of them use stealthy approaches or try to use guile, others prefer the direct approach. Some are after him specifically, others just happen to stumble upon him while going about their terrible business. And some of the scenarios are really intricate. The death poker game being a prime example. \n\r\nCharacters:\n\r\nThe characters from the games, Dante, Trish & Lady are all portrayed pretty true to character. Which is more than a certain reboot managed. In terms of original characters, some of the ones Dante encounters on his missions are kind of interesting. Others are pretty mediocre. Then we have our reoccurring Ocs, Morrison & Patty. Morrison is a boring character. We don't know why he's bringing Dante jobs, how they met or anything beyond “he brings Dante jobs.” He's pretty much on par with the plot coupon guy from your average PreCure series. And those can get by with it because they are actually for children. Then we have Patty. Have you ever wondered what Devil May Cry would be like if Dante had a slightly annoying child sidekick? No? Well, it's not the best decision that Madhouse could have made. She spends a lot of time pestering Dante, having to be rescued and contributing virtually nothing. \n\r\nArt:\n\r\nThe artwork is pretty decent. The characters look like themselves and Madhouse clearly made an effort to make the aesthetic look like DMC. The demon designs are generally pretty good as well. The trouble is that the action sequences themselves aren't all that good. In a series that relies heavily on action sequences. A lot of the “big” Dante fights end very quickly without having much content. And a lot of the sequences focus heavily on scenes of Dante attacking while not showing, or barely showing, his opponent. It would've benefited from showing them striking at one another in the same frames a bit more, is what I'm saying. Oh, and expect a lot of deaths to go the blood fountain route. I guess demon blood streams are highly pressurised. \n\r\nSound:\n\r\nThe series did get some good voice actors. We've got Morikawa Toshiyuki as Dante. Yes, Dante and Sephiroth are the same guy. We all suspected it given the resemblance. We've got Orikasa Fumiko and Tanaka Atsuko, both of whom are damn good actresses, as Lady and Trish respectively. Even the less interesting characters got some decent voices. The musical score by Hama Takeshi & Tsutsumi Hiroaki is pretty close to fantastic. \n\r\nHo-yay:\n\r\nThere isn't any, really. The closest you're going to get is Lady and Trish forming a friendship. \n\r\nFinal Thoughts:\n\r\nDevil May Cry is an anime that had some potential. After all, there's a lot to work with from the games. Unfortunately, it's held back by a dull underlying plot, trying too hard to provide happy endings, the slightly annoying child sidekick and mundane action sequences. Ultimately, I'd still say it's all right  but it certainly could have been better. My final rating is a 6/10. Next week we'll continue video game month with a look at Street Fighter Alpha.",
    "\n                Have you guys ever heard that video game base on movie are just merely a product? Well, i remember some crappy video game base on movie game like Transformers, or ET. But maybe some game like Lord of the Ring or maybe the recent Wolverine game for the PC is good. Speaking of game, now i going comment a anime that was base from one of the best game from Capcom call 'Devil May Cry' (wahhhhh.....), and how that i think about it; well, let's find out!\n\r\nDMC, when it say it going to become an anime; i like any other DMC player are jump for\n                  \n\njoy for it adaption. But after going through all the 12 episode of DMC, i like any other DMC player are down with sorrow and anger that what the hell the director has done on DMC.\n\r\nThe story in this anime are all episodic, each episode are stand alone story until episode 9 or 10 where the real plot has finally started. And each episode are all the same: \n\r\n1,there is a demon case\r\n2,Dante sitting around and do nothing (or maybe try to annoy Patty stupid problem) until Morrison say 'get your ass up! We got work to do, blah blah blah....'\r\n3,He goes to work, have some help from Lady and Trish\r\n4,He blew the work, mission accomplish and his debt is increase. The End!\n\r\nThat it! Nothing new, no plot that connected to other plot, zero! Until episode 9 or 10.\n\r\nSure you have character like Dante, Lady, and Trish to be animated here, and you do have character only for this anime, like Patty, she has been on the series since episode only has 'finally' been serve as a important character on episode 9 or 10, for the rest of the episode she just serve as a annoying brat! And Morrison, Dante agent always try to bring him a good job but end getting mess up by Dante.\n\r\nFor Dante, Lady, and Trish (i still want make a comment on them!), Dante still Dante, like pizza and strawberry, and weild Ebony & Ivory and Rebellion to fight off demon. And the funny thing is, he use his gun more than his sword! Even the director finally let him use it, the sword battle are just temporary! But Trish and Lady still play their role where they supposed to be, to support Dante and take Dante credit!\n\r\nAnimation is good, no less. The shading and everything was good. Even the bike scene in episode 2 are well done. Plus the OP of the series was nice, able to blend in the series as well. But the ED (though i didn't listen that often) was smooth and relax.\n\r\nWhat is the credit for us finishing DMC anime? Zero!\r\nWhat is the credit for them finishing DMC anime?Promoting DMC4!\r\nWhat is the credit for us buying DMC anime DVD?More DMC4 bonus!\n\r\nAnd in my opinion, this bonus are come to nothing and pointless after the real thing is out. The anime just bring down Dante good point and completely destroy the DMC atmosphere. And DMC is not the only one being anime, other like 'Tales of...', '.Hack' did make the series well and on going. And heck, even the live action Resident Evil movie was better than this!\n\r\nThat why product movie, animation, comic or anything that is base on something are mostly not a good thing!",
    "\n                Devil May Cry is a very strange series. It does its thing nicely for a bit but then goes and ruins it with some silly nonsense. I have no idea why or how that happened. I mean, the games are pretty consistently decent—so why isn't this show the same?\n\r\nLet's begin with this totally alien concept called the story. Of which you won't be getting any for about 9 episodes in a row (yes, out of 12 total). No joke—this is essentially a slice-of-life series about Dante showing off. And before you ask the obvious question—yes, it has less of a story than the action games\n                  \n\nthe setting is taken from. Furthermore—just to tease you—at several points you get an impression that some general plot is about to emerge (it eventually does, but already after you have lost all hope for it), but the very next moment you have your expectations casually ruined once again. You could probably even watch episodes 2–9 in any order without disturbing the narrative. For that exact reason you shouldn't worry about spoilers when discussing this series, as it's virtually impossible to spoil anything of substance. Rating the story with 3 is me being generous here, owing it mostly to the universe created by the DMC game series.\n\r\nOh yeah, Dante. As I mentioned earlier, everything in this series is about showing Dante in the process of, uh... being cool? He tries so hard he transcends the meaning of the word \"cool\", being the living embodiment of coolness never seen since the cool came to cool town. He always has that swag going, and his sense of fashion oozes style—as imagined by a 14-year-old. Obviously, he only eats the most badass food in existence... you guessed it, as imagined by a 14-year-old: pizza, strawberry sundae, beer—none of your chump gourmet garbage. He has the craziest, totally overpowered weapons—because dramatic stakes are for pussies. Even his name has that aristocratic feel to it. Unsurprisingly, every time he's up for a job, he always does it single-handedly—be it a bike race, gambling, or butchering a several-stories-tall demon in mere seconds—always with that detached facial expression that serves to underline his towering superiority. Yet somehow he always fails to complete his primary objective because he's just too damn righteous or whatever. Ermagherd, what an impossibly cool dude! And even during all that action, he appears to be bored out of his mind, almost depressed by doing something so utterly mundane. One-Punch Man too popular for you? Take a look at this gem then: DMC did the \"overpowered MC bored by flaccid antagonists\" shtick some 8 years before everyone's favorite egghead came into being. Hellsing Ultimate has too much of that annoying character development? DMC should be right up your alley—it doesn't have any of that. Ladies and gentlemen, we have officially reached peak shallow. If you aren't sure what \"peak shallow\" looks like, imagine a zit on the ground; that should work.\n\r\nOn the topic of characters, the entire cast is mainly there to support Dante by... yes, being glorified foils, looking deliberately uncool in comparison. First, we have Morrison, who is old-fashioned, intelligent, and an exemplary gentleman, almost a polar opposite of Dante. Then there's Patty, the token loli moe-blob comic relief character whose presence is never justified despite screenwriter's best efforts (which fail spectacularly, of course). A notable character is the creatively-named Lady, who is also quite a cool, uh, lady—but... still not quite there, you know? This, however, doesn't prevent her from being far more capable at her job. But hey, if Dante doesn't bother doing the thing, it must not be very cool after all, right? There's also Trish, who is somewhere between Lady and Dante on the scale on coolness and never gets any screen time. The distribution of screen time in general seems to be decided by a coin toss, befitting the interchangeable, meandering nature of the support cast. (That said, I gotta give some credit to designs and the fact that they're occasionally entertaining (if only because they try so hard) and evoke memories of better-written characters from the action anime of the days past; really makes you wish they were put in capable hands.) Lastly, there is that typical cartoony small fry antagonist who, despite being an obnoxious eyesore, behaves like a plot-significant character and—in a great plot twist (gasp!)—actually ends up being one. At that point you'll just have to be a man and brace yourself for the trainwreck. Even if you're a woman, become a man and then brace yourself; there is no sweeter imagery than a man bracing himself for a trainwreck.\n\r\nThere isn't much to say about the show's sound and visuals. They're generally competently made and adequate for the subject matter, though some scenes could have definitely been animated better (as in *actually animated* rather than panned across the screen), and the music somewhat lacks variety—almost all of it is mere variations on the three dominant themes.\n\r\nAll in all, DMC is the kind of show you'd want for some simple braindead entertainment when you've run out of the more entertaining content to watch. Don't expect anything beyond that, as you'll be met with nothing but disappointment. Just get your beverage of choice, a pack of favorite snacks, press play, and tune out. Alternatively, go play the original games and forget the anime adaptation ever existed.",
    "\n                If you’ve never heard of Devil May Cry before and are looking for a good action anime, this is not it. If you’re a fan of the video games and want to see more stylish ass-kickery, prepare to be disappointed. \n\r\nStory: Dante is running his business, performing mundane tasks for clients like demon-slaying, saving the world, the usual. Almost every episode starts and concludes one of Dante’s assigned cases, involving nasty monsters that inevitably end up dead. There is some cheap drama that focuses on a young girl whom Dante saved and a loser demon who wants to become a god, but you’re not seriously\n                  \n\nhere for the plot are you?\n\r\nArt: The art style is able to create a dark, gothic atmosphere where Dante spills plenty of demon blood. However, it is not enough to keep you tense at all since fight scenes are way too short. Battles involve more talking than fighting and tend to be settled with one stroke (by guess who). There is a significant lack of spectacularly choreographed fight sequences as seen in the games, which will no doubt be a major letdown. Animation quality is only mediocre for when there is actually action. If you're hoping Dante will pull devil trigger, unleash some insane combos, or wield his other devil arms, guess what? He won't!\r\nOh and yes, Trish and Lady are in this, but they’re drawn rather unattractively. No eye candy here. \n\r\nSound: Some heavy rock, some gothic choir tracks, all very forgettable. Seems even the lowliest of demons can speak Japanese. Voice acting and sound effects are acceptable, but nothing noteworthy. \n\r\nCharacters: Here it is, the reason you may be considering this anime: to see Dante kick plenty of ass. And here is also the show’s main failure: Dante is simply overpowered. Yes we know he’s super cool and skilled, but he faces absolutely no challenging adversaries at all. This entire anime is a series of totally one sided fights like I've never seen. Dante spends some time cracking jokes, his opponent says something stupid like “I stand a chance!”, and then Dante proceeds with delivering the pain. Except not in a spectacular, SSSmoking SSSick fashion. More like finishing it with one bullet from Ebony/Ivory or a couple swings of Rebellion. For fans of the games, this is a major kick to the balls and won’t leave you satisfied at all.\r\nOh, and apparently Dante loves eating strawberry sundaes on sunny afternoons, while getting bossed around by a precocious little girl. Who would've thought.\n\r\nEnjoyment: I loved the video games for their dramatic fight sequences, challenging bosses, cheesy humor and impossible physics. What the anime tries to duplicate, it does so without success. Dante is not so much kicking ass in this show as he is absentmindedly swatting flies. Your time would be better spent trying/ replaying the DMC video games. Except DMC2, let’s just forget that ever existed.\n\r\n5/10",
    "\n                Can you name a single video game that was turned into a movie that wasn't an extremely terrible film that failed in all regards?  Now can you name a good videogame that was turned into an anime that wasn't terrible?  Alright...you can probably name a whole bunch, alot from the choose-your-own-adventure genres.  However Devil May Cry is more like a terrible video game movie.  If you've ever played, or seen someone play, Devil May Cry then you know the style of the game quite well.  The quality and feel of the anime is nothing like that of the original videogame.\n\r\nStory:\n                  \n\nLame.  That single, bland word perfectly describes the storyline of this anime.  I wonder sometimes what the storywriters were thinking when they sat down to write this anime.  They clearly didn't put any heart or soul into this, and I hope that they had other projects that they deemed more important than this.  The real storyline begins in about episode 4-5.  When you have 12 episodes to tell a story in, and you spend the first third of the anime doing self contained episodes you know that you're off to a terrible start.  Even the story that they decide to throw in is terrible and quickly forgettable.\n\r\nArt: Some people praise the art, I however find it terrible to anything it tries to do.  The art is very clunky, the people seem to be squares and triangles and circles thrown together, the fluidity of the people is nonexistant.  Anyone who's seen the game knows what Dante looks like, and in the anime version he loses everything that makes him so cool in the game.  I got a very generic feeling from the art, it didn't seem that they were taking any risks, they were just doing the same old things over and over and the art seemed really stale.\n\r\nSound: The sound is good, the effects are good, the music is good.  I believe with almost absolute certainty that they took a lot of the music from the game itself and I found it was the single thing that I was connecting with as I watched with.\n\r\nCharacter: On the outside Dante is a badass. A pizza-eating, Strawberry Sundae drinking badass.  And on the inside?  Well...he's a badass.  And he's lazy.  He will beat up anyone, especially demons, because they piss him off.  And while he's exorcising the demons and doing whatever it is he does he doesn't seem to care at all.  Cause nothing is more badass than killing bad guys while not seeming to care about it at all.  Now....as the writers sat down they must have thought &quot;hmm...how exactly do we make a better anime when the main character is a rude, pizza-eating badass?&quot; and some guy went &quot;OH! MY! GOD! We add....a CUTE LITTLE GIRL! Who talks a lot and is a central part of the storyline so basically Dante is forced to stick beside her...people will LOVE IT!&quot; However...it doesn't work because it's been done a thousand times before, and it was original 10 years ago....and it was fresh then too.  But now it's not.  They also throw in characters from the games, but it feels forced and is quite annoying for anyone who's played the games.\n\r\nEnjoyment: Honestly, after episode 4 I stopped paying attention at all.  I really, really didn't care after episode 6. After episode 8 I could barely sit through each episode.  So I can honestly say that I didn't enjoy this anime at all.  At all.\n\r\nI wouldn't really recommend this to anyone who enjoys the game series.  It's such a huge disappointment if you're expecting it to be the game. However some people might really enjoy this anime, however I've never met anyone who enjoyed it.  The only good point is that it's only 12 episodes, so even if you hate it it's only 4 hours of your life....that you'll never get back.",
    "\n                Story (6) - Well, to avaluate devil may cry in this aspect is a bit hard..if we look at the anime it has almost no relation between episodes, and thats a negative point. Well, there are some connections, but the way the story goes is not directly connected, it is like each episode has is own story. By the story of all anime i give a 3. But i think each episode story is well made, so i give a 8 as an average of each episode story.\r\n(3+8)/2=5,5=6. If you like anime with good story, from the first episode to the last one, this is\n                  \n\nnot your kind of anime. I personally dont mind, and im opening for different kind of stories.\n\r\nArt (7) - Art is good, but nothing special in my opinion. Sometime it could be better, but is fine anyways, this is neither the strongest point neather the weakest.\n\r\nSound (10) - When i watched Dmc the first thing that got my attention was the opening..i liked it. Besides, character voices are good, the ending is also something great, background music is also nice. I have nothing negative to say about this aspect, so 10.\n\r\nCharacter (8) - Dante is great, and his personality  is well made. Some other suportt characters are also nice, but there are some that are not good at all. I think besides dante and 1 or 2 more, the rest is not anything special. \n\r\nEnjoyment (9) - I will only say this. i watched the first episode, and became interested in watching, and this is always a good aspect. I saw all the episodes really fast, and believe me, that is rare for me, because if it is nothing special i take more time to see all the episodes. \n\r\nOverall (8) - I agree when people says that devil may cry is nothing special, i already saw much better, but i cant say it is horrible, because it isnt. Its a fine and entretaining show, not the best, but good enough to be worth of watching.",
    "\n                Overall the Devil May Cry anime was pretty good. It's 12 episodes long. The animation and sound are good and it has action and humor. Many of the episodes look like one shots but everything is linked in the end. It won't confuse people who have not played the game and it won't bore those who have.\n\r\nMy criticism is that some of the action scenes are little cut. Dante starts fighting and a few seconds later fast forward, he's at home after winning the battle. \n\r\nAnother thing isn't really a critic as much as an observation, but I noticed after watching some game videos that\n                  \n\nanime Dante is more serious then game Dante. Sure he still loves pizza and strawberry sundaes, and he's still cocky and confident, and a little cheesy; but game Dante is cheesier, louder and more cheerful. I'm not saying anime Dante is an emo, far from it, he's just quiet, practically never smiles and he takes a lot of naps. While game Dante would say &quot;This party's getting crazy! :D&quot; and proceed to beat up the bad guys while eating pizza, I honestly can't imagine anime Dante saying such a line. Fighting while eating pizza and being cocky yes, but he would instead say with a serious face &quot;it gets R rated from here.&quot;\n\r\nAs for what's new in the anime. You'll get some more information about Dante's past and certain characters who have appeared in different games will finally meet. You'll also see Dante in his day to day life. My favorites are episodes 5, 9 and 12.",
    "\n                Devil May Cry\r\nI saw a lot of reviews hating this anime knowing nothing about the games and not knowing this was to promote DMC4 so one should keep in mind that, and also this was made by one of the writers of the game, so his personality is the same like in the games; The anime is set chronologically between DMC1 and DMC4, showing what heppened between the gap of the two and also how Lady and Trish met; This anime was refreshing and it's different from the games, less action than what the games offer but i enjoyed it, Dante doesn't even use all\n                  \n\nhis powers and the only one that can fight and even kill Dante is Vergil but he doesn't appear here for obvious reasons and it could seem Dante is immortal, well, he's immortal even in his human form in DMC4, but the thing is, only Vergil can kill him, that's why he kills demons so easily; oh and for me this is a great anime more for the enjoyment that i had than what the story offered.\n\r\nStory\r\nIt follows an episodic formula in which Dante does all kind of jobs, specially killing demons and everything related with demons, he will accept the jobs so he can pay his debts, and the causing of the big amount of debts are Trish and Lady because they're always taking a share of the payment he earns without their help; Almost at the last eps. the story will continue what was left in the first two and conclude with a good story but not surprising and predictable also at the very end everyone heading to the same place, the events of DMC4.\n\r\nArt & Animation\r\nThe animation was great, there's not much to say, it was well done, the character design was surprising, i was expecting something bad just because it was different from the character design of the games but Dante looks good, i really liked it and i was wrong to think it was going to be bad just because it wasn't like the games but yeah, the art style/animation was great considering it was from 2007.\n\r\nSound\r\nThe sound was great, the OP, the backrgound music, the weird thing was the ED, i don't think it was fitting; The VA made a great job specially for Dante, i thought Dante's voice was going to be bad, but it was on point of who he was at that point.\n\r\nCharacter\r\nBecause one writer helped to make the anime, the characters are just exactly like in the games and that's what i loved it, they didn't change it, they had the same personalities just a little changes on Lady tho and for the new characters, they were interesting, i liked that Dante had a contractor looking for jobs to offer him and i kind of liked the character of Patty, always cleaning the local and bothering him like if she was her little sister and he being cool about it. The enemies are weak but looking at the amount of enemies that appear at once or how many they appear in the whole anime, it's obvious they're not going to do anything to him, it's not even the amount that appears on any first chapter of the games but the characters were very good.\n\r\nEnjoyment\r\nGreat enjoyment, I liked this anime because i wanted to see something different from the games, i wanted to see how Dante handles his business, how he approached the jobs, this was a refreshing turn from the games, that's why it's a 9 well, mostly for the enjoyment but the surprising animation and great sound were decisive to give it a high score despite the weak but good story.",
    "\n                MUSIC:\n\r\nThe OP theme is fantabulous! (READ: Fantastic and Fabulous)\r\nIt really suits the anime, the theme of the anime. Somehow, I feel nostalgic every time I hear that instrumental song. But yeah, it's really nice.\n\r\nThe ED theme is a mellow&quot;Engrish&quot; song, but I don't get its meaning. Anyhow, it's a nice slowing down song for an action-packed anime.\n\r\nART/DRAWING/ANIMATION:\n\r\nThe art is superb! Even though it's based from a game, the animation/art of the characters is very nice, unlike other animes that are nice but fails in art, this one's great!\n\n\n\r\nThe animation is great! Being action-packed and blood-oriented, it's really captivating!\n\r\nSTORY:\n\r\nIt really doesn't have a plot, but in the end, you'll see the connection of the other episodes in its climax.\r\nAs I watched the first episode, I really got hooked that I continued watching it until it came to the &quot;stylish&quot; end. I guess this &quot;getting hooked&quot; thing is one factor of an anime that is good.\r\nEvery episode is a mission, meaning there are different stories, so don't expect a story for this anime.\n\r\nENJOYMENT:\r\nI really enjoyed every bit of this anime, and I don't know why. Somehow it gets repetitive, still, I love it! You can also see the protagonist being &quot;cold&quot; having a &quot;cute&quot; side too... It can also make you laugh at times, but rarely as this is a serious action anime with the guns and the swords and everything. All in all, enjoyment is seen in this anime.\n\r\nOVERALL:\r\nThis is a superb anime that you may want to watch! =)",
    "\n                At the time of my writing this review, I have attempted to watch past the first episode of the Devil May Cry anime four times. After I completerd the first episode I decided to leave it for a while, hoping that one day I would be in the mood for a stylish but brainless anime. Months later... I have realised this will not happen.\n\r\nThe story - or lack thereof - is disgusting. Fair enough, the DMC series never was known for its plot lines, but there is a huge difference between playing and watching (which is highlighted particularly by this anime).  I actually had\n                  \n\nto force myself to finish the first episode. There was a basic 'transport this girl to this place' thing going on... punctuated by a bunch of demons popping up and almost killing someone,  before Dante appeared out of nowhere and killed them EVERY SINGLE TIME. There was no character development either... just a stereotypically cool Dante doing all the stylish stuff we could make him do in the games. The sound was predictable and boring - Dante listens to hard rock because he's awesome; we get it. \n\r\nThe one thing this anime does have going for it is the art. It is relatively well-presented and ultra-stylish. That really doesn't make up for how remarkably poor every other aspect of it is.\n\r\nIn all honesty, I wish that I had discovered this anime somewhere in the middle of puberty, when I might actually have been content to kill brain cells by watching a guy shoot monsters over and over and over again. This is the only anime that I have abandoned to date. Steer clear.",
    "\n                This 12-episode anime was produced by Mad House, who had a hand in shows like Death Note, Hellsing, Chobits, etc. \n\r\nSo what went so @#%&amp; WRONG?! Come on, people, you have 3 games, 2 books, and 2 manga volumes worth of background to draw on and you give us Dante playing... death poker?? Are you @#%&amp; kidding me?? \n\r\nThe series has one story per episode for the first 10 episodes, and only develops a coherent plot in 11 and 12. The stories are boring, the action is practically nonexistent, and Dante is more of a cameo than the main character. \n\r\nWho the hell is the\n                  \n\ntarget audience here?? DMC demons do not haunt the world like ghosts and manipulate people from the sidelines. They drop down from portals and immediately get in your face with claws and lasers! But there's barely 10 seconds of action per episode, and crappy action at that. \n\r\nMost of it involved Dante shooting something in the head. If anything interesting does happen, it happens offscreen and is never explained. \r\nHow do you get that from a gaming franchise built on outlandishly stylish fighting?? By the way, Dante hardly talks and has no attitude. Yeah, out of DMC1 and DMC3 they picked DMC2 zombie-Dante. And whose idea was it to make Dante babysit an annoying little girl?? Ugh...",
    "\n                I'm not surprised one bit. No, really I'm not. It's a video game to anime/movie translation. Normally, these types of projects are horrible anyway. I'm sure many people know that this is based on the game of the same name, as it followed Dante completing missions by exterminating demons in some very stylish ways. Unfortunately, although the demon killing is present in the series. The greatness that was found in the games is completely lost. Those out there who sat through the Street Fighter Alpha series, Fatal Fury movies, or heaven forbid Art of Fighting. More than likely shouldn't be surprised and already have an\n                  \n\nidea on just how often the mark is missed. The only thing surprising to me is that the fans didn't outright obliterate this bullshit on release date like they did Street Fighter: Generations.\n\r\nVideo game to anime are mainly meant for one particular fan base, and that is fans of the games. However, as a fan of the game myself. I can tell you that this series doesn't do the game any justice at all, and as an anime, Devil May Cry is pretty much unwatchable. Devil May Cry has almost nothing to offer. \n\r\nThere's a dumpster load of reasons to hate this series. Right from the very beginning, I knew this series was going to be bad because Dante was given a chibi character named Patty to baby sit. This character along with many others serves absolutely no purpose, except to provide small repeated comedy relief which was never funny to begin with, and this is among the cliches that are present in this series. \n\r\nThe characters are incredibly bland, and the secondary characters make appearances for no reason other than to squeeze in popular faces from the video game. Outside of the way they fight, the viewer can forget about learning anything about them. The secondary characters who make their appearances are Trish and Lady: two female fighters that aren't even slightly developed, with only very small hints about them thrown out there.\n\r\nDante is a decent character sort of yet he's very lame as well. He deals out death packing his usual two pistols with a large sword, but his full abilities are never fully displayed. Even fans of the game should come away disappointed here. Try to imagine Ryu from Street Fighter never using his ultimate attack, which would be the \"Hadoken\", and you will get the picture. In addition, I find nothing cool about a character whom fights demons, but loses to children and everybody in grown up games. Plus, has a love for cherry sundaes? It just comes off weird to me. Instead, he should be drinking beer, some fuckin' robust, full bodied, imperial stouts or some shit.\n\r\nThe direction is atrocious. The series utilizes an episodic format which happens to become quite repetitive and very predictable. Clients would appear to Dante requesting his services, and each episode ends with some type of battle with a demon. Hints at a greater plot are mentioned very early. Only to be completely dropped and never mentioned again. \n\r\nGiving a tad bit of credit where it's due. Some of the villains are somewhat interesting with decent abilities, but every last one of them are poorly used in delivering good battles. The action sequences are very boring and lack a lot of imagination. Many of the fight scenes either consist of off screen and unseen action, or are decided in one move victories. This also includes demons that are heavily hyped in to being real threats. The battles are colossal disappointments, and they are cut too short for an action oriented fan whom has binged on a lot of action anime to really be pleased. There are too many action titles out there that very far surpasses this, and I'm talking titles that pre-date this at least a decade.  The ending is every bit as unsatisfying, bland, and nonsensical, as every thing that came before it. This series is almost a bigger waste of time than Hell Girl, and that's saying a lot.\n\r\nDevil May Cry at least stands out with its production values. It definitely looks pretty, and it smoothly blends in 3-D with CG. The artwork brings the Madhouse flavor with scantily clad chicks almost baring it all, and the character designs are very faithful to their video game counterparts. I didn't find any of the designs for the demons to be impressive. Only passable at the very best. \n\r\nThe soundtrack contains a real good opening theme, which is titled \"d.m.c.\", and quite honestly displays the best animation in the series. Plus, the ending theme is a nice song performed by Rin Oikawa called \"I'll Be Your Home\", but it's not worth sitting through 20+ minutes of bad anime to hear it. The voice work from the English cast was fine to me. Dante at times delivered some profanity filled lines, which were kind of funny. I can't comment on the Japanese cast, because I would never sit through this more than once. \n\r\nDevil May Cry is a nightmare for the anime vet and non fans of the game; but as a fan of the game, all this series does is make me want to play through the games for two reasons. Number one: to remind me that Devil May Cry really is a cool and entertaining franchise. Number two: to cleanse my mind of the vacuous tripe I've wasted my time on. I would say avoid this shit, but since it has a high rating I'm probably wasting my time.",
    "\n                I finished watching the whole series last night. DMC was simply awesome! \n\r\nI was looking for an anime that is shonen or seinen with a genre of action and with top priority on cool graphics - so I picked Devil May Cry with a lot of hesitations. \n\r\nI also thought I would never watched this kind of anime because I was tired with so detailed-like graphics and animation TV series I used to watch back then. But then again I thought, I'll give it a try. Man, I was wrong! I was hooked up right after I watched the first episode. \n\r\nI'll break down my\n                  \n\nthoughts on the anime without giving spoilers (hopefully). :)\n\r\nArt:\n\r\nWhen I watched the first episode, I said, &quot;WOW!&quot;.  The graphics left me in awe with nicely drawn characters and backgrounds. Colors used were also great - with Dante in red dress and white-grey hair of which I thought before was boring if this is his &quot;uniform&quot; but then again, I was wrong if you&rsquo;re caught up with the story.\n\r\nI give the art as 10/10.\n\r\nSound: \n\r\nThe OP soundtrack was superb and in sync with (flashes of) characters in their little scene. I did not read that entire lyrics of the ED soundtrack but the melody was nice. \n\r\nSound effects were also superb. \n\r\nOverall, sound is top-notch and I give it 10/10.\n\r\nStory: \n\r\nI like how the anime story was somewhat divided per episode but each ep was connected in reaching to the climax. I really like the last episode. It left me smiling after watching it. I like to watch more of this anime!\n\r\nI also like the fact that they employ humor in the story for the main character; though humors here are little as this anime focus on serious action. \n\r\nWhy it's not 10? Maybe because it's a short series and I would like watch more about the main character's development as he is in the anime.\n\r\nIt's 9/10 for me.\n\r\nCharacter:\n\r\nI say the main characters were cool with cool moves and were nicely drawn. I even found Dante sexy. Now, don&rsquo;t get me wrong. :D His moves were cool and sexy especially with his guns and sword. The lead female characters were also pretty cool and sexy. \n\r\nI give them 10/10.\n\r\nEnjoyment:\n\r\nThe entire series is a total enjoyment for me. Pretty cool characters and their moves with top notch graphics to go with. Story is not so intricate for me but it also gives mysteries which were unfolded in the climax. \n\r\nI totally enjoyed this anime, so it&rsquo;s 10/10. 2 thumbs up!\n\r\nI highly recommend this to those who look for action anime with very nice graphics, cool characters, superb sound, and story in one package.",
    "\n                Devil May Cry is something I desperately hoped would turn out great. Most things based off a video game- whether it be a movie, a book, or even an anime- are damned to fail. So for Devil May Cry, based on the video games of the same title, my hopes were that this work might succeed in its attempt to become a great anime. They might have been foolish, selfish wishes, but I wished that it at least would at least try.\r\nWas this anime as good as it could have been? The general consensus is no, as it seems. Why? To illustrate how an anime\n                  \n\nbecomes boring, a list, featuring Devil May Cry:\n\r\n1. Dante doesn’t have flaws.\r\nIf he does, they barely exist. He’s a freaking blank slate. He always defeats every demon in his way, EVERY TIME. Conflict? What conflict. If there isn’t anyone he can’t kill, then why even bother watching. Even Dante is aware of his extreme powers, and is constantly bored by his opponents. If he’s bored, we’re bored. You won’t be at the edge of your seat, because you know he can defeat whoever comes his way. It’s healthy to have the character lose once in a while, because it keeps the audience on edge. It’s permissible to never have the characters lose, but at least let them break a sweat. If Dante ever breaks a sweat, which he won’t, it’ll be the cool kind, like a strawberry sundae oozing down his face or a pizza slice breaking out of his pores and sliding with a greasy trail down to his- scratch that, that’s disturbing. I actually wanted Dante to lose or die in the end, because it would be a major twist from the usual formula of ‘I can’t defeat this guy… just kidding’ that Dante relies on all too often. It’s a level of boring that can only be matched by watching plastic grass grow. \n\r\n2. Being something all the time = boring.\r\nDante should not be cool 24/7. It gets boring and grating to watch. He’s cool when he sleeps. He’s cool when he eats his cool food. He’s cool when he walks all alone in the dark, in his cool outfit with his cool sword and cool shiny guns strapped to him and his cool poker face. He walks out of a fight without even a single speck of soil landing on his clothes and his hair immaculate. The coolness is great at first, but after the same thing all the goddamn time, you might even find yourself switching to “Mars of Destruction” instead of this crap. At least you can laugh at MoD.\n\r\n3. The plot comes at the last minute.\r\nLook at the picture for Devil May Cry. Go ahead, look at it. The white haired guy in front, as you probably know, is Dante. The other two guys are central to the plot, but show up at the next to last episode. That means the rest of the time was spent on NOTHING. The rest of the time is spent on Patty, who is basically Ciel’s fiancé Elizabeth from Kuroshitsuji mixed with Renge from Ouran High School Host Club. If you don’t know who those people are, the mishmash would be a grotesque mass of blonde hair, clingy personality, no point, and a really annoying tendency to appear at the worst times. That’s Patty for you, a girl who should’ve left after the first episode, but stuck around just to add another element of suck to the DMC headquarters.\n\r\nNow that we’ve got that out of the way, more about the plot. The plot is so rushed into the ending that they shouldn’t have even bothered. Most of the anime is just one episode dramas which have zero conflict because as I said before, Dante doesn’t lose. Ever. Devil May Cry is about Dante and friends having wonderful romps through their zany adventures of killing bloodthirsty demons. And Patty’s there too, I guess. It wasn’t very good, it’s very obvious it was based off a video game. There’s really no explanation of anything- I would have loved to hear the limitations of the demons, the limitations of Dante, or how Devil May Cry got started. Nobody gets that much of a backstory, no rules of the universe are explained, and no real emotional ties between characters are developed. It’s cripplingly average. The majority of the anime is Dante strutting around eating his strawberry sundaes and pizza and beer while shooting demons. It’s not very fun once you get passed the first episode.\r\nOn the technical side, it’s obvious that they did do a bit of demonology research, evidenced by names such as Baal, Modeus, and Dante. That, however, is to be expected and it‘s not very impressive.\n\r\nMoving right along to the art, there are a few things that need to be said about the dreaded art. It’s blasphemous to see an otherwise gorgeous characters massacred by unsavory art. Dante’s really hot, but you wouldn’t be able to tell because the damn animation could turn caviar into feces with a garnish of roadkill. Trish the sexbomb was reduced to Trish the kill-it-with-fire bomb. Lady went from looking like Meagan Fox to looking like something a fox just killed. The animation’s boxy and has a freaking ugly style. However, it gets a four because it’s not bad enough to deter you from watching the series. Most of the other things might.\n\r\nRight about here’s where characters are discussed, and it’s a real shame that they’re basically cardboard cut outs with traits slapped on to them. In fact, each character can be described in one sentence without fear of missing a personality aspect. They are all so flat that pieces of soggy paper say to their children, “Honey, some day you’ll be like Dante.”\r\nDante isn’t the only character at fault here. Lady is a chick who basically fills the screen when the animators take a break from Dante’s face, Patty is a chick who is there for comic relief, but it’s more like comic agony, and Trish is the girl who’s supposed to be really hot, but as I said before, the fault lies in the sub par animation. It’s notable that Patty is one of the few original (to this anime) characters here. The actual demons are transparent and you can see their explanations for their actions coming from a mile away (I wanted to battle the infamous Dante, I need to prove myself to master, I knew your father, etc).\n\r\nThe sound of the whole thing was okay. It was just alright. The choices were very obvious, like “DANT’S BAD@ZZ SO OBVSLY HE LURVES ROCKNROLL OMG LOL!!!1” It’s sickeningly mediocre rock, by the way. Nothing particularly hardcore.\n\r\nAs for the enjoyment, if you watch DMC, watch it for the ride. If you get tired of the same cool shtick over and over then watch a few episodes and don’t finish it, the ending does not carry a great payoff. Otherwise, I recommend this anime to those who are intrigued by badassery and badassery alone.",
    "\n                Basically, Devil  May Cry is about a half demon half human who takes on a job as a Demon Hunter. If you love shiny guns, motorcycles, blood and shiny swords, this may be the anime for you.\n\r\nStory: (6/10)\r\nThe story isn't really bad. It has the right materials which are pretty substantial. In other words, the background of the story was great! It's very interesting; European setting, demons, Demon Hunter and so on. But then, the materials weren't used properly. So the story flow became really dull. The story development wasn't really visible. It was only until the 11th episode that the climax was drawn.\n                  \n\nAnd as soon as you're finally enjoying the climax, you suddenly get lost because the series has already ended. Personally, I think that the series was simply too rushed. I believe this would have been a better series if the story was more developed.\n\r\nArt: (9/10)\r\nThe drawings are good. The proportions are great. But what I love most about this anime are the shiny guns, Dante's sword, some motorcycle scenes and the bloody scenes. Graphics' really good. The art complemented with the story and the atmosphere it was trying to give off.\n\r\nSound: (5/10)\r\nSorry to say, I did not notice the sound at all. I only heard the gunshots and the dubs. Maybe it was part of the main idea of the story. But I think that more sounds would help define the atmosphere. That aside, I did NOT enjoy the OP and ED at all.\n\r\nCharacter: (6/10)\r\nThe characters are interesting, but they were not developed well. The same comment as the story. They good materials but were not used well. For one thing, Dante's father and mother could have been given some light, but they weren't.The other two female characters, Lady and the girl that could use thunder could have also been given some emphasis. Simply put, there were not enough interesting flashbacks for the viewers to sympathize are empathize with.\n\r\nEnjoyment: (8/10)\r\nWell, it was funny and action packed. Again, you'll really enjoy this if you love guns and blood.\n\r\nOverall: (7/10)\r\nThough the story and characters were underdeveloped, the anime's decently enjoyable.",
    "\n                This is a bit of an odd show for me to talk about. On the one hand, looking at it critically is pretty difficult. It's based on a game series that I really like, and they really do the games justice, and trying to look at it critically makes me feel like I'm nitpicking issues that didn't really impact my enjoyment at the end of it all. However, I do want to be somewhat fair with it, so I'll give them two ratings: one as a fan of the games, and one just looking at it as is.\n\r\nAs a fan of the games, the show\n                  \n\ndoes just about everything that I could've hoped for. If all you're looking for is a show that represents what the games are all about while also getting a new story, this does the job pretty well. I am honestly surprised that this show isn't brought up more when it comes to good video game adaptations, at least when talking about representing the source material in a good way. There's a few things that I feel like they could've improved on when making the show, like sometimes I feel like Dante's a bit too much of an asshole at times, but they're pretty nit-picky, and it's not really a distracting issue, just something I feel like fans would pick up on. I really can't say much more about it from the perspective of a fan, so I suppose it's time to talk about specific things about the show.\n\r\nBefore I get to the thing that some people might have an issue with, I actually want to praise a couple of things before I get to that. First: the animation. It's pretty damn good looking, which is pretty common for shows made by Studio Madhouse. The show was made just around the time when digital animation started to look really good in TV shows, and it looks really good, especially for the time. It's all mainly hand drawn, but mixes some CGI in there, but only for very specific moments when you'd probably not even notice the CGI. It also just looks good stylistically. The day time/bright scenes look decent, albeit kinda standard, but the show looks especially good in the night/dark. I could go into way more detail, but there's a lot of layers to making stuff look good in different lightings, so... I dunno, watch a YouTube video explaining it.\n\r\nThe other thing I want to talk about is the music. The music in this show is pretty damn awesome. Some of the tracks feel like your typical anime tracks, nothing good, nothing bad, but the tracks they play in fight scenes are pretty friggin' rad, especially near the end. The track \"Evil Spirit\" in particular really sticks out as a really good track. The opening theme and ending are pretty damn good too. I don't really have much else to say about the music, it's just really good, and I wish it was available regularly.\n\r\nNow, for the one issue I feel like a lot of people might have. If you aren't a fan of the games, then I can't really see this doing that much for you. I mean, on its own, it's decent, but nothing too special. The characters feel like standard anime characters, the story is pretty standard, it would most likely just feel standard if you aren't really familiar with the source material. It's fine, but having knowledge of the games makes it way more enjoyable.\n\r\nSo, as a fan of the games, it's like an 8/10. Very much a must watch if you like the Devil May Cry series. Looking at it without knowing the games, it's like a 5 or 6/10.",
    "\n                A lot of gamers are, at least, familiar with Capcom's Devil May Cry. The franchise is pretty beloved, except for that reboot one where Dante had dark hair and was, objectively, a piece of shit. In 2007, after the third instalment but before the fourth, our old friends at Madhouse started releasing an anime based off of the games. That's right, the studio that brought us such adaptations as X-men, Metropolis, and FF Legend of the Crystals was behind this. Well, maybe this one isn't a pile of garbage like those were. Well, except Metropolis. It was just sub-par. \n\r\nStory:\n\r\nWe open with Morrison bringing Dante\n                  \n\na job. Now, you might find yourself asking “who the hell is  Morrison?” He's an original character who basically exists to bring Dante work and, occasionally, drive him around. The job is simple, Dante just has to safely escort a young orphan girl to the estate of the deceased father she never met to claim her inheritance. Naturally, she's being hunted by demons. \n\r\nThis is one of those anime where the underlying plot is pretty light and most episodes are just doing their own thing. Dante gets a job that somehow involves demons and then he goes out to slay them. In fact, the weakest part of the series is the big underlying plot. You get little snippets of it in quite a few episodes, but it ultimately involves a lot of contrivance and it's just not very good in general. Even the ongoing stuff that's meant to draw your attention to the fact that something is afoot is largely just dull and really obvious. To the point where it's just “this again” after a few times. The episodes also have a general problem of trying way too hard to give happy endings. To the point where they can just go completely off the rails and not make much sense. There are quite a few episodes that set things up for sad or, at the very least, bitter-sweet endings and then pull happy ones out of their anuses. I guess I missed the memo about DMC being for small children who can't process tragedy on account of the PEGI 16 ratings. \n\r\nWith that being said, a lot of the episodic scenarios are pretty interesting. Varied too. Yeah, you know that Dante is going to fight some demon,  but there's a lot of variation in what kinds of demons he'll fight and how they'll approach. Some of them use stealthy approaches or try to use guile, others prefer the direct approach. Some are after him specifically, others just happen to stumble upon him while going about their terrible business. And some of the scenarios are really intricate. The death poker game being a prime example. \n\r\nCharacters:\n\r\nThe characters from the games, Dante, Trish & Lady are all portrayed pretty true to character. Which is more than a certain reboot managed. In terms of original characters, some of the ones Dante encounters on his missions are kind of interesting. Others are pretty mediocre. Then we have our reoccurring Ocs, Morrison & Patty. Morrison is a boring character. We don't know why he's bringing Dante jobs, how they met or anything beyond “he brings Dante jobs.” He's pretty much on par with the plot coupon guy from your average PreCure series. And those can get by with it because they are actually for children. Then we have Patty. Have you ever wondered what Devil May Cry would be like if Dante had a slightly annoying child sidekick? No? Well, it's not the best decision that Madhouse could have made. She spends a lot of time pestering Dante, having to be rescued and contributing virtually nothing. \n\r\nArt:\n\r\nThe artwork is pretty decent. The characters look like themselves and Madhouse clearly made an effort to make the aesthetic look like DMC. The demon designs are generally pretty good as well. The trouble is that the action sequences themselves aren't all that good. In a series that relies heavily on action sequences. A lot of the “big” Dante fights end very quickly without having much content. And a lot of the sequences focus heavily on scenes of Dante attacking while not showing, or barely showing, his opponent. It would've benefited from showing them striking at one another in the same frames a bit more, is what I'm saying. Oh, and expect a lot of deaths to go the blood fountain route. I guess demon blood streams are highly pressurised. \n\r\nSound:\n\r\nThe series did get some good voice actors. We've got Morikawa Toshiyuki as Dante. Yes, Dante and Sephiroth are the same guy. We all suspected it given the resemblance. We've got Orikasa Fumiko and Tanaka Atsuko, both of whom are damn good actresses, as Lady and Trish respectively. Even the less interesting characters got some decent voices. The musical score by Hama Takeshi & Tsutsumi Hiroaki is pretty close to fantastic. \n\r\nHo-yay:\n\r\nThere isn't any, really. The closest you're going to get is Lady and Trish forming a friendship. \n\r\nFinal Thoughts:\n\r\nDevil May Cry is an anime that had some potential. After all, there's a lot to work with from the games. Unfortunately, it's held back by a dull underlying plot, trying too hard to provide happy endings, the slightly annoying child sidekick and mundane action sequences. Ultimately, I'd still say it's all right  but it certainly could have been better. My final rating is a 6/10. Next week we'll continue video game month with a look at Street Fighter Alpha.",
    "\n                Have you guys ever heard that video game base on movie are just merely a product? Well, i remember some crappy video game base on movie game like Transformers, or ET. But maybe some game like Lord of the Ring or maybe the recent Wolverine game for the PC is good. Speaking of game, now i going comment a anime that was base from one of the best game from Capcom call 'Devil May Cry' (wahhhhh.....), and how that i think about it; well, let's find out!\n\r\nDMC, when it say it going to become an anime; i like any other DMC player are jump for\n                  \n\njoy for it adaption. But after going through all the 12 episode of DMC, i like any other DMC player are down with sorrow and anger that what the hell the director has done on DMC.\n\r\nThe story in this anime are all episodic, each episode are stand alone story until episode 9 or 10 where the real plot has finally started. And each episode are all the same: \n\r\n1,there is a demon case\r\n2,Dante sitting around and do nothing (or maybe try to annoy Patty stupid problem) until Morrison say 'get your ass up! We got work to do, blah blah blah....'\r\n3,He goes to work, have some help from Lady and Trish\r\n4,He blew the work, mission accomplish and his debt is increase. The End!\n\r\nThat it! Nothing new, no plot that connected to other plot, zero! Until episode 9 or 10.\n\r\nSure you have character like Dante, Lady, and Trish to be animated here, and you do have character only for this anime, like Patty, she has been on the series since episode only has 'finally' been serve as a important character on episode 9 or 10, for the rest of the episode she just serve as a annoying brat! And Morrison, Dante agent always try to bring him a good job but end getting mess up by Dante.\n\r\nFor Dante, Lady, and Trish (i still want make a comment on them!), Dante still Dante, like pizza and strawberry, and weild Ebony & Ivory and Rebellion to fight off demon. And the funny thing is, he use his gun more than his sword! Even the director finally let him use it, the sword battle are just temporary! But Trish and Lady still play their role where they supposed to be, to support Dante and take Dante credit!\n\r\nAnimation is good, no less. The shading and everything was good. Even the bike scene in episode 2 are well done. Plus the OP of the series was nice, able to blend in the series as well. But the ED (though i didn't listen that often) was smooth and relax.\n\r\nWhat is the credit for us finishing DMC anime? Zero!\r\nWhat is the credit for them finishing DMC anime?Promoting DMC4!\r\nWhat is the credit for us buying DMC anime DVD?More DMC4 bonus!\n\r\nAnd in my opinion, this bonus are come to nothing and pointless after the real thing is out. The anime just bring down Dante good point and completely destroy the DMC atmosphere. And DMC is not the only one being anime, other like 'Tales of...', '.Hack' did make the series well and on going. And heck, even the live action Resident Evil movie was better than this!\n\r\nThat why product movie, animation, comic or anything that is base on something are mostly not a good thing!",
    "\n                Devil May Cry is a very strange series. It does its thing nicely for a bit but then goes and ruins it with some silly nonsense. I have no idea why or how that happened. I mean, the games are pretty consistently decent—so why isn't this show the same?\n\r\nLet's begin with this totally alien concept called the story. Of which you won't be getting any for about 9 episodes in a row (yes, out of 12 total). No joke—this is essentially a slice-of-life series about Dante showing off. And before you ask the obvious question—yes, it has less of a story than the action games\n                  \n\nthe setting is taken from. Furthermore—just to tease you—at several points you get an impression that some general plot is about to emerge (it eventually does, but already after you have lost all hope for it), but the very next moment you have your expectations casually ruined once again. You could probably even watch episodes 2–9 in any order without disturbing the narrative. For that exact reason you shouldn't worry about spoilers when discussing this series, as it's virtually impossible to spoil anything of substance. Rating the story with 3 is me being generous here, owing it mostly to the universe created by the DMC game series.\n\r\nOh yeah, Dante. As I mentioned earlier, everything in this series is about showing Dante in the process of, uh... being cool? He tries so hard he transcends the meaning of the word \"cool\", being the living embodiment of coolness never seen since the cool came to cool town. He always has that swag going, and his sense of fashion oozes style—as imagined by a 14-year-old. Obviously, he only eats the most badass food in existence... you guessed it, as imagined by a 14-year-old: pizza, strawberry sundae, beer—none of your chump gourmet garbage. He has the craziest, totally overpowered weapons—because dramatic stakes are for pussies. Even his name has that aristocratic feel to it. Unsurprisingly, every time he's up for a job, he always does it single-handedly—be it a bike race, gambling, or butchering a several-stories-tall demon in mere seconds—always with that detached facial expression that serves to underline his towering superiority. Yet somehow he always fails to complete his primary objective because he's just too damn righteous or whatever. Ermagherd, what an impossibly cool dude! And even during all that action, he appears to be bored out of his mind, almost depressed by doing something so utterly mundane. One-Punch Man too popular for you? Take a look at this gem then: DMC did the \"overpowered MC bored by flaccid antagonists\" shtick some 8 years before everyone's favorite egghead came into being. Hellsing Ultimate has too much of that annoying character development? DMC should be right up your alley—it doesn't have any of that. Ladies and gentlemen, we have officially reached peak shallow. If you aren't sure what \"peak shallow\" looks like, imagine a zit on the ground; that should work.\n\r\nOn the topic of characters, the entire cast is mainly there to support Dante by... yes, being glorified foils, looking deliberately uncool in comparison. First, we have Morrison, who is old-fashioned, intelligent, and an exemplary gentleman, almost a polar opposite of Dante. Then there's Patty, the token loli moe-blob comic relief character whose presence is never justified despite screenwriter's best efforts (which fail spectacularly, of course). A notable character is the creatively-named Lady, who is also quite a cool, uh, lady—but... still not quite there, you know? This, however, doesn't prevent her from being far more capable at her job. But hey, if Dante doesn't bother doing the thing, it must not be very cool after all, right? There's also Trish, who is somewhere between Lady and Dante on the scale on coolness and never gets any screen time. The distribution of screen time in general seems to be decided by a coin toss, befitting the interchangeable, meandering nature of the support cast. (That said, I gotta give some credit to designs and the fact that they're occasionally entertaining (if only because they try so hard) and evoke memories of better-written characters from the action anime of the days past; really makes you wish they were put in capable hands.) Lastly, there is that typical cartoony small fry antagonist who, despite being an obnoxious eyesore, behaves like a plot-significant character and—in a great plot twist (gasp!)—actually ends up being one. At that point you'll just have to be a man and brace yourself for the trainwreck. Even if you're a woman, become a man and then brace yourself; there is no sweeter imagery than a man bracing himself for a trainwreck.\n\r\nThere isn't much to say about the show's sound and visuals. They're generally competently made and adequate for the subject matter, though some scenes could have definitely been animated better (as in *actually animated* rather than panned across the screen), and the music somewhat lacks variety—almost all of it is mere variations on the three dominant themes.\n\r\nAll in all, DMC is the kind of show you'd want for some simple braindead entertainment when you've run out of the more entertaining content to watch. Don't expect anything beyond that, as you'll be met with nothing but disappointment. Just get your beverage of choice, a pack of favorite snacks, press play, and tune out. Alternatively, go play the original games and forget the anime adaptation ever existed.",
    "\n                If you’ve never heard of Devil May Cry before and are looking for a good action anime, this is not it. If you’re a fan of the video games and want to see more stylish ass-kickery, prepare to be disappointed. \n\r\nStory: Dante is running his business, performing mundane tasks for clients like demon-slaying, saving the world, the usual. Almost every episode starts and concludes one of Dante’s assigned cases, involving nasty monsters that inevitably end up dead. There is some cheap drama that focuses on a young girl whom Dante saved and a loser demon who wants to become a god, but you’re not seriously\n                  \n\nhere for the plot are you?\n\r\nArt: The art style is able to create a dark, gothic atmosphere where Dante spills plenty of demon blood. However, it is not enough to keep you tense at all since fight scenes are way too short. Battles involve more talking than fighting and tend to be settled with one stroke (by guess who). There is a significant lack of spectacularly choreographed fight sequences as seen in the games, which will no doubt be a major letdown. Animation quality is only mediocre for when there is actually action. If you're hoping Dante will pull devil trigger, unleash some insane combos, or wield his other devil arms, guess what? He won't!\r\nOh and yes, Trish and Lady are in this, but they’re drawn rather unattractively. No eye candy here. \n\r\nSound: Some heavy rock, some gothic choir tracks, all very forgettable. Seems even the lowliest of demons can speak Japanese. Voice acting and sound effects are acceptable, but nothing noteworthy. \n\r\nCharacters: Here it is, the reason you may be considering this anime: to see Dante kick plenty of ass. And here is also the show’s main failure: Dante is simply overpowered. Yes we know he’s super cool and skilled, but he faces absolutely no challenging adversaries at all. This entire anime is a series of totally one sided fights like I've never seen. Dante spends some time cracking jokes, his opponent says something stupid like “I stand a chance!”, and then Dante proceeds with delivering the pain. Except not in a spectacular, SSSmoking SSSick fashion. More like finishing it with one bullet from Ebony/Ivory or a couple swings of Rebellion. For fans of the games, this is a major kick to the balls and won’t leave you satisfied at all.\r\nOh, and apparently Dante loves eating strawberry sundaes on sunny afternoons, while getting bossed around by a precocious little girl. Who would've thought.\n\r\nEnjoyment: I loved the video games for their dramatic fight sequences, challenging bosses, cheesy humor and impossible physics. What the anime tries to duplicate, it does so without success. Dante is not so much kicking ass in this show as he is absentmindedly swatting flies. Your time would be better spent trying/ replaying the DMC video games. Except DMC2, let’s just forget that ever existed.\n\r\n5/10",
    "\n                Can you name a single video game that was turned into a movie that wasn't an extremely terrible film that failed in all regards?  Now can you name a good videogame that was turned into an anime that wasn't terrible?  Alright...you can probably name a whole bunch, alot from the choose-your-own-adventure genres.  However Devil May Cry is more like a terrible video game movie.  If you've ever played, or seen someone play, Devil May Cry then you know the style of the game quite well.  The quality and feel of the anime is nothing like that of the original videogame.\n\r\nStory:\n                  \n\nLame.  That single, bland word perfectly describes the storyline of this anime.  I wonder sometimes what the storywriters were thinking when they sat down to write this anime.  They clearly didn't put any heart or soul into this, and I hope that they had other projects that they deemed more important than this.  The real storyline begins in about episode 4-5.  When you have 12 episodes to tell a story in, and you spend the first third of the anime doing self contained episodes you know that you're off to a terrible start.  Even the story that they decide to throw in is terrible and quickly forgettable.\n\r\nArt: Some people praise the art, I however find it terrible to anything it tries to do.  The art is very clunky, the people seem to be squares and triangles and circles thrown together, the fluidity of the people is nonexistant.  Anyone who's seen the game knows what Dante looks like, and in the anime version he loses everything that makes him so cool in the game.  I got a very generic feeling from the art, it didn't seem that they were taking any risks, they were just doing the same old things over and over and the art seemed really stale.\n\r\nSound: The sound is good, the effects are good, the music is good.  I believe with almost absolute certainty that they took a lot of the music from the game itself and I found it was the single thing that I was connecting with as I watched with.\n\r\nCharacter: On the outside Dante is a badass. A pizza-eating, Strawberry Sundae drinking badass.  And on the inside?  Well...he's a badass.  And he's lazy.  He will beat up anyone, especially demons, because they piss him off.  And while he's exorcising the demons and doing whatever it is he does he doesn't seem to care at all.  Cause nothing is more badass than killing bad guys while not seeming to care about it at all.  Now....as the writers sat down they must have thought &quot;hmm...how exactly do we make a better anime when the main character is a rude, pizza-eating badass?&quot; and some guy went &quot;OH! MY! GOD! We add....a CUTE LITTLE GIRL! Who talks a lot and is a central part of the storyline so basically Dante is forced to stick beside her...people will LOVE IT!&quot; However...it doesn't work because it's been done a thousand times before, and it was original 10 years ago....and it was fresh then too.  But now it's not.  They also throw in characters from the games, but it feels forced and is quite annoying for anyone who's played the games.\n\r\nEnjoyment: Honestly, after episode 4 I stopped paying attention at all.  I really, really didn't care after episode 6. After episode 8 I could barely sit through each episode.  So I can honestly say that I didn't enjoy this anime at all.  At all.\n\r\nI wouldn't really recommend this to anyone who enjoys the game series.  It's such a huge disappointment if you're expecting it to be the game. However some people might really enjoy this anime, however I've never met anyone who enjoyed it.  The only good point is that it's only 12 episodes, so even if you hate it it's only 4 hours of your life....that you'll never get back.",
    "\n                Story (6) - Well, to avaluate devil may cry in this aspect is a bit hard..if we look at the anime it has almost no relation between episodes, and thats a negative point. Well, there are some connections, but the way the story goes is not directly connected, it is like each episode has is own story. By the story of all anime i give a 3. But i think each episode story is well made, so i give a 8 as an average of each episode story.\r\n(3+8)/2=5,5=6. If you like anime with good story, from the first episode to the last one, this is\n                  \n\nnot your kind of anime. I personally dont mind, and im opening for different kind of stories.\n\r\nArt (7) - Art is good, but nothing special in my opinion. Sometime it could be better, but is fine anyways, this is neither the strongest point neather the weakest.\n\r\nSound (10) - When i watched Dmc the first thing that got my attention was the opening..i liked it. Besides, character voices are good, the ending is also something great, background music is also nice. I have nothing negative to say about this aspect, so 10.\n\r\nCharacter (8) - Dante is great, and his personality  is well made. Some other suportt characters are also nice, but there are some that are not good at all. I think besides dante and 1 or 2 more, the rest is not anything special. \n\r\nEnjoyment (9) - I will only say this. i watched the first episode, and became interested in watching, and this is always a good aspect. I saw all the episodes really fast, and believe me, that is rare for me, because if it is nothing special i take more time to see all the episodes. \n\r\nOverall (8) - I agree when people says that devil may cry is nothing special, i already saw much better, but i cant say it is horrible, because it isnt. Its a fine and entretaining show, not the best, but good enough to be worth of watching.",
    "\n                Overall the Devil May Cry anime was pretty good. It's 12 episodes long. The animation and sound are good and it has action and humor. Many of the episodes look like one shots but everything is linked in the end. It won't confuse people who have not played the game and it won't bore those who have.\n\r\nMy criticism is that some of the action scenes are little cut. Dante starts fighting and a few seconds later fast forward, he's at home after winning the battle. \n\r\nAnother thing isn't really a critic as much as an observation, but I noticed after watching some game videos that\n                  \n\nanime Dante is more serious then game Dante. Sure he still loves pizza and strawberry sundaes, and he's still cocky and confident, and a little cheesy; but game Dante is cheesier, louder and more cheerful. I'm not saying anime Dante is an emo, far from it, he's just quiet, practically never smiles and he takes a lot of naps. While game Dante would say &quot;This party's getting crazy! :D&quot; and proceed to beat up the bad guys while eating pizza, I honestly can't imagine anime Dante saying such a line. Fighting while eating pizza and being cocky yes, but he would instead say with a serious face &quot;it gets R rated from here.&quot;\n\r\nAs for what's new in the anime. You'll get some more information about Dante's past and certain characters who have appeared in different games will finally meet. You'll also see Dante in his day to day life. My favorites are episodes 5, 9 and 12.",
    "\n                Devil May Cry\r\nI saw a lot of reviews hating this anime knowing nothing about the games and not knowing this was to promote DMC4 so one should keep in mind that, and also this was made by one of the writers of the game, so his personality is the same like in the games; The anime is set chronologically between DMC1 and DMC4, showing what heppened between the gap of the two and also how Lady and Trish met; This anime was refreshing and it's different from the games, less action than what the games offer but i enjoyed it, Dante doesn't even use all\n                  \n\nhis powers and the only one that can fight and even kill Dante is Vergil but he doesn't appear here for obvious reasons and it could seem Dante is immortal, well, he's immortal even in his human form in DMC4, but the thing is, only Vergil can kill him, that's why he kills demons so easily; oh and for me this is a great anime more for the enjoyment that i had than what the story offered.\n\r\nStory\r\nIt follows an episodic formula in which Dante does all kind of jobs, specially killing demons and everything related with demons, he will accept the jobs so he can pay his debts, and the causing of the big amount of debts are Trish and Lady because they're always taking a share of the payment he earns without their help; Almost at the last eps. the story will continue what was left in the first two and conclude with a good story but not surprising and predictable also at the very end everyone heading to the same place, the events of DMC4.\n\r\nArt & Animation\r\nThe animation was great, there's not much to say, it was well done, the character design was surprising, i was expecting something bad just because it was different from the character design of the games but Dante looks good, i really liked it and i was wrong to think it was going to be bad just because it wasn't like the games but yeah, the art style/animation was great considering it was from 2007.\n\r\nSound\r\nThe sound was great, the OP, the backrgound music, the weird thing was the ED, i don't think it was fitting; The VA made a great job specially for Dante, i thought Dante's voice was going to be bad, but it was on point of who he was at that point.\n\r\nCharacter\r\nBecause one writer helped to make the anime, the characters are just exactly like in the games and that's what i loved it, they didn't change it, they had the same personalities just a little changes on Lady tho and for the new characters, they were interesting, i liked that Dante had a contractor looking for jobs to offer him and i kind of liked the character of Patty, always cleaning the local and bothering him like if she was her little sister and he being cool about it. The enemies are weak but looking at the amount of enemies that appear at once or how many they appear in the whole anime, it's obvious they're not going to do anything to him, it's not even the amount that appears on any first chapter of the games but the characters were very good.\n\r\nEnjoyment\r\nGreat enjoyment, I liked this anime because i wanted to see something different from the games, i wanted to see how Dante handles his business, how he approached the jobs, this was a refreshing turn from the games, that's why it's a 9 well, mostly for the enjoyment but the surprising animation and great sound were decisive to give it a high score despite the weak but good story.",
    "\n                MUSIC:\n\r\nThe OP theme is fantabulous! (READ: Fantastic and Fabulous)\r\nIt really suits the anime, the theme of the anime. Somehow, I feel nostalgic every time I hear that instrumental song. But yeah, it's really nice.\n\r\nThe ED theme is a mellow&quot;Engrish&quot; song, but I don't get its meaning. Anyhow, it's a nice slowing down song for an action-packed anime.\n\r\nART/DRAWING/ANIMATION:\n\r\nThe art is superb! Even though it's based from a game, the animation/art of the characters is very nice, unlike other animes that are nice but fails in art, this one's great!\n\n\n\r\nThe animation is great! Being action-packed and blood-oriented, it's really captivating!\n\r\nSTORY:\n\r\nIt really doesn't have a plot, but in the end, you'll see the connection of the other episodes in its climax.\r\nAs I watched the first episode, I really got hooked that I continued watching it until it came to the &quot;stylish&quot; end. I guess this &quot;getting hooked&quot; thing is one factor of an anime that is good.\r\nEvery episode is a mission, meaning there are different stories, so don't expect a story for this anime.\n\r\nENJOYMENT:\r\nI really enjoyed every bit of this anime, and I don't know why. Somehow it gets repetitive, still, I love it! You can also see the protagonist being &quot;cold&quot; having a &quot;cute&quot; side too... It can also make you laugh at times, but rarely as this is a serious action anime with the guns and the swords and everything. All in all, enjoyment is seen in this anime.\n\r\nOVERALL:\r\nThis is a superb anime that you may want to watch! =)",
    "\n                At the time of my writing this review, I have attempted to watch past the first episode of the Devil May Cry anime four times. After I completerd the first episode I decided to leave it for a while, hoping that one day I would be in the mood for a stylish but brainless anime. Months later... I have realised this will not happen.\n\r\nThe story - or lack thereof - is disgusting. Fair enough, the DMC series never was known for its plot lines, but there is a huge difference between playing and watching (which is highlighted particularly by this anime).  I actually had\n                  \n\nto force myself to finish the first episode. There was a basic 'transport this girl to this place' thing going on... punctuated by a bunch of demons popping up and almost killing someone,  before Dante appeared out of nowhere and killed them EVERY SINGLE TIME. There was no character development either... just a stereotypically cool Dante doing all the stylish stuff we could make him do in the games. The sound was predictable and boring - Dante listens to hard rock because he's awesome; we get it. \n\r\nThe one thing this anime does have going for it is the art. It is relatively well-presented and ultra-stylish. That really doesn't make up for how remarkably poor every other aspect of it is.\n\r\nIn all honesty, I wish that I had discovered this anime somewhere in the middle of puberty, when I might actually have been content to kill brain cells by watching a guy shoot monsters over and over and over again. This is the only anime that I have abandoned to date. Steer clear.",
    "\n                This 12-episode anime was produced by Mad House, who had a hand in shows like Death Note, Hellsing, Chobits, etc. \n\r\nSo what went so @#%&amp; WRONG?! Come on, people, you have 3 games, 2 books, and 2 manga volumes worth of background to draw on and you give us Dante playing... death poker?? Are you @#%&amp; kidding me?? \n\r\nThe series has one story per episode for the first 10 episodes, and only develops a coherent plot in 11 and 12. The stories are boring, the action is practically nonexistent, and Dante is more of a cameo than the main character. \n\r\nWho the hell is the\n                  \n\ntarget audience here?? DMC demons do not haunt the world like ghosts and manipulate people from the sidelines. They drop down from portals and immediately get in your face with claws and lasers! But there's barely 10 seconds of action per episode, and crappy action at that. \n\r\nMost of it involved Dante shooting something in the head. If anything interesting does happen, it happens offscreen and is never explained. \r\nHow do you get that from a gaming franchise built on outlandishly stylish fighting?? By the way, Dante hardly talks and has no attitude. Yeah, out of DMC1 and DMC3 they picked DMC2 zombie-Dante. And whose idea was it to make Dante babysit an annoying little girl?? Ugh...",
    "\n                I'm not surprised one bit. No, really I'm not. It's a video game to anime/movie translation. Normally, these types of projects are horrible anyway. I'm sure many people know that this is based on the game of the same name, as it followed Dante completing missions by exterminating demons in some very stylish ways. Unfortunately, although the demon killing is present in the series. The greatness that was found in the games is completely lost. Those out there who sat through the Street Fighter Alpha series, Fatal Fury movies, or heaven forbid Art of Fighting. More than likely shouldn't be surprised and already have an\n                  \n\nidea on just how often the mark is missed. The only thing surprising to me is that the fans didn't outright obliterate this bullshit on release date like they did Street Fighter: Generations.\n\r\nVideo game to anime are mainly meant for one particular fan base, and that is fans of the games. However, as a fan of the game myself. I can tell you that this series doesn't do the game any justice at all, and as an anime, Devil May Cry is pretty much unwatchable. Devil May Cry has almost nothing to offer. \n\r\nThere's a dumpster load of reasons to hate this series. Right from the very beginning, I knew this series was going to be bad because Dante was given a chibi character named Patty to baby sit. This character along with many others serves absolutely no purpose, except to provide small repeated comedy relief which was never funny to begin with, and this is among the cliches that are present in this series. \n\r\nThe characters are incredibly bland, and the secondary characters make appearances for no reason other than to squeeze in popular faces from the video game. Outside of the way they fight, the viewer can forget about learning anything about them. The secondary characters who make their appearances are Trish and Lady: two female fighters that aren't even slightly developed, with only very small hints about them thrown out there.\n\r\nDante is a decent character sort of yet he's very lame as well. He deals out death packing his usual two pistols with a large sword, but his full abilities are never fully displayed. Even fans of the game should come away disappointed here. Try to imagine Ryu from Street Fighter never using his ultimate attack, which would be the \"Hadoken\", and you will get the picture. In addition, I find nothing cool about a character whom fights demons, but loses to children and everybody in grown up games. Plus, has a love for cherry sundaes? It just comes off weird to me. Instead, he should be drinking beer, some fuckin' robust, full bodied, imperial stouts or some shit.\n\r\nThe direction is atrocious. The series utilizes an episodic format which happens to become quite repetitive and very predictable. Clients would appear to Dante requesting his services, and each episode ends with some type of battle with a demon. Hints at a greater plot are mentioned very early. Only to be completely dropped and never mentioned again. \n\r\nGiving a tad bit of credit where it's due. Some of the villains are somewhat interesting with decent abilities, but every last one of them are poorly used in delivering good battles. The action sequences are very boring and lack a lot of imagination. Many of the fight scenes either consist of off screen and unseen action, or are decided in one move victories. This also includes demons that are heavily hyped in to being real threats. The battles are colossal disappointments, and they are cut too short for an action oriented fan whom has binged on a lot of action anime to really be pleased. There are too many action titles out there that very far surpasses this, and I'm talking titles that pre-date this at least a decade.  The ending is every bit as unsatisfying, bland, and nonsensical, as every thing that came before it. This series is almost a bigger waste of time than Hell Girl, and that's saying a lot.\n\r\nDevil May Cry at least stands out with its production values. It definitely looks pretty, and it smoothly blends in 3-D with CG. The artwork brings the Madhouse flavor with scantily clad chicks almost baring it all, and the character designs are very faithful to their video game counterparts. I didn't find any of the designs for the demons to be impressive. Only passable at the very best. \n\r\nThe soundtrack contains a real good opening theme, which is titled \"d.m.c.\", and quite honestly displays the best animation in the series. Plus, the ending theme is a nice song performed by Rin Oikawa called \"I'll Be Your Home\", but it's not worth sitting through 20+ minutes of bad anime to hear it. The voice work from the English cast was fine to me. Dante at times delivered some profanity filled lines, which were kind of funny. I can't comment on the Japanese cast, because I would never sit through this more than once. \n\r\nDevil May Cry is a nightmare for the anime vet and non fans of the game; but as a fan of the game, all this series does is make me want to play through the games for two reasons. Number one: to remind me that Devil May Cry really is a cool and entertaining franchise. Number two: to cleanse my mind of the vacuous tripe I've wasted my time on. I would say avoid this shit, but since it has a high rating I'm probably wasting my time.",
    "\n                I finished watching the whole series last night. DMC was simply awesome! \n\r\nI was looking for an anime that is shonen or seinen with a genre of action and with top priority on cool graphics - so I picked Devil May Cry with a lot of hesitations. \n\r\nI also thought I would never watched this kind of anime because I was tired with so detailed-like graphics and animation TV series I used to watch back then. But then again I thought, I'll give it a try. Man, I was wrong! I was hooked up right after I watched the first episode. \n\r\nI'll break down my\n                  \n\nthoughts on the anime without giving spoilers (hopefully). :)\n\r\nArt:\n\r\nWhen I watched the first episode, I said, &quot;WOW!&quot;.  The graphics left me in awe with nicely drawn characters and backgrounds. Colors used were also great - with Dante in red dress and white-grey hair of which I thought before was boring if this is his &quot;uniform&quot; but then again, I was wrong if you&rsquo;re caught up with the story.\n\r\nI give the art as 10/10.\n\r\nSound: \n\r\nThe OP soundtrack was superb and in sync with (flashes of) characters in their little scene. I did not read that entire lyrics of the ED soundtrack but the melody was nice. \n\r\nSound effects were also superb. \n\r\nOverall, sound is top-notch and I give it 10/10.\n\r\nStory: \n\r\nI like how the anime story was somewhat divided per episode but each ep was connected in reaching to the climax. I really like the last episode. It left me smiling after watching it. I like to watch more of this anime!\n\r\nI also like the fact that they employ humor in the story for the main character; though humors here are little as this anime focus on serious action. \n\r\nWhy it's not 10? Maybe because it's a short series and I would like watch more about the main character's development as he is in the anime.\n\r\nIt's 9/10 for me.\n\r\nCharacter:\n\r\nI say the main characters were cool with cool moves and were nicely drawn. I even found Dante sexy. Now, don&rsquo;t get me wrong. :D His moves were cool and sexy especially with his guns and sword. The lead female characters were also pretty cool and sexy. \n\r\nI give them 10/10.\n\r\nEnjoyment:\n\r\nThe entire series is a total enjoyment for me. Pretty cool characters and their moves with top notch graphics to go with. Story is not so intricate for me but it also gives mysteries which were unfolded in the climax. \n\r\nI totally enjoyed this anime, so it&rsquo;s 10/10. 2 thumbs up!\n\r\nI highly recommend this to those who look for action anime with very nice graphics, cool characters, superb sound, and story in one package.",
    "\n                Devil May Cry is something I desperately hoped would turn out great. Most things based off a video game- whether it be a movie, a book, or even an anime- are damned to fail. So for Devil May Cry, based on the video games of the same title, my hopes were that this work might succeed in its attempt to become a great anime. They might have been foolish, selfish wishes, but I wished that it at least would at least try.\r\nWas this anime as good as it could have been? The general consensus is no, as it seems. Why? To illustrate how an anime\n                  \n\nbecomes boring, a list, featuring Devil May Cry:\n\r\n1. Dante doesn’t have flaws.\r\nIf he does, they barely exist. He’s a freaking blank slate. He always defeats every demon in his way, EVERY TIME. Conflict? What conflict. If there isn’t anyone he can’t kill, then why even bother watching. Even Dante is aware of his extreme powers, and is constantly bored by his opponents. If he’s bored, we’re bored. You won’t be at the edge of your seat, because you know he can defeat whoever comes his way. It’s healthy to have the character lose once in a while, because it keeps the audience on edge. It’s permissible to never have the characters lose, but at least let them break a sweat. If Dante ever breaks a sweat, which he won’t, it’ll be the cool kind, like a strawberry sundae oozing down his face or a pizza slice breaking out of his pores and sliding with a greasy trail down to his- scratch that, that’s disturbing. I actually wanted Dante to lose or die in the end, because it would be a major twist from the usual formula of ‘I can’t defeat this guy… just kidding’ that Dante relies on all too often. It’s a level of boring that can only be matched by watching plastic grass grow. \n\r\n2. Being something all the time = boring.\r\nDante should not be cool 24/7. It gets boring and grating to watch. He’s cool when he sleeps. He’s cool when he eats his cool food. He’s cool when he walks all alone in the dark, in his cool outfit with his cool sword and cool shiny guns strapped to him and his cool poker face. He walks out of a fight without even a single speck of soil landing on his clothes and his hair immaculate. The coolness is great at first, but after the same thing all the goddamn time, you might even find yourself switching to “Mars of Destruction” instead of this crap. At least you can laugh at MoD.\n\r\n3. The plot comes at the last minute.\r\nLook at the picture for Devil May Cry. Go ahead, look at it. The white haired guy in front, as you probably know, is Dante. The other two guys are central to the plot, but show up at the next to last episode. That means the rest of the time was spent on NOTHING. The rest of the time is spent on Patty, who is basically Ciel’s fiancé Elizabeth from Kuroshitsuji mixed with Renge from Ouran High School Host Club. If you don’t know who those people are, the mishmash would be a grotesque mass of blonde hair, clingy personality, no point, and a really annoying tendency to appear at the worst times. That’s Patty for you, a girl who should’ve left after the first episode, but stuck around just to add another element of suck to the DMC headquarters.\n\r\nNow that we’ve got that out of the way, more about the plot. The plot is so rushed into the ending that they shouldn’t have even bothered. Most of the anime is just one episode dramas which have zero conflict because as I said before, Dante doesn’t lose. Ever. Devil May Cry is about Dante and friends having wonderful romps through their zany adventures of killing bloodthirsty demons. And Patty’s there too, I guess. It wasn’t very good, it’s very obvious it was based off a video game. There’s really no explanation of anything- I would have loved to hear the limitations of the demons, the limitations of Dante, or how Devil May Cry got started. Nobody gets that much of a backstory, no rules of the universe are explained, and no real emotional ties between characters are developed. It’s cripplingly average. The majority of the anime is Dante strutting around eating his strawberry sundaes and pizza and beer while shooting demons. It’s not very fun once you get passed the first episode.\r\nOn the technical side, it’s obvious that they did do a bit of demonology research, evidenced by names such as Baal, Modeus, and Dante. That, however, is to be expected and it‘s not very impressive.\n\r\nMoving right along to the art, there are a few things that need to be said about the dreaded art. It’s blasphemous to see an otherwise gorgeous characters massacred by unsavory art. Dante’s really hot, but you wouldn’t be able to tell because the damn animation could turn caviar into feces with a garnish of roadkill. Trish the sexbomb was reduced to Trish the kill-it-with-fire bomb. Lady went from looking like Meagan Fox to looking like something a fox just killed. The animation’s boxy and has a freaking ugly style. However, it gets a four because it’s not bad enough to deter you from watching the series. Most of the other things might.\n\r\nRight about here’s where characters are discussed, and it’s a real shame that they’re basically cardboard cut outs with traits slapped on to them. In fact, each character can be described in one sentence without fear of missing a personality aspect. They are all so flat that pieces of soggy paper say to their children, “Honey, some day you’ll be like Dante.”\r\nDante isn’t the only character at fault here. Lady is a chick who basically fills the screen when the animators take a break from Dante’s face, Patty is a chick who is there for comic relief, but it’s more like comic agony, and Trish is the girl who’s supposed to be really hot, but as I said before, the fault lies in the sub par animation. It’s notable that Patty is one of the few original (to this anime) characters here. The actual demons are transparent and you can see their explanations for their actions coming from a mile away (I wanted to battle the infamous Dante, I need to prove myself to master, I knew your father, etc).\n\r\nThe sound of the whole thing was okay. It was just alright. The choices were very obvious, like “DANT’S BAD@ZZ SO OBVSLY HE LURVES ROCKNROLL OMG LOL!!!1” It’s sickeningly mediocre rock, by the way. Nothing particularly hardcore.\n\r\nAs for the enjoyment, if you watch DMC, watch it for the ride. If you get tired of the same cool shtick over and over then watch a few episodes and don’t finish it, the ending does not carry a great payoff. Otherwise, I recommend this anime to those who are intrigued by badassery and badassery alone.",
    "\n                Basically, Devil  May Cry is about a half demon half human who takes on a job as a Demon Hunter. If you love shiny guns, motorcycles, blood and shiny swords, this may be the anime for you.\n\r\nStory: (6/10)\r\nThe story isn't really bad. It has the right materials which are pretty substantial. In other words, the background of the story was great! It's very interesting; European setting, demons, Demon Hunter and so on. But then, the materials weren't used properly. So the story flow became really dull. The story development wasn't really visible. It was only until the 11th episode that the climax was drawn.\n                  \n\nAnd as soon as you're finally enjoying the climax, you suddenly get lost because the series has already ended. Personally, I think that the series was simply too rushed. I believe this would have been a better series if the story was more developed.\n\r\nArt: (9/10)\r\nThe drawings are good. The proportions are great. But what I love most about this anime are the shiny guns, Dante's sword, some motorcycle scenes and the bloody scenes. Graphics' really good. The art complemented with the story and the atmosphere it was trying to give off.\n\r\nSound: (5/10)\r\nSorry to say, I did not notice the sound at all. I only heard the gunshots and the dubs. Maybe it was part of the main idea of the story. But I think that more sounds would help define the atmosphere. That aside, I did NOT enjoy the OP and ED at all.\n\r\nCharacter: (6/10)\r\nThe characters are interesting, but they were not developed well. The same comment as the story. They good materials but were not used well. For one thing, Dante's father and mother could have been given some light, but they weren't.The other two female characters, Lady and the girl that could use thunder could have also been given some emphasis. Simply put, there were not enough interesting flashbacks for the viewers to sympathize are empathize with.\n\r\nEnjoyment: (8/10)\r\nWell, it was funny and action packed. Again, you'll really enjoy this if you love guns and blood.\n\r\nOverall: (7/10)\r\nThough the story and characters were underdeveloped, the anime's decently enjoyable.",
    "\n                This is a bit of an odd show for me to talk about. On the one hand, looking at it critically is pretty difficult. It's based on a game series that I really like, and they really do the games justice, and trying to look at it critically makes me feel like I'm nitpicking issues that didn't really impact my enjoyment at the end of it all. However, I do want to be somewhat fair with it, so I'll give them two ratings: one as a fan of the games, and one just looking at it as is.\n\r\nAs a fan of the games, the show\n                  \n\ndoes just about everything that I could've hoped for. If all you're looking for is a show that represents what the games are all about while also getting a new story, this does the job pretty well. I am honestly surprised that this show isn't brought up more when it comes to good video game adaptations, at least when talking about representing the source material in a good way. There's a few things that I feel like they could've improved on when making the show, like sometimes I feel like Dante's a bit too much of an asshole at times, but they're pretty nit-picky, and it's not really a distracting issue, just something I feel like fans would pick up on. I really can't say much more about it from the perspective of a fan, so I suppose it's time to talk about specific things about the show.\n\r\nBefore I get to the thing that some people might have an issue with, I actually want to praise a couple of things before I get to that. First: the animation. It's pretty damn good looking, which is pretty common for shows made by Studio Madhouse. The show was made just around the time when digital animation started to look really good in TV shows, and it looks really good, especially for the time. It's all mainly hand drawn, but mixes some CGI in there, but only for very specific moments when you'd probably not even notice the CGI. It also just looks good stylistically. The day time/bright scenes look decent, albeit kinda standard, but the show looks especially good in the night/dark. I could go into way more detail, but there's a lot of layers to making stuff look good in different lightings, so... I dunno, watch a YouTube video explaining it.\n\r\nThe other thing I want to talk about is the music. The music in this show is pretty damn awesome. Some of the tracks feel like your typical anime tracks, nothing good, nothing bad, but the tracks they play in fight scenes are pretty friggin' rad, especially near the end. The track \"Evil Spirit\" in particular really sticks out as a really good track. The opening theme and ending are pretty damn good too. I don't really have much else to say about the music, it's just really good, and I wish it was available regularly.\n\r\nNow, for the one issue I feel like a lot of people might have. If you aren't a fan of the games, then I can't really see this doing that much for you. I mean, on its own, it's decent, but nothing too special. The characters feel like standard anime characters, the story is pretty standard, it would most likely just feel standard if you aren't really familiar with the source material. It's fine, but having knowledge of the games makes it way more enjoyable.\n\r\nSo, as a fan of the games, it's like an 8/10. Very much a must watch if you like the Devil May Cry series. Looking at it without knowing the games, it's like a 5 or 6/10.",
    "\n                A lot of gamers are, at least, familiar with Capcom's Devil May Cry. The franchise is pretty beloved, except for that reboot one where Dante had dark hair and was, objectively, a piece of shit. In 2007, after the third instalment but before the fourth, our old friends at Madhouse started releasing an anime based off of the games. That's right, the studio that brought us such adaptations as X-men, Metropolis, and FF Legend of the Crystals was behind this. Well, maybe this one isn't a pile of garbage like those were. Well, except Metropolis. It was just sub-par. \n\r\nStory:\n\r\nWe open with Morrison bringing Dante\n                  \n\na job. Now, you might find yourself asking “who the hell is  Morrison?” He's an original character who basically exists to bring Dante work and, occasionally, drive him around. The job is simple, Dante just has to safely escort a young orphan girl to the estate of the deceased father she never met to claim her inheritance. Naturally, she's being hunted by demons. \n\r\nThis is one of those anime where the underlying plot is pretty light and most episodes are just doing their own thing. Dante gets a job that somehow involves demons and then he goes out to slay them. In fact, the weakest part of the series is the big underlying plot. You get little snippets of it in quite a few episodes, but it ultimately involves a lot of contrivance and it's just not very good in general. Even the ongoing stuff that's meant to draw your attention to the fact that something is afoot is largely just dull and really obvious. To the point where it's just “this again” after a few times. The episodes also have a general problem of trying way too hard to give happy endings. To the point where they can just go completely off the rails and not make much sense. There are quite a few episodes that set things up for sad or, at the very least, bitter-sweet endings and then pull happy ones out of their anuses. I guess I missed the memo about DMC being for small children who can't process tragedy on account of the PEGI 16 ratings. \n\r\nWith that being said, a lot of the episodic scenarios are pretty interesting. Varied too. Yeah, you know that Dante is going to fight some demon,  but there's a lot of variation in what kinds of demons he'll fight and how they'll approach. Some of them use stealthy approaches or try to use guile, others prefer the direct approach. Some are after him specifically, others just happen to stumble upon him while going about their terrible business. And some of the scenarios are really intricate. The death poker game being a prime example. \n\r\nCharacters:\n\r\nThe characters from the games, Dante, Trish & Lady are all portrayed pretty true to character. Which is more than a certain reboot managed. In terms of original characters, some of the ones Dante encounters on his missions are kind of interesting. Others are pretty mediocre. Then we have our reoccurring Ocs, Morrison & Patty. Morrison is a boring character. We don't know why he's bringing Dante jobs, how they met or anything beyond “he brings Dante jobs.” He's pretty much on par with the plot coupon guy from your average PreCure series. And those can get by with it because they are actually for children. Then we have Patty. Have you ever wondered what Devil May Cry would be like if Dante had a slightly annoying child sidekick? No? Well, it's not the best decision that Madhouse could have made. She spends a lot of time pestering Dante, having to be rescued and contributing virtually nothing. \n\r\nArt:\n\r\nThe artwork is pretty decent. The characters look like themselves and Madhouse clearly made an effort to make the aesthetic look like DMC. The demon designs are generally pretty good as well. The trouble is that the action sequences themselves aren't all that good. In a series that relies heavily on action sequences. A lot of the “big” Dante fights end very quickly without having much content. And a lot of the sequences focus heavily on scenes of Dante attacking while not showing, or barely showing, his opponent. It would've benefited from showing them striking at one another in the same frames a bit more, is what I'm saying. Oh, and expect a lot of deaths to go the blood fountain route. I guess demon blood streams are highly pressurised. \n\r\nSound:\n\r\nThe series did get some good voice actors. We've got Morikawa Toshiyuki as Dante. Yes, Dante and Sephiroth are the same guy. We all suspected it given the resemblance. We've got Orikasa Fumiko and Tanaka Atsuko, both of whom are damn good actresses, as Lady and Trish respectively. Even the less interesting characters got some decent voices. The musical score by Hama Takeshi & Tsutsumi Hiroaki is pretty close to fantastic. \n\r\nHo-yay:\n\r\nThere isn't any, really. The closest you're going to get is Lady and Trish forming a friendship. \n\r\nFinal Thoughts:\n\r\nDevil May Cry is an anime that had some potential. After all, there's a lot to work with from the games. Unfortunately, it's held back by a dull underlying plot, trying too hard to provide happy endings, the slightly annoying child sidekick and mundane action sequences. Ultimately, I'd still say it's all right  but it certainly could have been better. My final rating is a 6/10. Next week we'll continue video game month with a look at Street Fighter Alpha.",
    "\n                Have you guys ever heard that video game base on movie are just merely a product? Well, i remember some crappy video game base on movie game like Transformers, or ET. But maybe some game like Lord of the Ring or maybe the recent Wolverine game for the PC is good. Speaking of game, now i going comment a anime that was base from one of the best game from Capcom call 'Devil May Cry' (wahhhhh.....), and how that i think about it; well, let's find out!\n\r\nDMC, when it say it going to become an anime; i like any other DMC player are jump for\n                  \n\njoy for it adaption. But after going through all the 12 episode of DMC, i like any other DMC player are down with sorrow and anger that what the hell the director has done on DMC.\n\r\nThe story in this anime are all episodic, each episode are stand alone story until episode 9 or 10 where the real plot has finally started. And each episode are all the same: \n\r\n1,there is a demon case\r\n2,Dante sitting around and do nothing (or maybe try to annoy Patty stupid problem) until Morrison say 'get your ass up! We got work to do, blah blah blah....'\r\n3,He goes to work, have some help from Lady and Trish\r\n4,He blew the work, mission accomplish and his debt is increase. The End!\n\r\nThat it! Nothing new, no plot that connected to other plot, zero! Until episode 9 or 10.\n\r\nSure you have character like Dante, Lady, and Trish to be animated here, and you do have character only for this anime, like Patty, she has been on the series since episode only has 'finally' been serve as a important character on episode 9 or 10, for the rest of the episode she just serve as a annoying brat! And Morrison, Dante agent always try to bring him a good job but end getting mess up by Dante.\n\r\nFor Dante, Lady, and Trish (i still want make a comment on them!), Dante still Dante, like pizza and strawberry, and weild Ebony & Ivory and Rebellion to fight off demon. And the funny thing is, he use his gun more than his sword! Even the director finally let him use it, the sword battle are just temporary! But Trish and Lady still play their role where they supposed to be, to support Dante and take Dante credit!\n\r\nAnimation is good, no less. The shading and everything was good. Even the bike scene in episode 2 are well done. Plus the OP of the series was nice, able to blend in the series as well. But the ED (though i didn't listen that often) was smooth and relax.\n\r\nWhat is the credit for us finishing DMC anime? Zero!\r\nWhat is the credit for them finishing DMC anime?Promoting DMC4!\r\nWhat is the credit for us buying DMC anime DVD?More DMC4 bonus!\n\r\nAnd in my opinion, this bonus are come to nothing and pointless after the real thing is out. The anime just bring down Dante good point and completely destroy the DMC atmosphere. And DMC is not the only one being anime, other like 'Tales of...', '.Hack' did make the series well and on going. And heck, even the live action Resident Evil movie was better than this!\n\r\nThat why product movie, animation, comic or anything that is base on something are mostly not a good thing!"
]