[
    ", and although the animation quality does have a bit of a hard time keeping up with the fast-paced nature of the action at times, it still does not feel like a huge problem. After all, those scenes are all about being as ridiculous and exaggerated as possible rather than ever trying to be anything photorealistic. And if nothing else, Keijo's mere existence was a massive middle finger to a large portion of the SJWs all over the internet, so at the very least it definitely deserves some bonus points for that.",
    "nsert 8 exclamation points) to work, it needed to have stronger and more interesting characters and to have done more with its premise; which it didn't. I can only recommend this to you if you're a hardcore ecchi fan since there are so many better shows out there for you to enjoy that actually take the time to develop characters while still having a lot of ass and tits. I would imagine watching this show incredibly drunk with friends could be fun, however...\n\r\n(Part of LIQfilms 12 Days of Christmas - Day 9)",
    "s like the *shoryucans*.\n\r\nI really would have hated Keijo in any other context. I don't think the studio that picked it up really put that much thought into it either. The artwork suffers from what appears to be some anti-aliasing effect, which for a hand drawn show is just a \"da fuq\" moment. I'm sure with their vast catalog of ecchi shows they simply saw something with tits and ass and figured, \"looks legit and right up our alley.\"\n\r\nWhat they produced, however, was one of the best anime comedies of 2016.",
    "the audience react to its absurdity. If you look at it critically it has several flaws like plot armour, lack of logic and jokes getting overused.  However, it will still wow you with sheer amounts of bizarre unpredictability. \n\r\nSo if you want to watch an “ecchi” show but can still tell your friends that you watched a sports shounen with comedy vibes like OPM & MP100, definitely give it a shot. \n\r\nP.S. I’m always open to criticism and suggestions and I hope you found this short but supaishi review helpful.",
    "it. I expected nothing special to come of this series. It was only when I finally decided to read the reactions of others that I finally sat down and gave the show a watch. To my amazement the show is pretty solid and well-polished. As I said earlier there are various changes that could’ve been done to make the visuals look better however, despite how unhappy I was with the designs, the action and comedy is what eventually allowed me to accept Keijo as an 8/10 anime. Overall I was very impressed with Keijo.",
    "               \n\nup a perfect final ending to the series. The music seemed to fit every moment very well especially during battle scenes towards the end of the season. Speaking of the battle scenes, I feel the artwork of some of the abilities was astonishing especially when two opponents collide (this is very evident during the season finale.)\n\r\nI really hope that they announce season 2 and it looks like they plan to as the finale set a second season up perfectly.\n\r\n10/10 can't wait to purchase the box set.",
    "motto, \"Only Land\". This refers to the idea that players should treat each other with utmost respect, as equals when in normal social situations, and to save competition and rivalry for the races taking place on the Land itself. This is not my favorite anime of all time, but it earned its spot in my top five and managed to surprise me in more ways than one. I hope more people give this a chance despite the occasional detractor, because that joke about Keijo saving anime might hold more merit than you think!",
    " music was also spectacular, much to my surprise, and I will definitely be hunting down the OST so I can continue listening to it.\n\r\nThe writing was also very fun, at times, Keijo!!!!!!! actually felt more like a shounen in disguise, instead of an ecchi. Keijo!!!!!!! was so over-the-top, it was nothing but enjoyable to watch.\n\r\nOverall, Keijo!!!!!!! was one of the biggest surprises for me in Fall 2016. If you are like me, and like big butts and you cannot lie, then Keijo!!!!!!! is the anime for you.\n\r\n11/10",
    "shounen, comedy, ecchi and fanservice anime which isn't involved in your generic harem or slice of life trope, this show is for you. To be honest with you though, you may need to overlook a few things in order to fully appreciate the fan service.\n\r\n-Please do not make this your first anime- both for the genre of ecchi and just anime in general. Keijo is an Anime that can only be recognized as fantastic from people who have been exposed to ecchi anime beforehand, and are comfortable with japan's 'weirdness'.",
    " episodes. \n\r\nKeijo is one of the few animes in recent years that I've notice properly build up tension unlike some aspiring shonens, can attach distinct personalities to each character and develop them respectfully, but most importantly take the ironic tension of a sports anime, let along ea beach sport, and dial it\n                  \n\nup to an 11.\n\r\nAnimation and perspective is mostly on point, sound track is nothing special but useful, and it's great to watch if you're looking for something fast and fun.",
    ", fights up interesting to see, ecchis idiot scenes, well, already gave to realize that I did not have any enjoyment while watching.\n\n\n\r\nOverall (2/10): \r\nKeijo is just an anime made for ecchi and fanservice, an original but stupid plot, idiot characters that seem more sex dolls than at least decent, since it has no focus for me to be interested in them, horrible soundtrack, animation at least Descente in the \"fights\" and an stupid comedy. I recommend seeing with your friends just to laugh how stupid it is.",
    "atures some of the greatest character designs, even giving birth to original architypes and creative moves like \"Titty Hypnosis\" and \"Buttack on Titan.\" We got to see all the characters grow throughout the show and develop stronger butt muscles and thicker butts. The thicker butts really drew me in as I dove further into the alluring and mysterious\n                  \n\ndepths of the Keijo!!!!!!!! world. I'm still a virgin, but even I know that this show is better than sex!\n\r\nPeace out, \r\nYa boi, Skinny Penis",
    "storyboard. The phrase ‘It’s so bad it’s good’ summarizes it perfectly. \n\n\n\r\nTherefore my dear readers who have made it this far, even if you zealously hate fanservice, or perhaps you’re the one that faps to hentai every day of the week, try this show out. It’s a polarizing one indeed, where one could either give it a 1/10 at a drop of the hat, or a 10/10 comparable to the second coming of Jesus Christ. Nevertheless, it is indeed one which will be brought up when you want to think of how crazy anime can be.",
    "ing sizes of prominent features. Though, I must say, if you don't like muscley girls, you won't like the girls of Keijo. Perhaps the show lingers for too long looking at a certain angle, but it never feels particularly like camera-angles are decided by a pervert. They feel more like a sports show.\n\r\nBecause that's what it is. A ridiculously good sport show, with a crazy concept, a unique sense of friendship and a hilarious script that you're doing yourself a disservice not to watch. If only for the giggles.",
    "'s not here to praise your ego or celebrate your private parts, it's just a fun little fight anime with butts in it. Even the visual part of the fanservice is rather sheltered.\r\nOn a small complaint note, as a tits man, I wish there'd be less butt techniques and more chest ones. \n\r\nBut overall, I recommend Keijo as a simple, well-done action/humor anime with lots of asses in it. It's been far more entertaining than I'd have expected and everyone around me also seems to have been enjoying it just as greatly.",
    " body\r\nGit in your bikiniiii, got a routine\r\nKnowing still got a few chunks on your shoestring\r\nShowing I was sooo ready till the beat vibrated\r\nthey got revibrated as soon as them Bitch gyrated\r\nAnd hips and licked them lips and that was it\r\nThey had to get their ass some training.    \n\r\n Shake that ass for us, shake that ass for us\r\nCome on girls, shake that ass for us, shake that ass for us\r\nOh girls, shake that ass for us, shake that ass for us\r\nCome on girl, shake that ass for us, shake that ass for us",
    "I honestly do not understand why it is not a real thing and just enjoy what feels like magic being used for sport in a perverted flashy way then you can love this show. The magic has an over the top feel to the moves the girls make I hope exists in all sports on this show's planet. \n\r\nIn the end, it is a strong 8/10. The art let it down at points but also as good as the story is you cannot really connect to anyone. It ends in a really nice place that doesn't need more adaptation unless it is done correctly.",
    " (give us a damn season 2 mfs)\r\nbut the lines sometimes were to thick\r\nbut that's not serious problem\r\nsound(7/10)\r\nbassiiicc\r\ncharacters(10/10)\r\nhonestly out of all characters kusakai was the best one (an interesting fact about me, I find a lesbian ROMANCE the most interesting concept\r\nthe main characters were mehh\r\noverall(10/10)\r\nI love an ecchi show with good story and fighting stuff, I think keijo managed to do what it was going for and actions were cool, techniques were fucking ridiculous I enjoyed it",
    "torytelling were, on the other, side not the most original or layered examples in recent history, but both served it's purpose. The characters were for the most part likable, (some where even a bit memorable) and the story even though it was cliched was uplifted by the sheer ridiculousness of the concept. Overall I really enjoyed the show and would hope for a second season.(Eventhough they caught up to the source material and since the manga is a monthly release there will be no second season anytime soon.)",
    "t it would be like, but with boys and with less action, the same season that brought Keijo brings you Yuri on Ice as well.\r\n-over the top action route- There was no way to put this here after watching the last episode, but Kill la Kill. The final battle itself is a reference to Kill la Kill\r\n-ecchi- there are far more 'ecchier' anime than Keijo, but I will give it props for not being the entire focus of the anime, just a way to catch the viewers eye. If you want 'true' ecchi, try Highschool DxD on for size!",
    "e fight scenes are one of the best one\n                  \n\nI have seen so far and the art work with their use of sexy, thick, black, border-outline is wonderful. The character designs are great; however, if you're looking for some kind of good character development then turn away from this show because it has little. It sometimes tries to add some depths to it's character by suddenly throwing flashbacks during the fight scenes I find kind of annoying; I watch Keijo!!!!!!!! because of the sport Keijo itself.",
    "racters. The characters all had their own weaknesses and powers. They were all a one of a kind which i think is well done!!! Ilikedall of the characters personalities, so well done scriptmakers!\n\r\nThe art was good of course, but you would expect that. A lot of time has been put in this serie by the artist and you can really recognise that. \n\r\nThe music was good. I liked the opening music and the outro was really funny and is the best!!\n\r\nI enjoyed watching keijo and its definitely a high quality animeserie!",
    "ow? Check!\n\r\n10/10 on everything, must watch. Witness the glory that is a sport entirely centered around martial arts using only the buttocks and the breasts. Learn the fine science of \"asstrology\" and get motivated to workout yourself as these hopeful athletes become the best young women they can be. See the thrilling 12-episode\n                  \n\nadventure of a barely-legal girl fight her way to the top of a fantasy sport with secret techniques, training montages, and cute girls doing cute sports things!",
    " main girl Nozomi or her background, but we love her anyway. Right?\n\r\nAll in all, if you're looking for inspiring life lessons, evolving plots, or introspective moments, Keijo!!!!!!!! is NOT for you. If you like cliche sports/fighting animes with training montages, powerful techniques, and cheesy motivational speeches, then Keijo!!!!!!!! is that plus all the boobs and butt you can ever want.\n\r\nOverall, I would rate Keijo!!!!!!!! a 7, but the hilarity and guilty pleasure factors raise it to a solid 8!!!!!!!!",
    " but mostly when about the absurd setting and not when they’re interacting with each other as characters.\n\r\nAll in all, Keijo isn’t a show for everyone; those who do find the premise “interesting” will find an incredibly fun show and solid timewaster, while those who are unable to suspend their disbelief will not enjoy it. Both are perfectly acceptable opinions and it boils down to what you, the viewer, wants to watch.\n\r\nThank you very much for reading this review, any and all feedback would be appreciated.",
    " uninteresting, and the characters stand around a lot, attractive designs, flashy power moves, comedic styling, and emphasis on the assets showcase thrills and arousal\n\r\nCharacters: Fine, Nozomi’s positivity encompasses the spirit of keijo, the other cast members highlight motivational mottos and parallel powers, but Kazane’s arc is treated rather poorly\n\r\nSound: Good, good OP, okay ED, good OST, okay VA performances, and nice sound effects\n\r\nEnjoyment: Great, butts are better than boobs\n\r\nFinal Score: 7/10",
    "ff trying to imagine how bizzare it would be to have any sort of sexual experience with any of the cast of this anime... and I mean it.\n\r\n It's also worth mentioning that while Keijo!!!!!!!! (yeah you figured I love me  them exclamation marks!!!!!!!!) is not listed under the \"parody\" nor \"comedy\" genres, it got me (and 99% of the people who watched it) laughing out loud in every. single. episode. Oh, and add quite the healthy cringe to the mix - it happened.\n\r\n I want more Keijo!!!!!!!!, and I want it fast.",
    "ts where the anime escapes the bizarre shounen parody to show us a bit of reality and family drama.\n\r\nThe anime has a fan service scene every second, there are several beautiful girls in bikinis and swimsuits, and there is no shortage of focus on breasts and butts; congratulations to the author who combined exaggerated fan service scenes with the plot; there is no explicit nudity in the anime, for those who like fan service, breasts, butts, parody, sports, breasts and butts, the anime is highly recommended!",
    " lack of character motivation and development. Without a compelling backstory or clear goals for the characters, it's difficult for the battles to carry\n                  \n\nmuch weight beyond the spectacle. Moreover, the absence of a real antagonist further exacerbates this issue, as there is no one for the protagonists to truly strive against. Despite these shortcomings, Keijo!!!!!!!! still manages to leave a lasting impression, making it a guilty pleasure for fans who enjoy a healthy dose of ecchi comedy.",
    "voice felt odd and it brought the right personality to the characters. the soundtrack i something to be left desired as it is mostly forgettable, but not bad for me to hate it\r\n6/10\r\nenjoyment- this anime was one hell of a show. it was so ridiculous and absurd that it is. i can find anything to hate about the show, but of course i have little to give great praises about as well. 6.5/10\n\r\noverall- everthing from story, characters, animation, and sound are above average, and was a decent joy to watch\r\n6.5/10﻿",
    "well.  You also do want to see the main character succeed and its shown in the very beginning of the show that even though she is good at the sport she is nowhere near the best and still has a lot to learn.\n\r\nOf course people who love anime fan service will love the hell out of this show but if you're someone who loves to laugh at ridiculous things or someone who likes to watch \"so bad that its good\" movies because of the bizarre choices that the movie makes then I think you'll get a real kick out of Keijo.",
    "pretty much archetypal but in a good sense. But I seriously think that the main character could do with some more elaboration because I feel that the supporting characters have more background than the main character and the focus kind of shifted on them instead.\n\r\nAll in all, I enjoy Keijo thoroughly, it's an easy watch and you don't get too hung up on the characters too much, the story is light and you could just relax and let go when watching this anime, also the references in the show were pretty funny.",
    "ething, especially when it's exactly a parody sports-esque anime, with a super exciting plot, great soundtrack and breathtaking battles that own nothing to anyone.\n\r\nThe animation is great, the ascension story to master a technique, the exciting battles, it's everything a regular shounen anime should have and\n                  \n\nthey're executing it flawlessly.\n\r\nThe ecchi is a little over the top, but why bother if everything else is so great?\n\r\nDon't be a prude, embrace a good booty and give Keijo a shot!",
    "The main girls were better than average sports shows though so Id say 7 is fair.\n\r\nIll break down the enjoyment category for this one because it's important. This show is pure stupidity. There is no consistency and their attempts to explain the insanity going on in the races is comical at best. But holy cow was this show a blast to watch. I can honestly say that I am looking forward to watching and laughing at the next season if it comes out. I recommend giving this show a try if you have some time to kill.",
    "but it was nicely done, characters were good, enjoyment and overall,\n                  \n\n\n\r\nwell if you love lots of boobs and butts around, this is anime for you, if you do not, watch it anyways. I hope there will be second season, but if its correct what it says that they use 90 of 95 volumes for this 12 episodes then its hardly that we will get more, but i hope we will, more bouncing and but kicking i hope in future, however even with all good things in this , i cannot give it 10. 8 is nice round number.",
    "s\" to the somewhat ok \"underdog main protagonist sports anime\" and using the fanservice in proper execution and not in your face and embraces it instead. LA wants a second season, no joke and considering what possibilities the ending gave us it could. LA haven't seen something this refreshing under the fanservice banner in quite some time and Keijo quite honestly delivered it and with LA honestly saying it's LA's guiltiest anime for 2016 AND LA's second favourite anime for Fall 2016 that's saying something.",
    "h which apparently makes her ass faster, the question is then later on why doesn't Rin fucking do that and become quicker than Sayaka, then the question is why doesn't every character fucking do it.\n\r\nBanter between character's is relatively enjoyable there's a few good lines in it but it's nothing that hasn't been done in the genre before.\n\r\nHonestly this is the perfect junk anime to binge in like an afternoon since it's quite short, is relatively entertaining and has some decent high production eye candy.",
    "tupid the sport of Keijo is and point that out? \r\nThe ecchi was okay-ish. My problem is, that there is so much ecchi on screen continuously that you can't really get excited about it. It's rather hard to find some scene without sexy bikini grills. Keijo is always trying to do something even more lewd than before and surprisingly doesn't even fail in doing so (looking at you, Shimoneta).\n\r\nSo, would I watch it again? Hell no. Do I regret picking it up as a seasonal anime at some point? Could have been worse.",
    "t the story, and feels like it is inserted through sheer force. But, other than that, there isn't any real flaws with any of the characters.\n\r\nEnjoyment: 8/10\n\r\nAll that being said, i really enjoyed watching the show. Casual, simple and entertaining. Not to mention a unique storyline and lots of surprise attacks keeps me well satisfied throughout the show and doesn't feel boring. If you just feel like watching something casual, or are just here for the fan service, you should give it a try, couldn't hurt ;)",
    "e are genuinely funny, like the \"buttack on titan\" move one of the \"players\" used.\n\r\nThe overall story is actually pretty legit too\n                  \n\nand there aren't really many filler moments imo, every episode is spent developing the characters and their stories to reach their aspirations as pro keijo players.\n\r\nI gave this a 9/10 but its more around a 7-9 rating. Gave the 9 because it was a shockingly quality show that managed to make a fairly serious anime out of a sport using only your ass and tits.",
    " Keijo players.  A sport about knocking other young women off platforms, or to their knees, using parts of their bodies as long as it's not hands or feet.  \n\r\nThat it followed actual women doing this and not your regular teen girls was a huge bonus!  It's rare to find more risque (I use the term very lightly here) anime where the characters are of Legal age lol\n\r\nIt's fun and\n                  \n\nentertaining.  \n\r\nYes I liked this anime and I'm giving it a fair ASSessment here by giving it a Solid 8 overall.",
    " genuinely hilarious to hear characters say stuff like \"I'm getting my butt kicked\" or \"you have yet to understand the true nature of my butt!\".\r\nThe show starts pretty strong but can start to weaken in later episodes due to the novelty of the premise and the jokes starting to wear off.  I would imagine that this show was probably more fun to watch once per week while it was airing, rather than in a one-sitting binge session.  I also think the show probably doesn't have great re-watch value because of this.",
    " years. second of all the sounds of the voices of the voice actors were perfect for how they were drawn. I will admit the story and character development was a little lacking, it had a few things that were very cliche sports anime but regardless characters and the story were still up to the level of a mainstream anime. Then to finish\n                  \n\nit off the show was very enjoyable I could barely keep myself from watching it until I finished it, truly an amazing show. Overall i give this show a 10/10.",
    "its and asses is comedic rather than lewd. Every time booties and boobies are mentioned, it's either a very serious discussion about the sport or some kind of absurd comedy/parody.\n\r\nThe characters\n                  \n\naren't anything special, but they do possess a surprising amount of depth and they feel quite down to earth. Their motivations may not be the most complex, but they are very human and real.\n\r\nIf you want a fun, simple, anime with great animation and fight sequences, Keijo!!!!!!!! will provide.",
    "n't destroy her chances of winning.\n\r\nAnd of course there is the fanservice now at first for like the first 3 episodes it felt pretty ridiculous, but as the series went on it improved and became less stupid and more enjoyable to watch.\n\r\nSo overall this was a surprising anime I thought it was just gonna be pointless fanservice, but there was actually some good character development and was pretty entertaining so if you like women battle with each other using their breasts and butts then you might like this.",
    "entertainment. I hope studio Xebec burns to the ground for this. After seeing their catalog it seems to me they have made nothing noteworthy or even good. The only okay show they have made was Rin: Daughters of Mnemosyne which was still trashy as fuck in content (lesbianism, torture, meaningless religious symbolism). Everything else they made is terrible and repugnant on every level; worst animation studio in history. This anime was terrible and I hope the creators are ashamed of themselves for making this.",
    "itten nicely. \n\r\nAnd the characters are amazing and all around this anime is one to watch if you're having a bad week as its very funny I thought.\n\n\r\nI Hope for a second season sometime in the near future. The art is nice as well.             \n\n\n\n\n\n\n\n\r\nVery Very nice                     \n\n\n\n\r\ni wish it was more yuri\n\n\n\n\n\n\r\nmost girls have bit tits and butts \n\n\n\r\nvdsbuivbdwrbVDRWQNVIFOFRHNWIVHHRISEHVIFHSIVHFISHEVIRWAJNWEIDNWI NFESANNDSNC \n\n\n\r\nIm just trying to make this work so i can put the review out there",
    " and is turned into a Frankenstein-like monster. The comic goes all in on the outlandish premise and has fun with it. Keijo feels the same way. It is the definition of, “dumb but fun.” On the other hand, the plot was stock, the characters were undeveloped, and I thought the premise quickly wore thin. I think it would be better\n                  \n\nif there were fewer episodes, maybe 6 to 10 instead of a full 12. I don’t know if I would recommend it or not, especially if I cared what the person thought of me.",
    "t kind of move is being performed by listening to the sound effects alone. You can almost visualize an attack from the sounds it makes - even with your eyes closed. These sound effects sometimes accompany epic background music.\n\r\nKeijo’s ridiculous premise and it’s shameless characters make for a fun and exciting watch. However, it is not without its flaws; a major one being the dip in art and animation quality towards the end of the show. But these are forgiven for the bold brilliance that is Keijo!!!!!!!!",
    "\r\nThe characters are endearing, all united by the desire to win the tournament, hence a small element of sporty Nekketsu that we can particularly see. The animation is very beautiful, very fluid, and very dynamic, even with the CGI, which we want to see in episode 8 with the yellow bars. Moreover, the character design accentuates the competitive\n                  \n\naspect with bold lines around the players in action. The colors are also bright, which makes it pleasant to watch (without any ulterior motive).",
    "out them at all. Again, I'm not saying this is required for every single show, but the characters are not the strongest point of this show.\n\r\nOverall it's a good show to watch if you are bored. The fights are well animated and entertaining, the attacks and moves get more and more ridiculous as episodes go by, and characters, although plain, are likeable and well designed. Don't hype this show because this is not the best show of the year, but it is definitively one of the most entertaining and fun to watch.",
    "ince most of the time it's so quiet you can't hear it.  The staff really thinks that characters constantly shit-talking each other on the battlefield is more exciting than dramatic music.  Oh well, i'm sure they know better than i do.  \n\r\nFor the most part, watching this was not a COMPLETE waste of time, but i will certainly not be watching any sequels.  I would rather recommend that you watch an excerpt or two of some of the battles and you will have seen everything there is to see without wasting 4 hours.",
    " how they made butt and boob fighting so epic!\n\r\nThe story is pretty generic, but the execution is very concise and interesting throughout. Backstories of the characters are presented, and their lives are developed over the course of the show.\n\r\nArt and Music are really good. I even downloaded the ending song. It was really catchy. The opening is also decent.\n\r\nAll in all, watch it if you want to watch something fun, this\n                  \n\nis definitely a good anime. Just don't watch it in public, like me",
    "ren't all outshined by the generic male main character or trying to win over his approval/affection, which is refreshing in its own way. And I really appreciated that a show in which will attract a predominately straight male audience by its premise alone made its viewers watch two guys kiss (they know what they're doing).\n\r\nI encourage those who are unsure about watching Keijo to simply approach it with a sense of humor and an eye for references. Put is simply, Keijo!!!!!!!! is The Colbert Report of anime.",
    "iously and this only amplifies the comedy aspect. Humor can be very toilet humor like with a lot of butt puns, but overall it works if you turn your brain off.\n\r\nOverall\n\r\nThis is an enjoyable silly series. Has good elements of shounen and comedy, the team battles were my favorite part and it was a joy to watch all the special techniques. I do not think the comedy would be right for everyone though and of all the genres, I think comedy is the most subjective. If you like toilet humor, this is a great series",
    "ore than an excuse to have fanservice in every episode. The special moves characters use also have a slow power creep from merely being names for moves to full on super powers and occasionally making things into a “who can scream the loudest competition” as characters smash their butts together. The effect is amazingly entertaining, but almost too dumb to bear. Keijo is a special case of something so bad it’s good, and is certainly worth a watch for the sheer entertainment value and as a lover of spectacle.",
    "ld just be \"that weird anime,\" not \"that weird anime that was surprisingly enjoyable yet arousing.\"\n\n\r\nOverall Enjoyment\r\nThis show was a very enjoyable show. The story wasn't interesting, nor were the characters or sound design, but the atmosphere and lack of seriousness the show has is what makes it watchable.\r\nShould you watch Keijo? Short answer: Yes. Long answer: Yes, but watch it sped up 2x so you don't feel like you're spending 5 hours watching a sports anime about anime girls bumping asses and tits.",
    "0 (My eyes shaped hearts and excitement gets me off guard) Keijo is really entertainment, funny, and over the top ridiculous. \r\nI never been smiling for excitement or laughing so hard since \"Prison School\", but my head is spinning.   \n\n\r\nOverall-9/10 (It the best fan-service anime, but not prefect) \r\nBest concept, Best MC, Best storyline (good), I didn't expect to be this super surprise or laughably breath taking for air. This anime is just as promising and hoping for another season and I hope it never end.",
    "attention to the plot anymore (\"I'm talking about boobs\"). The animation is top notch and the voice acting is decent as well (I watched the dub). If your thinking about watching this anime, one thing to keep in mind is, don't take it seriously. The butt-fighting moves are unrealistic (in a good way). I went into it like that, and soon found that it's more of a perverted action comedy than a slice of life sports anime. Overall, I enjoyed this anime, and I don't think you'll find one quiet like it. Thank you."
]