[
    "\n                Death Note. Another famous anime. But this time there is one reason for it. In fact, there are lots of good reasons but they can be summed up in one thing: this anime is amazing. Want to know why? Then just keep on reading.\n\r\nStory (8): The first half of this anime is a masterpiece. The concept itself - the Shinigami's notebook which grants the person who has it the power to kill anyone by simply writing the person's name while picturing the face in his mind - is already brilliant to begin ",
    "\n                There's something fundamentally contrived about Death Note which takes what would normally be its best quality, the story/plot, and makes it difficult for a viewer to enjoy it once they start questioning the plot points and devices.  For different people, these are things that can either be overlooked or overtake the show absolutely, and it really depends on both how critically one wants to watch Death Note and how far they're willing to suspend their disbelief.  The major problem Death Not",
    "\n                Adapted by Madhouse in 2006 from the popular Shonen Jump manga written by Ohba Tsugumi and drawn by Obata Takeshi, Death Note is an entertaining ride if an ultimately shallow work.  Unless you just got into the fandom, I’ll assume you are already familiar with the basic plot.\n\r\nOne aspect of the show that its fans seem to constantly praise is its writing and if you can swallow the cheesy, over-the-top dialogue (“All according to plan,” must be repeated at least a dozen times throughout the ",
    "\n                Death Note is original, awesome, and a great anime to watch. The only reason it isn't perfect is because of Near who has to be the lamest enemy ever. Also, the ending was a total cop-out. DUMB, DUMB, DUMB. \n\r\nThe art wasn't that great, but I sure did like this anime anyway. \n\r\nThe sound was fitting; it suited the tense atmosphere and scenes. \n\r\nThe characters were all intriguing and deep, especially Light. It's cool to see such an evil protagonist in an anime. He's certainly original. \n\r\nIf",
    "\n                This is one of the most engaging thriller anime i have ever seen EVER. How could that be? Let me count the ways...\n\r\nStory - The first story arc involves an extremely intelligent high schooler (Yagami Light) with the power to kill against the best detective the world has to offer (only known to the world as \"L\"). Its a classic story of cat and mouse, one consistently outwitting the other with cunning tactics and sly tricks. Each episode also leaves the viewer with just enough suspense to ke",
    "\n                I'm one of the few people who would never say this is one of the best animes of all times and here is why:\n\r\nAlthough the plot of Death Note seems to be very interesting to me, I really belive it is painfully developed all over the anime.\n\r\nFor me was pretty cool when the two main characters was presented has rivals (Light and L): I belived it would be really interesting to see which of them will defeat the other and how. However, all I could get watching it was fucking stupid monologues in",
    "\n                “Dark and mature. A predictable physiological anime. A diamond that choose to stay coal”\n\r\nREVIEW FREE OF SPOILERS!\n\r\nDEATH NOTE one of the most well-known anime worldwide and highly ranked. \n\r\nLet's start! :)\n\n\r\n-STORY: 8-\n\n\nDon’t get carried away, the story isn’t really unique, after all it is –almost- your typical “vigilante” –or hero of justice- anime with a twist. The “lore” –to call it somehow- used in the story IS what makes it unique.\n\r\nEnter Death Note, a book that falls from the s",
    "\n                On the technical side of things, it’s hard to say Death Note has great animation because 90% of this show is dialogue. No one ever stops talking, and while they blabber endlessly, the artists have a field day with lighting, masking, and the poses of the intricately designed characters. Death Note has great, beautiful, gothic, faux-realistic ART. The background and character art is a regal feast for the eyes. The animation is rarely showcased. When it is, the animators have entirely too much",
    "\n                Death Note has a very strong beginning. The story is very thrilling and interesting, since it is a pretty untypical one you might never have seen before.\r\nArt, sound and characterdesign were outstanding good, especially because of the serious atmosphere it created throughout the first part of the anime.\n\r\nIt definitely would have come out as one of the best anime I've ever seen if it would have gone on this way. But it did not. Actually almost the whole anime changes after about 1/3 of the ",
    "\n                Okay, I'm going to a review this time. So, as of a start I will be doing a review on Death Note since it's a fun anime to explain about. I've explained the plot of Death Note many times to the people who have never watched it. And if somebody is getting into anime, I'm sure they will love this anime. Death Note is an anime that really does a lot for me since it was very enjoyable. I review anime differently though. So, you have to follow along with me as I go along. Most my other reviews ha",
    "\n                Death Note is a very good anime and manga, however the phrase \"more is not always better\" applies quite well here.\n\r\nProgression (10): The planning sequences are done spectacularly and are kind of like the action in this show. If feels very \"adrenaline-y\".\n\r\nStory (6): I felt that the themes were not well depicted, especially the ones about justice felt even somewhat childish as many characters attempt to prove their justice but never start having a grey morality. They never start questioni",
    "\n                Death Note is a prime example how to start a show in a great way and drive it to the deepest abyss of the green hell. Anime viewers must be way too forgiving - Death Note indeed has a fantastic setup, but quickly declines and people tend to overlook the major flaws this show has. \n\r\nThe cat and mouse game of Light and L works pretty well and is very entertaining, but the author reached the peak just way too fast. Instaead making the show 12 episodes, it is 37 episodes long. He solves this p",
    "\n                Prior to Death Note I stuck to watching anime that had some form of romance in it, but when I saw how great the animation in Death Note was I jut had to check it out. It completely changed the way I felt about supernatural/psychologial anime. It made me realize how enjoyabl other genres could be.\n\r\nStory: Death Note has such a great and unique story to it. With the arrival of a death note that came from the Shinigami. The person with the death note can kill anyone just by writting down thei",
    "\n                Death Note was one of the first anime series I've ever watched before and is the one that got me into anime, and making it my favorite anime ever. The story is great, Light Yagami,is a teenager that wants to change the world through a notebook by eradicating the world of crime, has a god complex and is an absolute justice type of character, (Like Akainu from One Piece) and is known to the world as Kira. L, a detective considered to be the world's greatest tries to prevent him from killing a",
    "\n                Ah yes, Death Note. One of the few anime that I could understand that hyped. The popularity of this anime is not surprising, although I consider it's quality below that of the manga, which in many respects is better then the anime.\n\r\nWhat does surprise my about the popularity of this anime is the willingness and the amount of people that throw themselves over it, and the readiness to call this the best anime ever made.\r\nI'll agree that this is one of the better anime of recent years, and it",
    "\n                Well, you got to admit that Death Note has a special suspense in the atmosphere. Basically it goes about 2 geniuses who try to find each other. One has the power to kill, other one has the entire police at his side.\n\r\nStory:\r\nThe story is alright, you will not get bored because of this, because every episode will be mind bugling. Every strategy both geniuses take took a lot of time for any normal person to come up with, and they just do it like it took them 5 minutes.\n\r\nAnimation:\r\nPretty g",
    "\n                Spoilers ahead. If you want an anime filled with mystery, tension as well as mind evoking moments just like myself, this is perfect for you. Death Note is a compelling, well written and unique story able to combine story, art, music and characters to create a masterpiece like no other before.\r\nStory-10/10\r\nA truly outstanding story. Thrilling enough to have me off the edge of my seat at times. The interaction between the main cast, the dialogue and a considerable amount of plot twists was w",
    "\n                I've delayed this review for a long, long time. Such a long time, I dropped it off my favourites and the grade dropped from 10 to 9. Maybe it will drop from 9 to 5. You ask why, and I answer-hands down, the ending was terrible. Unsuprisingly, looking up my favourite characters shouldn't suprise you. Yet I thought Air had a great ending. That ending made me love the show even more, same goes for School Days. This?\n\r\nWhen I first heard of Death Note, I couldn't give a rat's ass about it. The ",
    "\n                When I first watched Death Note, I was like \"OMG! This is the best anime ever!\" and I still think it is. But every anime has its downfall. In case of Death Note, it's the second half of the story.The first half was so ridiculously good, that I just couldn't give the show a bad score. But, the second is becoming nonsense and not really brilliant anymore.\n\r\n~~~~\r\nStory\r\nThe story is very well thought. I mean, it's very smart, entertaining and it makes you addicted to Death Note at first view.",
    "\n                First review ever so spare me ^-^ [Everything that sounds spoilerish is in the first episode]\n\n\r\nDeath Note is among the 'godly' realm of anime, right up there with Full Metal Alchemist, Steins;Gate, HunterXHunter and Gintama. \r\nThe thing that separates Death Note from the others is 100%; \n\n\r\nThe Story.[10]\r\nThe story, holy hell man, this is one of the only anime that makes a plot twist, hides it, and lets YOU discover it on your own. This story makes you question your own beliefs and can c",
    "\n                In today's society, it's so difficult to find innovative, challenging and stimulating material that is also enjoyable. Death Note hits the nail on the head with it's highly appealing, informative, and complex storyline. It is truly unique in concept, and indisputably my favourite anime. Ever.\n\r\nI could certainly spout praise for the series all day, not to say it's ultimately perfect. \r\nObviously the supernatural subject matter throws reason out the window, but an element of realism is lost.",
    "\n                Though the animation occasionally veers into Bad Drawing Land, and all the sitting around (close up, pan, rinse, repeat) and yadda yaddaing can get very old on the eyes, the mental aspect of the anime is certainly up to par. If you can get over the anime and sound aspects, and don't crave explosions every other episode, this series could very well be a good choice. I certainly recommend it to anyone who enjoys following a good mind game or two. \rCharacter-wise, it's pretty neat knowing that",
    "\n                The story is fantastic. There are flaws in the logic, but they aren't glaring enough to detract from suspension of disbelief or overall enjoyment. \n\r\nThe first arc (episodes 1 - 26) is the best, it does a great job setting up the rules, and hooking the viewer. The plans, plots, and mind games are all brilliant. They did an excellent job executing the scenes, character reactions, etc. Everything felt natural.\n\r\nHowever, the second arc (27 - 37) was not as good. The most glaring issue, in par",
    "\n                (contains spoilers, read at your own risk.  YOU have been warned)\n\r\nThis review is strictly reserved for the critique of the second half of the show.  Most of us will agree the first half is basically flawless, so why concentrate your time dissecting something perfect?  Especially since  you can write a lot more based on the unbalanced second half.  \n\r\nI do admit that the second half isn't nearly as well done as the first half, mostly because they obviously shoe horned a convenient plot twi",
    "\n                Eh, no ones going to read this because theres already millions of reviews of Death Note.\n\r\nAnyway, this has GOT to be in my top 10 (or 20) list of best anime EVER mainly because it was my first ever gateway anime. Also because I found the story to be completely ground-breaking compared to anything I had ever seen before. I literally felt like a caveman discovering fire for the first time.\r\nThe plot, the suspense, the excitement, the thrill...oh yeah, this anime is truly a binge watcher's ga",
    "\n                This may not be my first review, but this is my favorite. Why? Well because it is my favorite anime series of all time. Death Note is a beautiful blood bath of death and suspense. This anime has kept me a fan since I started watching till I burned out on it 3 years later, and it only took a week away before I was back watching the epic tug-of-war storyline that keeps twisting and pulling you back in. This anime is the best suspense anime I have ever seen. The characters are so well made tha",
    "\n                Death Note is by far the best anime I'v seen.  The story line is simply superb.  Characters are very well developed and their Voice acting is so good that you can feel their emotions.  The animation, sound and music are all at their best.   This anime has some of the best moments I've ever seen. Episode 25 (you know), episode 36 and a lot more.  \r\nThe story is a game. It is a battle of two great minds.  Light, the criminal and L, a very well known detective.  Light gets his hands on a Shini",
    "\n                This was my first anime I have ever watched and was an amazing introduction anime for me. I am now abit more familiar with anime now but this is probably still my favourite one.\n\r\nSound/Soundtrack: I have always said that if you do not notice the background music in a film then the soundtrack is doing its job. Not once was I distracted by the soundtrack,it fits in very well with the whole theme of the anime. As a big fan of the band Maximum The Hormone I can say I really appreciated the ope",
    "\n                \"Death Note\" is simply one of the best anime series from the recent years, having an outstanding animation, very interesting characters and a magnificent plot, filled with many unpredictable and surprising plot twists, keeping a high level of tension from the beginning until the ending of the story.\r\nThe main premise of this series was pretty attractive and very well developed, making a great use of some supernatural elements in a realistic context.\r\nThe motivations and psychology of the ch",
    "\n                I have just rewatched this Anime recently and have seen it a total of three times and every time I watch it the more I love it!\n\r\nThe storyline was very interesting and the characters were very well thought out. Light and L in particular were two of the best characters that I have probably come across in Anime.\n\r\nAlthough, a small point I also really liked the music that came with the Anime.\n\r\nOverall, it was a decent dark Anime with outstanding characters and a decent plotline, however I w",
    "\n                I know this is one of the anime “greats” but I’m giving it a low score because the writing of the female characters is just… so, so bad. The show runners generally are obviously wildly misogynist, which shows up most clearly in all the close-ups of cleavage and ass-cracks, but in what is easily the laziest writing I’ve seen in any \"well-regarded\" anime, every single female character of note is given the sole motivation of attachment to a man. Misa, Kiyomi, Naomi… the entire reason they exis",
    "\n                A never before seen, amazing anime. Truly a masterpiece. What can I say - the best and most honest thing that I can do for this anime is to give it a perfect score. And to write a fantastic review (as fantastic as I can). I mean, the story is unbelievable, like nothing you have ever imagined. It takes us to a place where anything can happen. The plot twists change every time and keep us hooked from the first minute. The art is so swift and smooth and has great quality of expressions that ha",
    "\n                Death Note is on of my personal favorite. The first time when I heard Death Note I was with a friend, but she didn't explained the story very well to me so I was confused. But then I gave it a shot and I loved it. When I got the real idea of Death Note I was minded blowed. I love this anime so much.\n\r\n~STORY~\r\nThe story was well planned and very unique. I liked everything. The only problem I had was the parts when a few people started talking about political stuff which bored me. But I know",
    "\n                Death Note is one of those anime's where your on the bad guy's side or anti- hero's side throughout the whole show and everything the protagonist does just blows your mind and leaves you hungry wanting more of Death Note.\n\r\nThe Main character Light Yagami is one of my favourite characters in any anime and he shows why with his intelligence and his ability to have things go his way. (Like Lelouch without the geass)\n\r\nThe art style is dark and fits perfectly with the whole dark thriller atmos",
    "\n                Death Note is perhaps one of the most popular anime ever created. It holds the top place right now on this website as the most popular show. For a large number of people, Death Note was the gateway series that led to them becoming a fan of anime. Generally, the only people who watch anime and have not seen Death Note yet are people who just haven't got around to watching it. So the question is, what makes this series so special, if can indeed be considered special at all?\n\r\nThe premise is p",
    "\n                Okay, I'll try this again. The last time my review got deleted but I will try it again this time. Leave a comment if you know WHY I like this anime. ;)\n\r\nStory 10/10\n\r\nDeath Note is a fun anime, that's one thing for sure. I liked the plot a lot, just because the idea that such a notebook would excist, is awesome as hell. The pace was perfectly done as well, and every episode ended just where it should end.\n\r\nArt 9/10\n\r\nThe most of the characters have a great design that fits them well. The ",
    "\n                I found Death Note to be of exceptional quality, both in animation and in it's content from beginning to end, and when I say &quot;end&quot; I'm referring to episode 25. As far as I'm concerned, episodes 26 through 37 simply aren't relevant, especially when said episodes only serve to either dumb down the premise or even perhaps the viewer with a sort of &quot;shock and awe, look at me and my overly predictable plot twists!&quot; It also doesn't help that the most interesting and intelligen",
    "\n                Okay, Death Note is my favorite anime of all time, and there are a few reasons why:\n\r\n1. Story: The storyline was amazing, although it did have its flaws in ways. The idea of the battle of geniuses with the introduction of the supernatural was brilliant in concept and portrayal. Each of the characters are well-developed (even L, despite his mysterious character). Although I did still rate it a 10, the story had some major pitfalls in my opinion. First, the whole mystery concept of the anime",
    "\n                Death Note is a brilliant anime. Not only is the story an interesting concept, the way the plot plays out and unravels is perfectly executed. But since the plot is ridiculously easy to spoil and has nothing wrong with it, I'm just going to say \"It is mind-bogglingly amazing,\" and then move on.\n\r\nThe characters are perfect (Perfect for the plot. Don't worry, they've got flaws), just like everything else in this anime. They never do anything that seems wrong for their personality, and they ar",
    "\n                My first anime, and a very good series overall. Between the character development, story in general, music and constant cliff-hangers, \"Death Note\" is definitely a series to watch, in my opinion.\n\r\nWhile I personally felt that the story lagged after the death of a certain character, the story somewhat picked itself back up after. They were missed, but their death wasn't in vain -- there was a legitimate reason behind it.\n\r\nThe art and attention to detail in the series is excellent. Although",
    "\n                Where to even begin with this anime..\n\r\nDeath Note is by far one of the most well known and loved shows in the entire anime community, and there isn't many people that would disagree with that statement. The series gets you hooked from the very beginning, which is something that, surprisingly, not a lot of anime (in my opinion) can do.\n\r\nFirst of all, the two main protagonists in Death Note are by far the best characterized and well made characters ever made in anime, EVER. Two geniuses, on",
    "\n                Before reading this, I would want to let you know I'm not an English native speaker, so you may find some mistakes in this review. If you do, please let me know.\n\r\nSTORY: 9\r\nDeath Note has a really good plot base. You write people's name on a notebook, they die. Easy. The story goes on perfectly. It has is amount of drama, though you sometimes giggle. It will always keep you watching. Until here, it deserves a 10. But there is a failiure in here: The last 12 episodes. From chapter 25 to alm",
    "\n                death note is one of the most popular anime in the main stream anime list and generally it is the 1st anime you recommend to your friends to enter into the anime  world. BUT i feel like this anime is bit overrated i mean its good for starters but it will not as good for a regular. \n\r\nstory(6)\r\nnot much special there in the story still its pretty decent . I feels like there just more fancy things which might entertain you like some thrilling moments and feud between L and Light is really ent",
    "\n                Why did I give 7 to Death note and placed it under my favorite anime?\r\nSimple...\n\r\nepisodes 1-25 = rate 10, episode 25-37 = rate 6, average = 8, but due to extreme rate failure, extremely boring and unimaginative episode, it doesn't deserve 8.\r\nTherefore, its 7.\n\r\nStory\n\r\nIts great, really. Anyone watching this anime can clearly see it has one great story with lots of upsets and wonderfully made events. Its never boring to watch it, because something happens all the time. And episodes 5-24,",
    "\n                Intensity. Psychological. Ultimate anxiety forth-bringer. \n\r\nAN EXTREME GAME OF CAT AND MOUSE. \n\r\n      That basically sums up the masterpiece which is death note. I was drawn to this anime initially, due to it's IMMENSE popularity. And let me say this now, it certainly lives up to it's reputation. \n\r\n      First off, the story begins in a very intriguing way, which captures the audience's attention, immediately. The use of a mixture of divine intervention and attractive art, which is the b",
    "\n                Well Well Well .. Death Note ! Even my friends that don´t watch anime already heard this name somewhere ... it one of the most known animes out there .. for good reasons but also bad ones :D. (For who saw knows what i'm talking about). \n\r\nI don´t want to extend this, so i will make a short review and try to say everything that there is to say. \n\r\nStory: (9/10). Nice plot, consistent, solid, fluent. It is simple, but at the same time it is complex due to development attached to it. The plot ",
    "\n                If you had the ability to kill those that have done wrong, would you?\n\r\nThis story isn't some story based on moral judgment or ethics. Rather, it's a battle between two ideas. Is it right to kill evildoers? Or is it generally incorrect to kill people? Regardless, this show is one that you should watch, as it enters a psychological battle between \"Good\" and \"Evil.\" But which is which?\n\r\n---\n\r\nStory (10/10)\n\r\nGreat plot and delivery is really good.\n\n\n\nArt and Sound (8/10)\n\r\nBoth are quite ave",
    "\n                This will be my first review so I'll kept it simple and as straightforward as possible. Death Note was my first anime, and having watched it about five months ago, I'm very happy to review it here on MAL. I'll start by making a general evaluation/rating of every element that composes the anime - Story, Art, Sound, Character, Enjoyment, finishing with an overall appreciation. \n\r\nStory - This is clearly a 9, intriguing and complex plot full of twists, bonus points if you like criminal and pol",
    "\n                In my opinion, Death Note was an extremely good anime; I feel that the characters were developed very well and the story was easy to get a grasp of. While this itself makes for an engaging plot, what really makes Death Note one of the top series are the characters who cause an obstruction to Light's mission to rid all evil. Topping off the cast is the fan favorite L, whose character is just indescribable. A mysterious but somewhat successful genius, L is probably the only mind that could ma",
    "\n                Story:\r\nOk I will say right now, this anime has one of the most griping stories I have seen in a long time.  Right from the start, the strikingly original plot sucks you in, to deliver a very satisfying story that will keep the viewer hooked from the start. Why is the story lower than everything else?  Well, lets just say the story kinda takes a turn for the worst about 2/3 of the way through, but pulls through in the end, delivering one of the most epic endings to anything I have ever seen",
    "\n                Death Note is one of the best animes every, many of anime fans have heard it or seen it. It is just great, the story is so smart and fun to watch, the first 10 episodes are some of the best i have ever seen!!!! they are just fantastic. Light who is the main character becomes a God, he finds the Death Note and can write any persons name in it and that person will die for any reason he wishes them to, L the other main characers is also great. Its hard to explain the plot because every episode",
    "\n                This Anime is by far one of the best I have seen. Amazing story, and for the most part it stays close to the original storyline in the Manga. What I also love about this Anime is there is no antagonist or protagonist. There's no set 'good guy' or 'bad guy'. It's like you, the viewer, get to choose who's side you want to take. \n\r\nJust like with sports. Here a lot of people say 'Cubs or Sox?' well for me it's 'Kira or L?'\n\r\nThe story kept me interested and if I ever missed an episode of Death",
    "\n                *This is a spoilerfree review*\n\r\nDeath Note is one of the absolute best thriller/suspense anime I have watched to date.\r\nThe story is so well written that you will never be able to stay a step ahead which is often possible in less thought out plots, and as you think you know what the next move will be, it will take you somewhere completely different and keep you on the edge of your seat.\r\nAs for the characters the only thing I can say is that they truly are amazingly balanced and so, oh so ",
    "\n                Well, here it is, the all-famed Death Note. I have to say, I figured since so many people love it, it can't be bad. Boy, was I wrong. Death Note has an incredibly mediocre plot for what it set out to do. The story, as we all know, is about the discovery of the Death Note that can kill those whose names are written in it. Original? Somewhat. Well-executed? Hardly. The art and the sound were really good, which is a shame that they seemed to make it pretty and ran out of focus and funding for ",
    "\n                     Many anime fans consider Death Note to be one of the best anime of all time. I am not one of those fans. I feel that while Death Note is a good show, it has some very glaring issues. I have no problem with the people who love this show, but I am simply going to cast my opinion into the mix. I will try not to spoil the show too much, but I will have to divulge a few plot points of varying importance to get my point across. These spoilers will mainly occur within the story and character\n",
    "\n                Lion Tamers, I got a whole lot of stuff to say about \"Death Note\".\n\r\nUnfortunately, for the folks who actually liked this anime, I disliked it to the point of dropping it at episode 8. I realize this is usually a no-no; but there is no way I'm going to sit through drivel for 15 hours, after hating it for 3 hours already.\n\r\nFirst I want to talk about the stuff that was actually quite good.\n\r\nThe dialog is written well, and performed above average.\r\nAnd the artwork is above average.\r\nMost of ",
    "\n                *Anime (Dub) Review* \n\r\nI quite enjoyed Death Note. \n\r\nThe story was told well, although paced a bit slow at the beginning. The episodes were a bit complex though, there's a lot of internal monologue and a lot of thinking involved. The plot was pretty unique, and I found each episode fulfilling, and almost no filler episodes occurred. One thing I liked about this series is there really was no romance or fanservice. I find many anime could do without romance and fanservice, but don't get me ",
    "\n                I can safely say that death note is one of the best anime of all time and there will be hardly any anime that will ever rival it. \n\r\nThe story enraptures the viewer from the start till the end. I have never seen a plot that is this exciting and damning ever. The story is well thought out with a pace that is not that fast that it makes the viewers doubt and not that slow that it makes it boring. It is just perfect.\n\r\nThe best thing about this anime is that without you even knowing, it makes ",
    "\n                Death Note features a deeply engrossing plot which comes across largely as an isolated battle of ideologies. What starts off as a suppressed story of a school-boy elevates to a battle of epic proportions with your tension verging on the overbearing. As the series progresses, it slowly loses the great momentum with which it rose and settles for a beautiful yet modest climax. Death Note is a celebration of the human spirit which deserved well more than the climax it has - however, it will con",
    "\n                Death Note is propably one of the best anime series.\r\nActually it should be the best one.Netherless, the unnecessary second half destroy it. Therefore I'm goning to rate the anime in two part(1-25)(26-36)\r\nFrom the first part,I can tell that the story is unique and the characters is well-developed. I think after watching this ,everyone can tell that it is a masterpiece.10 marks for the story, 8 marks for the art,8 marks for the sound,10 marks for the characters, and 10 marks for my enjoymen",
    "\n                First of all, this anime is A MASTERPIECE (based of the first 26 episodes), because I love it so much I just make myself believe there are only 26 episodes. (and i'll tell you why at the very bottom)\n\r\nNow to the anime itself. The reason why it is such a masterpiece lies in its story, character development, and pace. \r\nThe story might seem like déjà vu, but there not out there that comes anywhere near it (Believe me i checked). Many animes try to include the supernatural (ghost hunt), myste",
    "\n                You like brilliant plans? You like plot twists? Many times shows will have one, which is pretty much the serving size for the entire series for the main plot. Not Death Note. Death Note has a huge supply of brilliant schemes and they're thrown at you every episode. They do not skimp in this area!\n\r\nWhat can I say, whenever i talk about epic animes or someone asks me my favorite, \"Death Note\" is always at the tip of my tongue. Now I am aware its shortcomings in a couple of points, but I real",
    "\n                An anime that over-stayed its welcome.\n\r\nI was interested in Death Note when the manga was first being translated into english, and when I heard it was becoming an anime, I was excited, since I don't particularly enjoy reading manga.\n\r\nThe anime starts of pretty well, but it got old fast. The characters are about as interesting and well defined as anime characters get... but they don't seem to have much development in relation to the story. The interesting philosophical questions never chan",
    "\n                Death Note is beyond popular and I knew that eventually I would watch it because of its popularity. I was actually planning on watching other anime before Death Note then I got a message on my profile asking me about watching Death Note so I said screw it I’m watching it now. My oh my, what a good choice that was for me, hell of a show.\n\r\nStory- I rated this a 9 when probably everyone would rate the story a 10. Not to spoil anything but the only reason this was not a 10 is because I would w",
    "\n                I liked Death Note becuase it's a ride all the up to the end. The exposition offers the viewer a great understanding of who the characters are, but leaves just enough that you are hooked into watching just to find out who these people are. Probably the most exhilarating parts are the plot twists that keep the viewer on their toes. The art style is perfect for this anime, it fits the overall feel of the story. The music of Death Note is just right for almost every scene. Overall, this anime ",
    "\n                This would be an interesting concept if the writing was not so bad.\n\r\nThe series portrays both main characters...\r\nScratch that, the series shoves down our throats how much geniuses the driving forces of the plot are which can be unpleasant by itself. But all the nonsensical decisions they take that are portrayed as mastermind moves. Every possible plot twist is in universe received with a \"HA! I know it would happen cause I already read the script!\" used non-sarcastically in character.\n\r\nA",
    "\n                When I finished reading the manga of the same name, I had mixed feelings about it; the story was different and definitely thrilling, the art beautiful, but the story progressed slowly.\n\r\nThe anime fixed any problems regarding that.\n\r\nThere is nothing new to the story, compared to manga. The story remains the same, although there are some small pieces missing. A notebook falls from the shinigami world, picked up by Light Yagami - a bored, intelligent young man who seizes this opportunity wit",
    "\n                One of the only pieces of work which i would wholeheartedly agree that the anime is a greater masterpiece to the manga *not to downplay the manga by any means* Madhouse outdone there self with this one.\n\r\n Art: 8\r\n      I'll keep this one short and sweet \"Madhouse Is Love, Madhouse Is Life.\"\r\nThis not to say it couldn't have been better, but since the manga doesn't have big fat anime battles it's more of a psychological, mental struggle there really wasn't much to animate. \r\n       \"I'll ta",
    "\n                This was one of the first anime that I watched. I didn't know what to expect but after a couple of episodes I was hooked. What worked for me was the genius the lead character possessed and their pursuit to achieve their goal. There are many unexpected twists and the thrill of what's gonna happen next was high. This series also raises a question over good results driven from immoral deeds and how power can mess you up; I spent much time deciding which character I wanted to succeed, but I wil",
    "\n                Death Note is simply one of the best anime series I have ever seen, having an outstanding animation, very interesting and developed characters as well as a magnificent plot, filled with many unpredictable and surprising plot twists, keeping a high level of tension from the beginning until the ending of the story. The main premise of this series was pretty attractive and very well developed, making a great use of some supernatural elements in a realistic context. The motivations and psycholo",
    "\n                Konnichiwa, my fellow anime lovers!\n\r\nToday I will be doing a review for the highly praised psychological/police thriller namely - Death Note.\n\r\nSTORY : 8\n\r\nDeath Note starts off fairly sluggish as the plot is quite complicated and needs to explain to the viewer of the rules that apply during the remainder of the series. This can be a bit daunting at first, but this allows the viewer to shape creative ideas, as if you were in the shoes of the protagonist himself. This is also beneficial whe",
    "\n                Death Note was the first shonen series I ever watched, and it is not an overstatement to say that even though I have watched many others, this one still tops my list.  Its definately my favorite.  Almost everything about this anime is perfect- the characters, the plot, the mystery and the extremely interesting cat-and-mouse chase between main characters L and Light.  Both L and Light are extremely intelligent and the plans they come up with devised to catch the other are genius and highly i",
    "\n                Story:\r\nIt is very welldone, the pacing is nice, since it is almost the same as the manga (in actuality, a light novel) that has perfect pacing. It is very suspenseful and clever, with excellent use of cliffhangers. Is is a battle of wits between Light and L (and some others latter on), that really differs from your usual shounen. It is nice to say, too, that Light is totally and completely the villain, and an excellent, sadistic, maniacal, bad person villain. And yet he's the main characte",
    "\n                Power. Be it in the form of wealth, influence or any other, we all know that it can change the people who have it. We are quick to call the rich, the politicians and many others corrupted when they abuse their power. And we often say that it should be us that had it, that we would be able to use it for the greater good and for that only.\n\r\nThe truth is... we never know how corruptive power can be, until we have it in our hands. And, even if we don't realise our corruption, it shows to the o",
    "\n                A very nice cartoon this one was. Deaf Newt is a super interesting character study that teaches us how ultimate power corrupts ultimately. But ultimately we already knew this so I don't care about that too much. Hitler already taught that lesson to us so I think we are tired of it.\n\r\nWhere Death Grips excels is the fantastic cat and mouse game it portrays. Comparable to classics such a Tom and Jerry, this show has a genius display of two geniuses chasing each other down. L and Light are ver",
    "\n                Anime ratings are based on the parameters of Story, Art, Sound, Character, Enjoyment and Overall. While I've given Death Note near perfect scores in the first 4 categories, the last two categories contain a score of 8/10. People who have already seen and even written reviews about it can probably guess why. \n\r\nI've finished the show recently (yesterday), and I can say without hesitation that the Good and Bad about this show can be split right down the middle of the episode list. Before I ge",
    "\n                Ah...Death Note. Where do I begin?\n\r\n Death Note, as you'll hear by most who have seen the series, is greatly known as one of the best anime series out there, and possibly of all time, and it certainly earns such a title. \n\r\nWhy might you ask? One could argue it's because of it's astonishing artwork, others may say it's because of it's amazing soundtrack. All are true of course, but the reason why Death Note has the reputation it does, is because of it's amazing story ark. Death Note is ess",
    "\n                 MASSIVE SPOILERS:i watched this show with high expectations, and came out severely dissapointed. While this show isn't appalling, it definitively isn't what the fans deem it to be. So So So many flaws and problems that are overlooked by critics that I am finding it hard to figure out where to begin. Lets start with positives. The animation and sounds are mediocre. Alright thats the positives out of the way, now I am about to offend every stupid die hard fan of this overrated show.\n\n\r\nCHARA",
    "\n                A good not great anime that I would still recommend as both a satisfying series for anime-veterans and also as a decent entry-level anime for those starting their journey in the world of Japanese animation. Personally I would recommend just watching the first 25 episodes and then stopping.\n\r\nIt has an interesting plot hook and, for the most part, achieves a good balance between letting the characters and their actions/choices breathe and not drag down the action. There are some very interes",
    "\n                Death Note is one of my favorite anime, and for good reason. The Story is very interesting and it really shows how someone as innocent as Light can get turned into a psychopath with the power he had. The story also lead me to think who would win, Kira or the police. The animation in this anime is really nice. Very dark coloring that sets the mood it's trying to set. The music in this anime are good, each piece feels in place. The voice acting is really good, My favorite being the voice of L",
    "\n                Death Note. This anime initially got onto my radar when it came to my attention that it was considered one of the best anime of all time. The premise sounded interesting. A high school student picks up a notebook that allows him to kill anyone he wants just by writing their name into it. It intrigued me, since I initially couldn't fathom how that could become a highly adored story. So I dived in and didn't regret it.\n\r\nThe first thing that immediately stands out is the artwork and the anima",
    "\n                This anime is one of the few that I would rate with a 10. The story is great and the anime itself gets you to think what will happen next. It keeps the suspense going most of the time, and the constant battle between a delusional teen/adult mastermind who thinks he is \"God\" and who effectively manages to slip away from suspicion that he is the killer behind all the recent murder activity and yet another mastermind along with the help of the police task force, that try to uncover the real id",
    "\n                Wow, after finishing this show I can say without a doubt that this anime is and will continue to be one of the best anime of all time. Death Note plants multiple different emotions into your head and leaves you completely aghast by the end of it. I personally experienced many different feelings varying from, excitement, intensity, amazement, shock, sadness, pity and countless others. Although the story seems to have a pretty dull plot, Tsugumi Ohba and Takeshi Obata (creators of Death Note)",
    "\n                What would you do if you had a Death Note? What if somebody just started murdering every single criminal out there? These are the questions Death Note answers, or more accurately, lets you answer for yourself. Death Note is amazing.  I don't even know where to start. The art is fantastic, I love it. Character models are quite detailed and animation is pretty good. I can't stop listening to the soundtrack. The songs are varied and the only song that was out of place was the second opening, w",
    "\n                The most popular anime of all time for a reason.\n\r\nA masterpiece in terms of story, plot, and character development, side by side with incredible OPs and EDs makes for a perfect, all-rounder (albeit with a few 'ridiculous' moments, but those are to be expected of every anime, as they are, after all, fiction.)\n\r\nLight Yagami is the protagonist of our story who happens upon a weapon of mass murder, and uses it to make himself God, creating a 'new world' full of only good people, ironically, l",
    "\n                In my opinion, Death Note is an anime every anime lover should watch or at least try watching at one point. I’ll try to make this straight to the point and not too long, if it’s still too long just go ahead and skip to the conclusion, haha. \n\r\nSTORY: 7\r\nThe plot is very easy to understand and follow, from the very start of the anime. Not only that, it’ll keep you wanting more. At the end of each episode, I found myself continuously clicking the next episode and then the next, and then the n",
    "\n                This is a great \"starter\" anime. Trying to get your best friend, SO, or whatever into anime? This is usually a no-brainer go to. It's got good characters and good development, all at a nice pace. I've watched the series from start to end probably 4 or 5 times. You get attached to both sides of the story, good and bad - and may even have your own interpretation of which side is which! A great thinking show. About halfway through the show, you can see it start to get a bit rushed though. When",
    "\n                Story:\r\nThe story is amazing, I love how it's posed as 'the perfect crime' and I love the main protagonist's development throughout the series. When you watch the first episode, you don't know what to expect, But once Light is given the Death Note and meets Ryuk things start to get interesting. The story is great, there are tons of twists and turns especially a twist almost EVERY EPISODE.\r\nBut the only thing I can complain about the story is the 'Yotsuba arc' and the ending.\n\r\nArt:\r\nThe art",
    "\n                For being the most popular show here on MAL and other surveys. Not only has everyone and their mother seen this show... most people rate it an 8-10 and put it in their top 5 list. Needless to say my expectations were high for this show, for all I knew this show was going to be the best anime I have ever seen. However, to my disappointment, it was not. \n\r\nLets start on the things that I enjoyed. For a show made in 06/07 I thought the animation was pretty good, and being how it was my first t",
    "\n                If your the type of person who enjoys an Anime that requires you to use the last cell in your brain to figure the story out, well this is for you. The story completely hooks you in as soon as the main narrative begins. It's about a teenage student who urges to cleanse the world from it's filth, and another person trying his best to stop him. \n\r\nNow if you prefer the use of swords and choreography, you will be disappointed. Because the battles in this Anime uses their brain to the extent tha",
    "\n                The character development in this anime is great, the concept is interesting, there are plot twists that you may or may not see coming (I personally didn't see many of them coming, but then again I'm not very good at that type of thing ^_^;), and the ending is...well, the jury's still out on that whole thing. I personally favor the manga ending over the anime ending; then again, I feel that the anime should have been drawn to a close somewhere after &quot;you know what&quot; happens instead",
    "\n                It's a recent and discussed anime, so i would like to give it a try and do the best i can to make this an helpful review.\r\nI'd like to go little by little, taking every aspect and analyzing it:\n\r\nSTORY: Great screenplay, no doubt about it. The original autor of the manga, Tsugumi Ohba, has done an excellent work by using all her ideas, combining altogether and making a story considered one of the most innovative. BUT (there is a quite big but) from a certain point of the anime, the story co",
    "\n                Death Note is a classic. You have not seen anime if you haven't seen Death Note, in my humble opinion. The characters and story have long ago become iconic and there are thousands of fans even today. \n\r\nThe plot is very unique, the characters, though sometimes slightly unbelievable, are strangely relatable. Light himself is the manifestation of the thoughts everyone has had at least once. He is what anyone would be without moral principles; then again, so is L. Their polar opposition and at",
    "\n                Death Note is amazing. It has it's ups and downs but it is an amazing anime. \n\r\nThe story is amazing. It's really interesting and enjoyable. And it's kind of hard to tell who the real villain is. Is it Light, because he's using the Death Note to kill people? Or is is L because he's trying to put a stop to Light? It's hard to decide! \n\r\nThe art for Death Note is really nice, the backgrounds are mainly dark, grey and dreary. It suits the anime perfectly. The characters on the other hand, it d",
    "\n                Yeah, another 10 for Death Note, but its gotta be one of the only animes out there that people cant argue the score.\r\nThe Story is very compelling and after a few episodes you are absolutely hooked on the story, and will find yourself unable to stop watching until you are eventually done with the show. Story follows the lives of various people who recieve an item by the name of a \"death note\" which is a notebook that will kill anyone whos name is written inside. \r\nThere are 2 main character",
    "\n                Deathnote is a great series, It is really thought out and you should watch it.\r\nThe story line is great, it is the main reason you should watch it.If you like an anime that makes you THINK, then you must watch this, I ended up watching 1 episode due to being recomended to watch it by a college friend, I literally sat and watched all episodes in one sitting, I was totally hooked from the first episode.\r\nNow about characterisation..\r\nThe characters all rock, have their own personalities which",
    "\n                I loved this anime. At first thought, it was stupid. A highschool boy with a notebook that kills? Didn't sound very good. After a while, I got curious. It turned out to be one of the best animes I've seen. \n\r\nStory: The story was amazing. It keeps you guessing until the end. You would think it  would get boring, Light just killing people. But there's always a new twist. \n\r\nArt: The characters were drawn so intricately and yet so simply. I love the faces and bodies. They don't look like they",
    "\n                Death Note is a top notch anime. Like a symphony masterpiece, it drags you in slowly without ever letting go, increasing the pace through ingenious actions the characters take til the grand finale where it culminates.\n\r\nTo start with, I think it looked pretty awesome. Admittedly, there were fluctuations in the character animation/drawing at certain points, but those weren't that often and when done right, the visuals are great; the death gods, character expressions and action sequences are ",
    "\n                Death Note is a complete masterpiece. All the way through. Some of the people out there say only episode 1-25 are the good ones. (Insert spoiler here) After that, people begin to lose interest in the show. But, I am one of those people who went all the way through the anime, and never lost interest.\n\r\nWhy do I think Death Note is so good?\n\r\nDeath Note has an incredible story to begin with. I'm not going to explain the story, considering you should already know it. The soundtrack in Death No",
    "\n                I started off really liking the anime, with the cognitive back and forth between Light and L being the highlight. The rules of the Death Note serve as a game constraint pretty much like an elaborate game of Mafia. But when Light somehow loses his advantage of being invisible from investigation and became the most likely suspect, the anime starts to lose its charm. L's infinite resources, including technology, authority (to imprison without trial and whatnot) and manpower. \n\r\nThe second port",
    "\n                Death Note is a rather enjoyable show, but the second arc wasn't as good. The ending was also rather lack-luster. \n\r\nThe characters were good, and I though I disliked Light Yagami as a person, his character was incredible. The one character I couldn't stand was Soichiro Yagami. I just disliked him. I also disliked Near and Misa.\n\r\nThe animation and sound were good, but the sound is not my style. The openings were fairly good.  On the sub vs dub argument, I say dub, it is incredibly casted. ",
    "\n                Death Note : A unique story blended with some excellent screenplay makes in one of the best anime, for me, as a first time anime watcher.\n\r\nStory is compelling and worth praising. The way the characters are linked, explained and connected is what, makes Death Note an unforgettable memory. Believe it or not, once you start watching it, there is no stopping. \n\r\nStory picks up pace like F1er, but few episodes after L's obvious fate, looks like a drag or more of a filler episode. But apart from",
    "\n                i watched this anime as a 11 year old kid...now that i think about it i was stupid to think that this anime can be a good one for me as a little kid :D\r\nlet me tell you that this anime is not interesting for kids or even some teenagers...if you liked it as a kid or teenager then you are smth else :)\r\ni rewatched it again 3years ago and i loved it...as a grown up i couldn't think of a better story and a better ending for this anime :)\n\r\nstory 10/10 :\r\nthe story is perfect...its everything yo",
    "\n                Death Note is one of the best animes out there.  If you haven't watched it yet, you are missing out on one epic plot and epic set of characters. The conflict is between doing what is right in the right way and doing what is necessary.\n\r\nStory: The story is a masterpiece. The idea of the notebook of Shinigami belonging to a human is terrifying in itself. But, the use to which it can be put is explored quite well by Light(the main character). The 'experiments' carried out to discover all the ",
    "\n                This was the first anime I ever watched, so in no way am I an anime expert considering I still haven't seen enough to consider myself an expert. However, you do not need to be an expert or even an avid anime watcher to appreciate this piece of art. This is a perfect gateway anime, or even for someone who has seen hundreds of anime. The art is great, the opening song (the first version) is amazing, but the most amazing thing are the characters and plot. Each character is so compelling and ha",
    "\n                Death Note is one of the mainstream animes that people who start watching anime will typically try and avoid due to this case, but it is an anime that is mainstream for a reason. Many people have heard of it even if they do not watch anime and many people who don't watch anime have even seen it. For people who do not like anime and typically steer away from it quite often enjoy Death Note due to is fascinating characters and story line.\n\r\nDeath Note has an amazing story line that keeps peop",
    "\n                Death Note is one of the most iconic psychological anime. Though not flawless in any way, it is indeed entertaining to say the least. The characters in this series are either hit or miss. Most of the supporting characters are just like recycled paper, and a little too much time was spent on them, especially when they were usually just tossed away shorty after they received a tiny bit of depth. The art is downgraded from the manga in almost every way. The dark undertone from the manga was co",
    "\n                Death Note is one of the best Animes to ever come upon to..(I am not sure if you see me a little exaggerating)\n\r\nStory 10/10:\r\n        The most important factor in making Death Note a true Anime masterpiece is its story..It's the kind of story that will keep you waiting for more..The results aren't so predictable..The story, all in all, is a great story better than anything I've ever seen..\n\r\nArt 8/10:\r\n         The animation in Death Note has been pretty good..Although it has nothing speci",
    "\n                For starters, this is Death Note.  An anime deemed \"favorite\" by so many fans.  And understandably so.  It has great story components including nothing less than a psychological death match between two compelling characters.\n\r\nThere are a few times when the dialogue is almost laughably dramamtic.  And there are a few leaps of logic made that are questionably outside the deductive abilities of mere humans.  But all is forgiven, at least by most.  The intense story, the interesting characters",
    "\n                Extremely witty plot. One thing that I loved right away was how well-calculated the main protagonist was from the very beginning. This very feeling started reminscensing me of classic detective novels.\n\r\nMusic (OST by Yoshihisa Hirano and Hideki Taniuchi) totally suits the plot and its dark, gloomy, and Satanic blend of uniqueness.\n\r\nFor some, the story's long explanatory dialogues in the beginning might seem a burden. But they're just clearing stuff so bear that.\n\r\nEpisode 1 itself is one ",
    "\n                Death Note/デスノート/Desu Nōto\n\r\nStory (10/10)\n\r\nThis series was the only series that stood out from the rest. It not only create's a sense of wonder and mystery but at the same time it has a psychological impact on the viewer. This is one of the most interesting and intricate stories you can enjoy.\n\r\nArt (9/10)\n\r\nThe art is intriguing yet subtle to the point that it starts to look better than most shows. It has the dark sense yet a bright mood to the way everything is designed and animated.\n\n\n",
    "\n                This anime was pretty good for me, and i think the plot is pretty interesting, the story is really catching and it's unpredictable. My personal favorite thing about this anime are the characters, because to me this characters seem pretty full and have their own personalities they all seem like different characters there's some that are similar but original at their own way. The sound it's good somewhat repetitive but you get that it's a trademark of the anime which makes it even more origin",
    "\n                One of the best anime created, and the best on what I've watched!\r\nThe dark and gothic art & op/ending songs perfectly suits the anime's personality! The background sound effects is also amazing. Unique story. I love the thrilling sensation I felt on every episode. The kind of anime you want to watch in just one day, but because that's impossible you can't get it out of your mind and you'll wish that yesterday will come fast so that you can watch the next episodes. I love the lesson it port",
    "\n                This is one of those titles that everyone and their brother have seen. it’s still one of the top ranked animes according to fans that have voted there. It wasn’t without it’s problems though and so for me to discuss them in more detail I’m going to remind those that haven’t seen this show: Spoilers in the write-up.\n\n\r\nFinal Series Score: 9/10\r\nRewatchablity: low\r\nPros: excellent animation, premise was very orginal and engaging, many great characters, plot took several unexpected turns, L’s ",
    "\n                Everything about this anime exceeds all others. The storyline, the plot, the characters... they're all so original!!! Watch the anime (37 episodes) AND read the manga (12 volumes), doesn't matter which one you read first, they're both just so good! ^.^\n\r\nLight Yagami, 17, is a top-scoring scoring pre-Uni Japanese student, and he's bored out of his mind... until he finds the Death Note, a notebook of death. Anyone who's name is written in the notebook dies, and Light vows to use this power t",
    "\n                This review is hard to write. Since I only care for the story (in general), for me the anime starts off as a 10 and ends as a 4. \n\r\nThe first dozen or so episodes really are the mind war brilliance people had told me about. They are a 10.  However, right around the introduction of a certain blonde character, the show takes a plunge. And it NEVER recovers. On the contrary, it even manages to become less entertaining still after more new characters appear (while others disappear). It stays Ne",
    "\n                Death Note is one hell of a ride, its plot is original and very distinctive. I found myself genuinely committed to it from start to finish. This is a well rounded anime with very minuscule flaws. The plot goes a little like this, a boy genius, Light, stumbles upon a Death Note dropped by Ryuik, a god of death, Light finds an alternative meaning for his encounter with the notebook. Light is convinced he was chosen to receive the notebook and rid the world of evil. Light wanted to be the \"God",
    "\n                Death Note was a really good anime.... at first. The first half of the anime was a fantastic battle of wits and it kept you in suspense wondering who would come out on top. However, after a certain part (don't want to spoil it) the main character became VERY annoying VERY quickly and it got to the point where it was painful to watch. I will give credit to the fact that the music and the art style of the anime was very well done. However, the show started with a high quality story  and ended",
    "\n                Death Note has very devoted and widespread fans, so there are probably already hundreds of reviews about this show already, but because I liked the show so much, I really wanted to write a review for it.\n\r\nStory 10/10: The story of this anime is amazing and truly is well-crafted. Everything is well-thought-out and planned, just as if a master criminal him/herself were writing it! Even some of the slightest details have some sort of significance or role in the plot. The story is suspenseful ",
    "\n                Death Note is one of those anime that become rewatchable as you tend to forget it, toss it aside, watch other stuff, and find yourself dwelling about it in your everyday life in the most random of occasions. This was the case for me. I mean, I loved Death Note when I first watched it. It was one of the most uniquely interesting experiences I've had with any other TV show (but then again it was my first not-on-TV anime I enjoyed) I loved its soundtrack (mostly rock and ambience), and definit",
    "\n                This anime is a classic staple for anyone who wishes to watch something entertaining regardless of the genre, the culture or anime fans or not. It is a must watch for anybody who wants to thrill at the taste of something unique, stimulating and engaging. The sound design is part of the anime's soul and the art style even to this day still one of my favourite. I applaud the director and the artists for doing a superb job maintaining the theme of the show through the colour pallet. The openin",
    "\n\r\nStory\n\r\nThe story is just extraordinary.  You couldn't have imagined a better story subject than this one.  The explanations in this story are developed and described in a way that you can understand easily.  The ideas are just incredible.\n\r\nArt\n\r\nThe art of this anime is excellent.  There is never something that isn't perfectly drawn in the entire anime.\n\r\nSound\n\n\n\r\nThe sound is good.  Not different from most of the anime.\n\r\nCharacters\n\r\nThe characters of this story are so clever.  The main characters a",
    "\n                Story (10/10): the story is quite unique. With the main character- Light Yagami- thinking that he could just change the world by killing all the people who have done wrong in the world and will continue to do wrong. He believes the world will be a better place and he will become the \"god\" of this new world. He is faced with the legendary detective who has solved every case he has attempted and he only works on the cases that no one else can solve. overall the stroyline is excellent and unli",
    "\n                Death Note is an outstanding anime. The ratings it gets are sometimes for the wrong reason. (In my opinion.) The story is great. I love the suspense and the characters and soundtrack play so well in to it. The show is unique, which makes it good, and it's not predictable. The characters are so well done. Especially Light. I love Light, he's very cool and I relate to him a lot. The character development is excellent, which is what makes him so cool. Definitely an anime to see before you die.",
    "\n                *MINOR SPOILERS*\n\r\nThis anime is the epitome of perfect, and honestly i think i could say this is one of, if not, the best anime i've ever seen. It's perfectly portrayed and everything, and everyone, has a story....\n\r\nStarting with the story, it's actually quite simple. A mysterious notebook falls on the grounds of a high school, and Light Yagami happens to pick it up, later to find out of it's power and what it's capable of. Light quickly tries to follow his own plans, different from anyon",
    "\n                *CONTAINS SPOILERS*\n\r\nStory - 10/10\r\nI love how the story progresses throughout the show, from Light finding the Death Note to him becoming a maniac later in the show. He uses the notebook to 'create' a 'new world' in which he will be the god of, in which only criminals will be punished.\n\r\nSound - 9.5/10\r\nDeath Note is one of the anime with one of the best soundtracks in the industry. The soundtrack on Death Note plays a huge part in the Anime. The 'opera-like' music shows Lights God-like a",
    "\n                Hello. This is a very nice anime because you have to be very smart to understand the story. \n\r\nThe main characters in this anime is very sexy and good looking so i like it (so kawaii!). so many smart characters you will feel very smarty smart.\n\r\nVery nice animation (bouncing titties sugoi!!!). I like it when girls fall down and it bounces (especially with senpai uWu)\n\r\nMy favorite character is Light (my onisan, my sugoi sugoi), he is so handsome and smart i love him \n\r\nI liked it. it was ve",
    "\n                Personally, I thought the Death Note story line was perfect and as a manga enthusiast, first and foremost, I found the little add ins and changes a bit disturbing but the anime did attempt to be faithful to the original story which earns this an enjoyment rating a ten. The music, to my belief, was suited. The voice talents matched the character well. The story pacing good. Over all it was a good time spent.\n\r\nStory-wise, the watcher is confronted with the cliche, age-long question \"Does the",
    "\n                I consider Death Note to be on of the best animes ever created, if not the best one.\n\r\nStory: The story is brilliant, with unexpected turn of events, no plot holes (if none). After you finish an episode you'll definitely want to see more. 10/10.\r\nArt: Amazing art. Nothing else I can say. 10/10.\r\nSound: The soundtrack was amazing, especially L's themes. All were created well, to represent each of the main characters. 10/10\r\nCharacters: They were brilliantly created. Their lines were good, th",
    "\n                The first 18 episodes or so consumed my life.  In my opinion, they're flawless.  I found it unpredictable and suspenseful and I couldn't get enough.  The middle arc bored me a bit, and I stopped watching it.  I then proceeded to find a full  plot synopsis online and was blown away with how it wrapped itself up.  I finished the series and I truly wish I hadn't lost faith around the middle.\n\r\nThe main \"protagonist\" is one of my favorite characters of all time.  In fact, a good chunk of the ch",
    "\n                Death Note was a different kind of mystery than what I expected at first. The story's a classic set-up of two genius masterminds locked in a spectacular battle of wits full of intrigues and lies, but told from the point of view of the culprit rather than the investigator, which made the series about seeing the various ways Light tried to keep L from finding out the truth about the Death Note.\n\r\nThe art and sound were decent, but nothing to write home about. However, I felt like the show rea",
    "\n                I heard many things about Death Note. Many call it the best anime ever made. \r\nIs it true? In my opinion yes. But what makes it so perfect?\n\r\nFirst of all some will maybe say that you can not create a perfect anime there will always be some little mistakes. Well this could be true. However i can not really find \"little mistakes\" in this masterpiece. The story is unique, the soundtrack perfectly fits to the anime in almost every scene. Although Death Note also contains fantasy or supernatura",
    "\n                After watching hundreds of animations, I have to say that in my mind, Death Note is a masterpiece indeed. I have watched this animation for around 6 times. If I could, I am willing to forget everything about this animation and enjoy it again. In the following part of the article, I would review this animation from five aspects: story, art, sound, characters, and enjoyment. \n\r\nStory (10/10)\r\nThe most important standard for me to rate an animation or a movie is its story. If a work has a real",
    "\n                It was a good anime, that's about it. \n\r\nI enjoyed my time with the anime, however it felt like the premise of the Death Note could only keep my interests for so long. It overstayed its welcome, and the characters that felt like uninteresting side characters stayed along as uninteresting main characters.  The series should have been shorter and the characters more flushed out. \n\r\nThe music and art worked very well together. Very dramatic, intense, and beautiful to listen/look to/at. It's a ",
    "\n                Death note, simply put, is a masterpiece. \n\r\nTo start off, the plot is incredibly complex and layered. At a surface level, it is a 'cat and mouse' game, between the world's greatest detective, L, and Light Yagami. Both of these characters are extremely intelligent, so the plans they employ are often very entertaining. Many surprising twists and turns also occur quite often. However, this is only a surface-level view of the show, if you are to delve deeper and look at the thematic elements o",
    "\n                &quot;I'll never turn to the Dark Side&quot;... but Death Note balances you between light and &quot;Light&quot; in this epic, mind-blowing anime.  There's just something about cheering for the bad guy in this one, and I was constantly torn between good and evil throughout.  The main characters seemed to have everything planned out immaculately, and even when things went astray, they had it under control.  \r\n     This is an INTELLIGENT anime, and on more than one occasion I had to watch a sc",
    "\n                Let me review this:\r\nStory: 9\r\nThe story is dark and is little bit complicated. But its fast paced and really works out well. The back story of L and Light is not much told but it doesn't take the fun away. But still the story goes a little bit downhill after certain events, which in my thought could have been avoided by the creators. Over all its Good! \n\r\nArt: 10\r\nThe art is just awesome for a 2007 anime.\n\r\nSound: 10\r\nThe theme song, L's theme, Light's theme, all are amazing, with awesome ",
    "\n                This show is stellar. TL;DR is that if you enjoy smart, dark shows, like Dexter, you'l like this. The story is very twisty and turny, with lots of confusing logic and deductions. A TINY bit too much, which is why it got bumped down to a 9/10 for story. The art is good, and it gets a bit above because of the theme song imagery. It really sets the tone for the show well, with godly images of Light. However, the theme song changes halfway through the show, as with many animes. The second theme",
    "\n                Death Note was the first Anime I've ever watched, so I was surprised I haven't even written a review for it yet.\n\r\nArguably one of the best Anime's of all time, Death Note, unlike any other show, made me want to binge it constantly. With such a great pace to keep you on the edge of your seat at the end of every episode, I felt so guilty binge watching a couple of episodes per weekend.\n\r\nThe reasons why I felt so guilty was just how everything worked together so well. Example; The soundtrack",
    "\n                The concept and idea of ''death note'' itself is already way too creative. Right from Ep1 the battle of intelligence started off so intense. Though the artwork and bgm wasn't so enjoyable overall but the plot itself is able to cover up all the remaining shortcomings. When thinking of battle of intelligence, most people come up with detective anime like Conan or Liar Game. However, Death Note is able to bring you a whole new experience compared to previous detective stories, the main charact",
    "\n                Goodness, where to start with this? Death Note has been one of the best series I've ever seen in my entire life. It's plot just blew me away. It was so amazing. The characters were also very interesting, like Light, the power-hungry genius intent on creating a better world. Then you have L, who, despite his age, is just so adorable, especially when he's eating sweets. Let us not forget Near and Mello, who were also very important to the story. I liked those two. They were fun characters, in",
    "\n                Death Note is a brilliant story. It has amazing battles - yet instead of swordfights or fighting with ninja techniques, one witnesses a battle of two genius minds. \r\n  This anime never stopped becoming interesting to me. Every episode, I'm wondering, \"how will Light get out of this seemingly-impossible situation without getting caught? What is going to happen next?\" \n\r\nCharacters:\r\nThere is a wonderful cast of characters. There's a cool genius, an awkward genius, and a Death God (shinigami)",
    "\n                A few nights ago I decided to give Death Note a shot. It seemed to be in well regard, and I had no clue about the plot. I was watching it more or less blind. \n\r\nWell, after the first episode, I was totally hooked. It sets up an awesome premise for the main character, Light Yagami, a high school senior on his way to college. He finds a notebook, and the person who's name is written in it will die shortly thereafter, unless a details of the death are written. \n\r\nAlthough initially skeptical (",
    "\n                A Fantastic and Intruiging Story..\r\nDeath Note is an anime that will keep you glued till the screen because you want to find out what next plot \"Yagami Light\" or \"L\" have up their sleeves. \n\r\nThe plot and idea revolving Death Note is so original. I think we all know that.\r\nThe characters are VERY unigue in each of their own way (both appearance and personality), the entertainment and especially the dialogues are supreme. I couldn't stop watching it, I was so attached to the show! \n\r\nThe mus",
    "\n                Disclaimer: I am NOT a PROFESIONAL reviewer I’m only a anime fan trying to give feed back to other anime fans with that said one to the review.\n\r\nOverall this anime is on of the few shows i’ve seen that manage to capture you from the very beginning the director did an amazing job with both the cinematic effects you truly felt the emotions and suspense the characters feel and he did a good job as well with the mood and angles trowel in he knew when to have dark shady colors and what angles t",
    "\n                My friend is a big Anime fan and as I am just easing into it I asked for some advise, whilst she gave  me many, many, many recommendations I settled on Death Note for a number of reasons. A lot of people had been very excited about the anime and it was one of the top five my friend had recommended. \n\r\nWhilst at first I found the plot a little edgy I found myself loving every second of it. Between the character development and little surprises throughout the plot I felt like I was almost a s",
    "\n                THIS REVIEW CONTAINS SPOILERS.\n\r\nDeath Note. OOOOH I want to give this a 10. I truly do. This is the show that got me into anime. It started off so beautiful. However, about half way through, it took a turn for the worse.\n\r\nArt- 9\r\nNot much to say here. Very solid art style with good use of lighting and changing colors.\n\r\nSound- 8\r\nAgain, not much to say here. Had a good soundtrack that was used at fitting times. I especially loved the first opening.\n\n\n\nCharacter- 8 (Spoiler)\r\nIt had some o",
    "\n                A very popular anime that I somehow managed to avoid watching until now; though I caught a glimpse or two on Adult Swim back in the day, only in the last month have I managed to at last watch it  in its entirety..\n\r\nImmediately, I could see what caused such popularity.  Take a realistic, modern setting, add one solitary, yet very potent, fantasy artifact, some strong leads, a dark and tense atmosphere and a unique protagonist/antagonist relationship and you have a series that should interes",
    "\n                Conceptually, it's not bad. Some of the characters are enjoyable and the story is interesting. But I can't let go the fact that every single female character is portrayed as a lovesick moron. The only female character who's not downright retarded is Naomi Misora, and even she is basically only characterized via her relationship to a man, and quit her job at the honest-to-God FBI just to be some mediocre man's wife. I will not even get into how much the entire Kira #2 arc sucked and how obvi",
    "\n                \"The Death Note\" is soo much captivating that you can't resist. You just can't help falling in love with the characters.They are brilliant including the Shinigami! Full of entertainment and suspense that your brain will seriously enjoy. You will keep on guessing \" what next? \" and will be surprised with a plot twist. The storyline is short but it's beyond unexpected. Every single thing about this anime is far amazing whether it is characters, plot, soundtracks, animation. Epic background mu",
    "\n                I consider Death Note the best anime ever made.\r\n The plot, the caracters, the music, the animation, everything is so connected and well put. \r\nIt's also true that in the middle or so, is not that good as it was at first, but the last episode is so mind blowing that it made it worthy.\r\nI remember te first time that I watched the last episode and I was completely in shock. I mean, I know that Light was really messed up and even though his intentions at first were good, the power of the death",
    "\n                The best anime ever. Period.\n\r\nWhat a mindblowing piece of anime. Incredibly smart plot, heart pumping action, characters that feel real, story and plot flowing smoothly and dangerously.\n\r\nI can't praise this anime enough. Any adult should enjoy this masterpiece.\n\r\nI'm 28 years old, watched this one with my 24 years old wife who NEVER watched an anime before. She absolutely loved it and could not believe that \"cartoons\" can get this good and serious. \n\r\nAfter watching Death Note, I felt thi",
    "\n                The question is who is Light Yagami? You decide and let me know!\n\r\nI feel the story of Death Note is one of the greatest stories ever told. It has just about everything that you could want in a story action, suspense, horror, comedy I give this a 10 not only is it my favorite anime It's my favorite movie my favorite book my favorite comic my favorite poster my 2nd favorite shirt 2nd only to Dr Rockso! (Ka ka ka ka YEAH!) and I'll explain why...\n\r\n Story...10\r\n The story is so suspensful and",
    "\n                I'm not going to be popular with this one, but meh.\n\r\nI do respect what it does, but it's not the anime for me.  The main character, who we're stuck with, is annoying to be with.  He's extremely paranoid and has a false moral compass.  He even breaks it for the greater good.  I can respect this depth, but dear God do I not want to deal with it so upfront.  The smartest detective suspects the main character of killing just because I guess.  No logical conclusion other than a gut feeling.  Ye",
    "\n                Death Note... When I first heard it I was hoping for a life note eventually appearing in the series.... But I can tell you that there won't be. This is one of those animes that get you confused about which side to root for. It plays with your mind. But it isn't scary at all, its enjoyable seeing people's wits.\n\r\nStory\r\nOK, For this part I loved the entire concept of it. The pace is good as it slowly creeps up to you the confusion of which side to root for. \n\r\nArt\r\nThe art in this is not one",
    "\n                This anime was decent the first time I watched it. The first half was alright, but once they replaced one of the main characters, the anime went from a 4 to a solid 1. I only say that because unfortunately My Anime List doesn't have any ratings below a 1. \n\r\nThe characters lack reason for their actions, and there is no character development at all. Death Note was such a cool idea, but it was so poorly implemented that I sincerely believe this is the worst anime that I have ever seen. \n\r\nDea",
    "\n                Summary: Dark, atmospheric and complemented by fitting soundtracks, Death note, built upon the dynamics of two polar opposite geniuses playing mind-games as they try to out-maneuver each other at every step, takes the over-the-top nature of anime and combines it with a certain degree of realism, making the perfect formula for a powerful thriller involving tense, complex situations which aren't entirely nonsensical or cheesy. Unfortunately it is good only for the first half of the show which",
    "\n                This anime is a masterpiece. I will say for the entire show i just thought of it as being a good anime but when i watched the last episode this anime easily became my favorite anime ive ever watched. That last episode is better than a masterpiece it is the best episode of a anime ive ever seen. Also the story is great i love watching light and never being able to expect what is going to happen next. The sound and the voice acting is outstanding work. for example lights Maniacal laugh in the",
    "\n                Death Note is about a high school student called Light, obtaining a death note, which can kill people if their name is written in it.\n\r\nThe animation is made by Madhouse and the anime is a manga adaption, made by Tsugumi Ohba and Takeshi Obata.\n\r\nDeath Note is a very tense thriller with psychological aspects in it. It has themes of death and God. The characters were very interesting and there was clear character development in the main character, Light. One criticism is that the female char",
    "\n                *THİS REVİEW CONTAİNS SPOİLER*\r\nDeath Note is definitely one of the best anime series. Death Note is a good series with some clever moments. It is very good. The characters are really good but Misa I don't like her. I like the Light's personality that never changed. He is a pure evil and L I like him too but when Yagami finally killed him I smile like Yagami. I like how Light never feel anything about him.\n\r\nThe second part of the series (after L's dead) is kinda boring. First part is way b",
    "\n                This is a very good series that I enjoyed through to through and is my 2nd best anime I have ever watched. This anime is full of surprises and tension which makes this a really fun watch. The intense atmosphere makes for the perfect cat and mouse chase. The core concept of the show is very unique in the sense that not many shows have attempted something like this. The amount of content that can come out of a show that focuses on somebody's weapon being a book may seem like something extreme",
    "\n                Just one word for this anime \"Masterpiece\".This is one of the greatest anime you will ever watched.So much suspension,thrill,detective works.The characters are just great.If you like dark physiological thriller this the best anime you will ever watch.A High school boy gets a note book that falls from the sky has the power to kill anyone anyway you like.The boy decides to make the world good so he starts to kill criminals.He just needs their face and name to kill. A god of death(shinigami) c",
    "\n                This anime was great. It had a great hook, one unlike any I have ever seen. It's story is very unique and original, and despite the thought of how many different ways you can die, this anime conveys the thought of how many different ways you can kill someone. What makes it amazing is the thought of killing someone by writing their name in a notebook which makes the viewers' imagination run wild with thoughts such as \"if I had that kind of power...\" It's soundtrack is very, very fitting and ",
    "\n                To anyone who said they didn't enjoy watching Death Note and don't think it is an actual masterpiece...you're fucking lying. From the outstanding characters to the story plot I was sitting on the edge of my seat the ENTIRE time while watching this show. \r\nYes, there are some characters that I may want to remove because of their annoyance, yes there are some minor things that happen that I jut don't understand. But the overall execution of the anime was just fantastic in my opinion. \r\nIt's b",
    "\n                If anyone has taste of psychological, supernatural anime then they all propebly heard about Death Note, it's very good at mastermind and thrill too.\r\nFirst of all, the story is great, it was really smooth and excited, and even logic too even for a supernatural anime.\r\nThe art and sound are in good quality, make the anime so smooth and in rhythm,\r\nespecial in episode 25, that episode still got me lots of feel after years...\r\nThe main character is distinct, the first main character I really a",
    "\n                Death Note has been highly regarded as one of the best anime/manga of all time. This is very true, if you are one of the few that haven't seen it watch it now! The Story is very complex and interesting from the start and it continues to draw you in. It contains some very great music from Lights theme to Ls and the openings. If there's one thing Death Note achieves over any other Anime/Manga its the characters. L is possibly one of the coolest characters I've ever seen in an Anime. He is ver",
    "\n                Many say Death Note is a smart anime, ofc it is a smart anime now lets talk about\r\nthe story.\n\r\nStory: 8/10 The story was great and all those plot twist were a surprise specially the deaths :( :) of the others just to make the plan work ( Light Yagami's evil intentions ^(-.-)^) \n\r\nArt: The art was good, it wasn't like any other anime that had the same as this one, this art gave more emotions specially the reaction of the characters being surprised.\n\r\nSound : 8/10 sound was good but some few",
    "\n                This is a very good story involving logic and detectiveness etc. the characters are sooo cool and music is SERIOUSLY GOOD all the theme tunes are sooo good.  Not much action involved, so that's one downside.  The art is really pretty however, and each character is awesome.  Not the best anime, (that's black cat - MAKE SURE YOU SEE THAT IT SHOULD BE WAY MORE POPULAR) but it's second on the list.  I know Black Cat probably won't make it to the top of the manga/anime list, so I'm counting on D",
    "\n                After a long time I decided to watch this anime. GLAD I FRIGGIN DID THAT!!\r\nIn a long shot, this anime is now in my top3 anime ever watched. I think for it's time ( 2006 - 2007 ) the art is actually really good. Not by today's standards, but you'll get the hang of it in no time and you'll get sucked in the story.\n\r\nI watched this entire anime in 3 days, it was fun to watch every single episode. Only the final episode was kinda mweh... You will be in the anime from the first episode, which i",
    "\n                Death note was the first anime I ever watched, and I think it was definitely a good first choice! The story is quite easy to follow- there isn't too many characters that you need to familiarise yourself with, and the story is constantly gripping, so you always want to watch more. Being an older anime, the art isn't up to par with recent anime, but nevertheless, the characters look very life like and still feature some amazing scenes, where the art shines through and really adds to the overa",
    "\n                A must watch anime. For those who like magical and fantastic anime, Death Note is a good option to those who like smart turns in the plot and realistic atmospheres. To tell the truth, Death Note is a fairy tale - or even an old Greek tale, of the kind you already know how it will end (you learn quite in the beginning that the apple-lover Shinigami Ryuk will be responsible, to a certain extent, for the death of the main character, Killer...). And yet it is worthy to watch what happens in the",
    "\n                This is my first review so I thought I should write about the anime that ranks no 1 till date(and I have watched a lot of anime)\n\r\nYou may feel after reading the above plot that oh its supernatural so lets skip it /or I want something more realistic but that is where you are wrong.\n\r\nthis anime is a complete package highlighting on mystery and battle of wits but also gives you a considerable amount of comedy with L(MY ROLEMODEL) and RYUK ,romance with misa amane \n\r\nBUT the driving factor is",
    "\n                Death Note,\n\r\nStory(10)\r\nI gave the story a 10, because it really drags you into it. I couldn't stop thinking about things and could'n't stop watching, it was just too good. \r\nThe story is a story where the writer really thought about. All the episodes connect and form one great story.\n\r\nArt(9)\r\nIt is just done very very fine and you see someone getting really evil, but can see that person like a very good one. All the faces are just done perfectly and they give the anime a special thing, w",
    "\n                Great anime for a starter.\r\nHas the best main character,good choice for those looking for something serious.We watch the battle of two geniuses.You may get bored at some moments, but when you finish, you will realize that it is one of the best anime you can watch or watched.\r\nYou may be addicted to theme musics.\r\nThis is one of the best anime I have watched\n\r\nBad things:\r\nSupport characters're are not good enough next to the main characters.\r\nThe drawings are bad in some scenes but overall ",
    "\n                Death Note has a creative plot with many twists and turns, telling the story of student Light Yagami who discovers a notebook with the power to kill anyone who writes their name in it. When Detective L is introduced, a game of cat and mouse begins. It's the type of anime that I would recommend for any type of person to watch, the themes covered here are very well in-depth and explored despite being a short and objective series. The anime leads us to reflect on the characters' moral dilemmas",
    "\n                My first impression.....WOW, I never actually expected such an idea to work out the way Tsugimi Ohba had done it. This is one of the two Anime I can say I was hooked on within the first 3 episodes. This did not bore me at all, I am very much impressed at its originality. *spoilers below*\n\r\nThe character development is amazing, you will not end this series wondering or believing you missed something from one of the main characters. And to be honest, Light is the most impressive villain I hav",
    "\n                Death Note is really really one of the best anime I've seen yet–the concept was incredibly unique and well executed, the characters were complex and compelling and the pacing was good. Mostly. \n\r\nThis was one of those anime that lives up to the hype and that deserves the legacy that it's built in the community today. The scoring and the art play well to the shows dark themes and overall it's a harmonious piece, well executed.\n\r\nMy biggest gripe, and really the thing that ruined a lot of the",
    "\n                The most popular anime series. Does it deserve it? Well, yes and no. The idea of being able to write someone's name down and they die has been around for centuries. However, the way it is pulled off here is like no other piece of media has done before. It is the #1 most popular for this very innovative reason, as well as that the plot and characters themselves are very unique and engaging.\n\n\r\nThe art style of Death Note is not the best, but it came out 11 years ago. In that sense, it holds ",
    "\n                Much has already been said about Death Note and its intense scene of potato chip eating. I think I've heard people talk about the plot as well. As one of the breakout hits in a period many refer to as the golden age of anime, it's hard to write a review of the show and feel like I'm actually adding anything new to the conversation. My basic feelings: I like Death Note. Sometimes, it's brilliant. Sometimes, it's just okay, but I can't say it wasted my time.\n\r\nLight Yagami and L might be one ",
    "\n                At first, I wasn't interested watching this anime just because I think this one's really overrated by viewers. Yet, once I started watching the first and second episode of this anime, I was really into this show. The story was amazing and very addicting. \r\nThe first part of the anime introduces to us the abilities of the main character (Kira) who can kill a person by only writing his/her name on his notebook. It was simple, but gets more and more enthralling once they introduce a couple of ",
    "\n                The best cat and mouse game in all of entertainment, this is what death note brings to the table.  \n\r\nIt may sound boring at first but boy oh boy are you in for a surprise, this show for all said and purposes is a masterpiece, until..... \n\r\nLets talk about the the characters as that is no doubt the best part of the series, we have Light Yagami a high school student who finds a death note and L a mysterious detective trying to uncover what is happening. Light and L are both geniuses/prodigy'",
    "\n                I was suggested this anime back in 2017 by my older brother. I was sceptical about it to say the least. It sounded bland and boring but after watching the first few episodes I was HOOKED. They perfectly set up the plot, characters and motives perfectly. I even found myself at time sympathising with the main character Light Yagami. Not to mention the OP was really good and sets the mood perfectly. All in all the entire first part (I will call it L part from now on) was an amazing watch and I",
    "\n                such an amazing show. i wish they made more. Only 37 episodes. Every single one had me wanting more. The suspense was giving me so much anxiety lol.\r\nMy favorite part is the whole chemistry that L and Light aka Kira have. Its mysterious and suspenseful. They play mind games with each other and its a very unique story, with alot of unexpected turns. I love light's character. He goes from a young man trying to save the world to surviving from the results of his own mistakes. And the shinigami",
    "\n                Death Note is one of the best animes out there it's well known and gets a decent amount of attention.\n\r\nFirst the story\r\nI would give the story 10/10 but a thew of the episodes were not as entertaining as the other mainly the second half so 9/10.\n\r\nArt \r\n10/10 loved the art style more of a 2006-2008 style which suited the anime well.\n\r\nSound \r\n10/10 the whole Soundtrack is great even the background music sounds good including the op and ending.\n\n\n\r\nCharacters \r\nLoved the protagonist Light a",
    "\n                Why only 8 and not 10?\r\nAs many fans said, the very least there's no way you will regret watching the whole anime series. The emotion is felt. Honestly, this is the only show I remember that I felt really so thrilled. The twist is good... just assume that it's norm that there's no room for mistake for both Kira and L. The plot is OK. \r\nHere I go explaining why it's not 10:\r\nI was just so disappointed with the ending or rather the final ending episodes and the final episode itself. What disa",
    "\n                Its a big shame that I haven't watched this anime a little earlier. The Story must be written by a genius. Outstanding Anime very great to watch, the story just takes you into this world and you feel with the characters. Till the end this Anime is great to watch and the Story never gets boring. Voice Actors are great, Characters are nice and everything fits together very good. If you are an Anime-Fan you should consider watching this Masterpiece.\n\n\n\r\n--contains spoilers--\n\n\r\nThe Battle L vs",
    "\n                (MINOR SPOILERS)\n\r\nDeath Note is one of the most popular anime of all time but it has it's draw backs for me personally. The intensity of the show is staggering and you can't stop watching it once you've started it. The pace is steady, smooth and has no unnecessary scenes. Yagami Light is an intellectual student where life is too simple for him; one day that all changes for him when he discovers the Death Note. Ryuk a Shinigami from a different world where he appears and his only seen by th",
    "\n                Death note is a really good psychological thriller and mystery anime. It is my third favorite anime of all time. It tells the story of a witty battle between a highschooler who picked up a notebook of death from the shinigami Ryuk, and the world renowned detective L. It has a lot of incredible moments, witty dialogue, and genius plans as from both Light and L. The characters are really well written, entertaining and relatable as well, when these characters go through excitement, happiness, ",
    "\n                Hmmm. . . . . . . Ladies and Gentleman, the masterpiece of the dark series has finally arrive at the name of Death note.\n\r\nStory : pretty well written, flawless plot twist, first half is good and pretty well done, but the second half is better for me.\n\r\nAnimation : HOLY GOD! Animation is awesome, hands down for it. Although it didn't get the perfection of drawing the special effects are awesome.\n\r\nCharacters : sorry L fans but i like Light more than him, Light is a simple student but HOLY F",
    "\n                Story: this anime made me realize years ago that there were actually well plotted animes with very good developments outside of the usual hyped up series, the story is interesting and the whole engaging will get you hooked up to your seat\n\r\nArt: very nicely made, enjoyable portrayals\n\r\nSound: amazing sound work, never gets annoying and always works fine\n\r\nCharacters: quite delightful, the main and rest of the crew pulls into the role your expecting them to pull and makes it work quite nicel",
    "\n                Before I write this review of Death Note I want to state that this is completely my own personal opinion and that you may agree or disagree.\n\r\nReview:\r\nDeath Note was an fun anime to watch and is revered as one of the best anime out there to date. No anime is out there that doesn't have it's flaws. Intro I think both intros fit the anime well and the animation as well. Character wise the MC is annoying at times and I grew to dislike him. Side characters are were this anime hits it's strong ",
    "\n                To start off I'm very new to anime so take my review with a grain of salt.  I was sucked in immediately by the art and style of the show.  Along with a very interesting premise presented to us from the first episode.  The first 26 episodes were 10/10 no doubt in my mind. I kept watching episode after episode wanting to know what is going to happen next.  Then the series hits a wall and completely derailed my interest.  From 27-37 I started to care less and less about characters, I would str",
    "\n                Death Note is, undoubtedly, one of the highest quality animes out there. The storyline is completely unique, original, and suspenseful; always compelling you to watch the next episode, but not disappointing you at the finale. When I first came across this show, I was skeptical about i after reading the description because I didn't like heavy, detective, murder, or horror shows. But trust me on this one, the gore is kept to  minimum, and the story is pure genius as it is based on intellect r",
    "\n                okay.. death note.\n\r\nthis is a first time i've given a ten-sweep although overrating is a hobby of mine. ehe ^__^ but that's just how i think highly of it.\n\r\ndeath note is not your ordinary anime program. i mean, who would have thought of world domination using a notebook (refer to synopsis)? although the plot may sound simple as that, the series is entirely NOT simple! haha. to put it into understable terms, it's a work of a genius! my words cannot fully capture the extent of its majesty! ",
    "\n                a really great anime that has everything unique. i haven's seen any other animes with same story, art, characters or anything else. it's full of mystery which detectives have to solve.\n\n\r\nthe story, that's supernatural too is really great, the thing about shinigami is the greatest ever. Kira and shinigami are both bored of this style of living so there comes justice, for Kira and an entertainment, for shinigami XDXD\n\n\r\nthe main character Light Yagami is really one of the best anime characte",
    "\n\n\r\nThis anime is like, super awesome. I don't even know where to start... Uh... Well, let's start with what everyone starts with, the plot.\n\r\nPlot - 10 - This anime is enthralling to the maximum. The plot is unique and original, and makes for a ton of fun. I suppose it depends on your taste in anime, but you should really give this a try at the very least. The show NEVER gets repetitive or boring, and it kept me on edge the whole time I watched it. Every human who's seen this usually asks themselves this s",
    "\n                I won't be able to say anything bad about this story, so I guess this review will be highly subjective, but... well, this was my first anime, this story made me start watching anime, so forgive me. Eventhough I saw many series since I first watched this one, it never got down from my favourite list. This story is amazing in so many ways.\n\r\nThe art, the music, they are amazing on their own, but... I can't say much about them. They are perfect in helping the story, in developing it, but when ",
    "\n                *Possible Spoilers Ahead*\n\r\nThings I liked about this anime:\n\r\nLight makes for an amazing protagonist, like something out of shakespeare (I'm not exaggerating either, watch the dang show), and L is a superb antagonist. In fact, the story for the most part is amazing! The soundtrack is memorable, as the # number of listens on my iTunes shows. From episodes 1-27, I was well invested, and the whole season concluded beautifully. \n\r\nAs for the second season, I didn't like it as much, but Light's",
    "\n                This is one of the anime's that got a lot of attention when it was released, it started out good BUT and this is a big but the villain is a smart idiot to say the least!!\n\r\nKira - the protagonist - thinks he is such a freaking genius and that he will be able to keep on doing what he was doing. In the end he dug his own grave without even knowing it. \n\r\nYes the plot continuity is very good, the flow of the story is well done, except for the feeling where they just wanted to wrap up the show ",
    "\n                The story line is amazing and it keeps you hooked but sometimes it feels like the story is getting dragged on but all the characters are amazing! I enjoyed it a lot but sometimes it felt like some things were unnecessary. There are lots of twists and turns, and it keeps you guessing what is gonna happen next. It gets pretty intense after a few episodes and the English dub isn't bad either. I personally like L's character the most. I liked it because it has a lot of moments where the shows c",
    "\n                The anime Death Note is a absulutes masterpiece in my eyes. The story and the characters are so epic and so harmunieren class together, as do in my eyes a few. All people who have not seen this anime, which I can recommend Anime warmly when they are prepared for a lot of action, suspense and epic scenes. Also to the DvD Boxes, series that I own, I can only say good. (Mine are on publisher Kazé and it is the German version) The slipcase are beautifully designed and also keep some out. All in",
    "\n                Every episode from beginning till the very end was very interesting, and I just could not stop watching it !\r\nThe story was very well-considered, and in each episode was at least one plot-twister, which made the plot unpredictable till the last episode.\r\nThere was lots of personality in each of characters, so it was interesting to watch it, and more interesting was the thing how they changed after those 5 years that was displayed in anime. \r\nIt was also very interesting to watch, how almost",
    "\n                Story\r\nBy far the best story I've read in a manga or seen in an anime.  It was short, but if it would have been any longer it would have been too long.  So many twists and turns!\n\r\nArt\r\nLooked good to me.\n\r\nSound\r\nLOVED the music!\n\r\nCharacter\n\n\nLight and L are by far the two best characters I've seen in anime/manga.  There is no comparison, the chemistry these two have actually makes this series.  Near and Mello aren't as good as L, but they were entertaining and made a good combo.\n\r\nEnjoym",
    "\n                Death Note was my very first anime and I will never forget how great it was. To this day, it's still hard to find anime series that are as good as Death Note was. It had such an intriguing plot that never failed to amaze me and always catch me off guard. It also had lots of episodes/content which I personally liked so that I could enjoy the anime for a longer period of time. The characters were very likeable and interesting as well, and there was definitely lots of character development. De",
    "\n                death note is an anime that will make you think, sit on the tip of your chair,and even choose a side, who are you rooting for, L or light? \n\r\nthe best thing about this anime is that it completely strays away from the norm, there is no ''i can't do it and then on the last moment suddenly get power'' in this anime and no ''the power of friends!'' bullcrap. we have had enough of that and both those things need to go.\r\nthe anime is a battle with smart executions, and a great soundtrack to suppo",
    "\n                After watching about 30 different animes, I've finally decided to try and brush up my writing skills, and felt that I must start writing reviews and I feel there couldn't be a better one than Death Note to start with. Though I don't remember all the aspects precisely, I do have some faint memories of it. \n\r\nNow talking about the story (premise),Boy!, the writer is a certified genius in every sense of the word, just with a book and some brilliant tactics he has pulled off something truly inc",
    "\n                *This review contains spoilers*\n\r\nOk now if one hasn’t heard about this anime, one hasn’t lived. It is just SO well thought and so addicting. Watch as you see the two most mentally capable people fight in a battle of wits. Light Yagami, the boy who finds the death note, a book who kills anyone who’s name is written in it while L, the best detective in the world, tries to catch him with nothing but his own thinking capability. The Plot twists in this anime are so awe-striking and the storyli",
    "\n                Death Note is one of the few anime that I would call a masterpiece.\n\r\nFrom the cunning and clever story writing, to the very interesting character, this show is amazing\n\r\nThe character development from the main character Light Yagami is just VERY entertaining to watch.\n\r\nWatching Death Note you can't help but to side with the villain (the main character)  because of how charming and interesting he is in but at some points later on in the show your opinion may flip in an instant. it's just s",
    "\n                STUNNED. That was my reaction after finishing Death Note. I watched the first 20 episodes sporadically, wasn't too interested in it -- I mean, the setting and grey tones were intriguing enough, the sheer power of the Death Note and its ability to kill anyone. No wonder it's no. 1 most popular on MAL, and for the same reason, why Attack on Titan is no. 2. We as humans are fascinated by the morbid. There is a lot of death in this anime, and the premise alone lends itself to many a moral quest",
    "\n                So, I was recommended this anime by my friend who's quite a weeb. Even though he kept telling me to watch it, I still avoided it and man I was so wrong to do it, I always thought anime can't be interesting as Real shows but this show went over all my expectations in the terms of story. Anyways, I've done too much chit-chat so I'll start writing my review now. It's Quite short tho cause I'll be just focusing on three things. Story, Art and Music.\n\r\nStory\r\nThe main dish of this anime was its ",
    "\n                It is hard for me to give Death Note anything less than a 10, BUT I have seen anime with better art; given the year Death Note was done it is understandable why the art is up to a lesser standard so I give the art an 8.\n\r\nWith that out of the way I want to make this review short and sweet on why this anime surpasses all others. No matter what type of anime you watch Death Note has something for you, guaranteed. When it comes down to it the most important part of any show to keep the viewer ",
    "\n                Death Note is one of the most popular animes around, with both avid anime fans, and general public enjoying thestory.\n\r\nDeath Note is different, and definetley worth a watch, the story is clever, surprising you with the twists and turns, in both plot and in characters. The first 20 episodes had me hooked.\n\r\nBut after a while, Death Note lost my interest my appeal was lost on the story.\r\nI found Light to be more annoying than clever, and his gradual psycological change became inane and almos",
    "\n                What can I say that hasn't been said before, this anime is one of the best, and for good reason; it's intriguing, goofy, has great characters, an interesting premise, and a fantastic story.\n\r\nCharacters:\r\nLight vs L is honestly the best thing in this show, when they get into their mind games, it's the best and so fun, sometimes a little silly, but they make it fun and entertaining every time they get into it. They almost make you hope that it never ends. Other characters they introduce are ",
    "\n                This was the first 10/10 anime i ever watched. Seen it twice. Madhouse 2000-2010 is animf peak for me. Darker. Gritty. More mature shows. And in that peak Death note is at the absolute top, the personal battle between Yagami and L is the greatest rivalry. In any media. This was the type of show that just never lost your attention from start to finish. The mood. Animation. Music was so perfect for the show. And the voice avting. Dont think its been done better. Especially Yagami. \n\r\nSome cri",
    "\n                One of the best shounen ever created. It's really amazing. No words. Out of the world. \r\n  The story is really amazing. The plot flows really well. I always liked anti heroes but Yagami Light is one of the best characters ever created. The concept was new and the classic animation that flows along with it MAN! This is Heaven. The topic of Death Note falling into a Humans hand and he decides to create a peaceful world. An absolutey amazing plot. \r\n  Highly recommended. Don't ever miss watchi",
    "\n                This is one of my Top 5 anime shows of all-time; The only complaint you're gonna have upon checking this anime is it should've been longer (Yes, even if the modern standard these days are only 12 episodes per season and this has 36 lol); It was good, and I think as soon as you reached some sort of adolescence it can be really good experience of a show I can recommend. Go check it out.\n\r\nAnimation (8/10) - If we are to compare the animation style of this to the more modern anime that comes o",
    "\n                (Possible spoiler?) This is the best anime I've seen so far. The second after I read the rules of the Death Note in the synopsis I wanted to watch this anime; and I'm glad I did. \r\nThe effort taken to right this story is far beyond my imagination, even as an author myself. It just kept me guessing the whole time of how he would solve things. \r\nThe art was also great. I'm not much of an artist, but I know good art when I see it. \r\nI've listened to many dubs, and I've got to say, this one was",
    "\n                  Although conformity (and being against it) seems to be an issue with most diehard anime fans and this anime, it seems that Death Note has rightfully earned a spot as one of the most watched Animes. \r\n  I, like many others, give an anime a very small time to appeal to me. Death Note was able to not only grab my attention from the opening theme, but also to somehow manage to keep me excited, even during moments where he was simply staring out of a window. That excitement stays strong until ",
    "\n                I had read opinions of people saying that it is one of the best animes of life. AND WERE NOT WRONG.\n\r\nThe plot is very original. A notebook that can kill with writing the name and visualize the appearance of the person we want. The chapters were short, it's an anime that catches you, that hooks you. I saw 8 chapters in an XD afternoon.\n\r\nIt deals with a subject of which there has been controversy. On the one hand, Light (Kira) thinks criminals must die. Instead, who will try to capture Kira",
    "\n                I feel as though giving a brief description of the plot, as is standard with my reviews, isn't entirely necessary. In my case at least, I sort of knew the premise of the show before I'd even watched it, just because it's so well-recognised, the same way that despite never having seen Star Wars, I still have a vague idea of what happens in that series. Anyhow, Death Note is about a student named Light Yagami, who encounters a 'death note', allowing him to kill anyone he wishes by simply writ",
    "\n\r\n'Death Note' is a unique anime that appeals to almost anyone who's a fan of Anime (and even to those who aren't). Not just for the plot, but for its appealing for its animation and soundtrack.\n\r\n'Death Note' is ahead of time. With the writers thinking beyond what other script writers create, Death Note takes anime in a new, enjoyable direction.\n\r\nLight Yagami is a straight A high-school student who discovers a 'Death Note,' dropped by the shinigami Ryuk. With its user following the proper rules of the De",
    "\n                The animation is excellent and polished, the plot is one of the most intense psychological/philosophical/intellectual I've ever seen. It is original and compelling with its unexpected twists and turns  which kept me at the edge of my seat the whole time.  The characters are colorful, interesting and prone to make you feel extreme contrasting emotions (For example I would switch between hating Light and cheering for him).\n\r\nI love a show that still  makes me think even after each episode end",
    "\n                Very enjoyable anime that can be recommended to nonanime viewers. All around solid plot, super engaging thriller. It has a dip towards the middle but I find the payoff to be worth it. I don't want to spoil much for anyone reading this, so if you're considering the anime go ahead and give it the 3 episode treatment. \n\r\nThe story revolves around Light, who makes a name for himself as Kira after finding the death note. L is then introduced as the antagonist of the anime. Throughout their excha",
    "\n                been a while since I've decided to pick up death note again, as a child I found it boring and lame. But revisiting it now that I'm older I find the charm that this anime illustrates through a psychological mystery between two geniuses. \n\r\nThe story itself isn't the main focus and doesn't seem realistic, not the death note, but the crimes themselves. I really don't see how Japan has so many criminals that they have the curtesy to announce new crimes so often for the six years the anime takes",
    "\n                Overall, I have to say, that Death Note was a masterpiece. The story, art, characters, they fit all the places in the anime. The anime was unique in a lot of ways along with this it had some moral and interesting lessons embedded to it. The story might seem a little dragged to some watchers after the mid of the anime but tbh it actually showed that not always a hero defeats a villain, which is true in reality and but indeed everyone will taste what they sow. It was brain-teasing and it kind",
    "\n                I thoroughly enjoyed the anime while watching, however, I do believe there could've been a few changes.\n\r\nHonestly, I thought the art was great, and the main idea of the show was definitely intriguing.  At first, I had enjoyed watching, but there were a couple times in which I believed it was lame, mainly on how they figured out certain parts of the mystery.  If I brush it off, then it was a good start.\n\r\nLater on in the series, it did seem to get a little jumpy, and I found myself rewindin",
    "\n                One of best to get into anime if your friend want get into anime show this\r\nvery good plot and rival one of the best anime out there\r\nbut I think if they had ended at ep 25 it would be great eps where light was in jail were boring but every thing other was great\r\ngreat character development and ending was good too \r\nI like art style too many if anime is made kida long ago then animation would seem bad it it still hold a candle\r\nit's dub it great too some anime don't very good dub i would pr",
    "\n                The show starts off strong... very strong. You get immediately hooked into the story and main character. L and Light are both intriguing characters that make you addicted to the show. These characters are the star of the show. Seeing how these two battle and try to outwit each other really displays the manga artist's skill in writing and story development. \n\r\nI would give it an 9 or 10 if it had finished strongly... but the plot and story of the show takes a huge nose dive at the final arc ",
    "\n                WARNING THIS REVIEW IS SPOILER HEAVY:\n\n\n\n\n\n\r\nDeath Note is an amazing show that failed to carry its value to the end. The beginning of the show lacked any significant plotholes, the characters all had variety and were introduced well, and the mental gymnastics the writers had to go through must have been absurd. The conflict between L and Kira is like an oversized chess game, with each player being extremely proficient in their strategy. An entertaining and memorable experience that constan",
    "\n                A well-designed anime with a very exciting plot.The meaningful questions laid on the table seem to me a key reason why this anime remains no. 1 in the world’s top of most popular anime (according to Myanimelist) even if it’s a 14 years old anime already. Justice or love and forgiveness? We live by principles and rules without which our society would go chaotic, but disrespecting them, would that worth taking a man’s life? My father was the one to remind me how much are the people drawn to b",
    "\n                Honestly idk if I put spoilers in this, so consider yourself warned. \n\r\nThis Anime is solid and very good to say the least, but unfortunately the second half of the season drags down the overall rating that I'm giving this anime. so I'll try to give two responses for each section in relation to this.\n\r\nStory (8)\r\nThe reason that is an 8 and not a 9 or even a 10 is because of the second arc. If the anime ended at 25, concluding the anime with the death of L then I could have died a happy man",
    "\n                A must-watch for those who are new in the Anime-Community and are interested in Psychological, Thriller, Supernatural and Mystery genre. I wasn't planning to watch it in the first place but I changed my mind and it was worth the watch. In my opinion, the intensity of every situation in the story is what makes it interesting to watch. It made me curious of what is going to happen in the end. There are some scenes that I would call strange or odd but whatever, the art represents the mood and ",
    "\n                This was the first anime i ever watched, and i have to say it still stays at the top of my list. It is so engaging and you rareley know whats going to happen next. Every 3 episodes there is an event that will blow you away. I would definetely reccomend watching it if you havent already, it will be a good experience :) (it gets boring around episode 16-22 but jsut keep watching :) The character development is phenominal, although i will admit there are some things i would like to see changed",
    "\n                >> I'm new to anime and this is just my opinion. <<\r\n>> SPOILERS BELOW <<\n\r\nThis is the first anime I've watched and I LOVED it. Every episode enriches the story and the characters while building on the suspense of the last episode. Whether the MC is eating chips or playing tennis, no moment feels empty. This is a show that demands, and deserves constant attention. The soundtrack is excellent, and the art is just right for the setting. The first 24 episodes are simply brilliant.  \n\r\nUnfortu",
    "\n                What can I say. This was a MASTERPIECE! I am not over exaggerating. If you love something that has a great plot that will hook you till the very end you will enjoy this, though i'm not sure who would NOT like that...\n\r\nI've personally watched a few animes that kept me on the constant thought of \"should i stop watching\" Well, this was never the case for this anime, on the other hand, it kept me intrigued on the multiple possibilities the next episode may hold and always had me surprised with",
    "\n                Death Note is a masterpiece!!!\n\r\nI have seen many other amazing animes but still, Death Note is my favorite. There are plenty of reasons why I like many other fans like this anime so much. \n\r\nFirst, the main characters, L and Light. This is the first time when the protagonist is the real villain and his counterpart is equally capable to tackle his master moves. The tension was so real you can feel in your heart with the passing of every moment.\n\r\nEven before the real confrontation, Light ha",
    "\n                Death Note is one of the first animes I've watched and holds a special place in my heart. If a friend of mine wants to get into anime, Death Note is the one that I suggest to start off. It's really easy to get into, has captivating plot and great characters and has some really nice plot twists... but I think the whole fun of watching death note is how characters act in the story. Every character has their own motives and ideologies and the anime makes you debate over them, it makes you ques",
    "\n                Death is still one of the best anime through all the years which stills leaves us to debate whether Light was right or wrong. \n\r\nStory (10/10)\r\nLight Yagami picks a notebook with power to kill and with that he intends to cleanse tjis rotten world and become the god of the new one. Well, that is until L shows up and tries to catch Kira.\n\r\nArt (9/10)\r\nI'd say that was was amazing coming from 2006 and accomplishing that most modern anime still struggle with.\n\r\nSound (9/10)\r\nThe music is great ",
    "\n                Is the anime that everybody recommended to me when I started watching anime and the one I recommend always to every one that starts. It's one of those things that are made and doesn't need to be redone because is already perfect.\n\r\nPros:\r\nThe story is simple, but what matters here is the execution and it's phenomenal, the characters are great and really interesting to follow. The music is a master piece, there is no a single track that isn't memorable and every one has an impact to the scen",
    "\n                Story - 10\r\nDeath Note perfectly explores a unique and engrossing story whilst touching on subjects such as morality, justice and the impact of power on corruption. A wide range of excellent twists are embedded throughout the entire anime, ensuring that more often than not you're repeatedly left on the edge of your seat entreating for more.\n\r\nCharacters - 10\r\nWe're presented with 2 main characters, Light and L, who despite being regarded as geniuses share very opposing views on justice. Con",
    "\n                Story(10/10)\r\nThe plot line of this series is one of the most clever ever conceived. The entire of idea of a death note that can kill people with just knowledge of there name and face is completely unique with nothing else like it out there. This then evolves into a story of a genius battle of wits between 2 characters on a level of their own cleverness that makes the Criminal Minds writers look like they sit around and drool all day long. There is even an explanation of other world shiniga",
    "\n                For me, Death Note is, and forever will be, the best anime of all time.\n\r\nThe story was very well put together, its a smart and very developed anime.\r\nIts really the viewers choice onto who is the \"bad\" guy and who is the \"good\" guy. \r\n10/10\n\r\nThe art was also very good, im very picky with the art. If something has a good story line, characters, etc, but bad art, i cant force myself to watch it, it will bug me till i eventually quit watching. \r\n10/10\n\r\nSome people say that in some areas the",
    "\n                This is one of my favorite series. This is one of the few anime that I actually wanted to cry at the end of. The story line was by far one of the best for anime I have seen. I remember seeing the preview and thinking that this anime was going to be very stupid. After a friend beg me for a month, I watched it. I liked it from the very beginning and even more as the series went along. It's one of the anime's I hope everyone gets to watch at some point in their life since it was so enjoyable. ",
    "\n                At One point in this Anime i felt like this was a contender for Best Anime but I was wrong.\r\nEverything in this anime is just stunning the voice acting by Aya and others are perfect and the plot is very unique, then to top it all is the animation styles and backgrounds they are just stunning and beyond words..\n\r\nThe story revolves around a guy called Light who see's a notebook fall from the sky from class he goes to find it and when touches it meets a moster called Ryuk, he finally finds wh",
    "\n                The first half of the anime was really awesome. Towards the end though,  it lost it's air. \n\r\nThe characters were well developed. Well, except Near, who just felt like a ditto copy of L. \r\nWe see Light going from a brilliant student who cannot tolerate injustice to a sinister killer.  It shows how power can get to your head and gradually, take over you and lead to the destruction of your morality.  \n\r\nEvery eposide has the audience thinking, \"Is it really right for Kira to judge criminals o",
    "\n                Death Note is a great psychological anime about a kid who acquires a notebook that kills the people whose names are written in it. Normal episodes consist of the MC being a genius edgelord writing names in a notebook while trying to trick the cops into thinking he isn't.\n\r\nIt's great at keeping you on the edge of your seat and has you constantly guessing who will win each psychological battle. The art is a little stylistic in a way that is fairly cohesive with the anime but is on rare occas",
    "\n                Death note.. oh boy it is truly a masterpiece. It is one of the most logical, mind f***ing and extremely beautiful series ever made... no surprise that it easily makes up to the top 5 of any of the top anime lists... the plot is basically compelling.. it is a show that will throw most unusual things at you which you won't be able to guess where came from... and will continue till the end to make you sit on the edge of your seat..\r\nfor any person having doubts as to is it worth it or maybe i",
    "\n                I must say that this was one of the most interesting animes that I have seen in a while.So for the next paragraphs I will be stating the things that I liked and disliked about it :\n\r\nWhat I liked:\n\r\nThe story-the plot really got me invested and engaged to the point that I felt a little dissapointed when I had to to leave the remaining episodes for tommorow due to every day activities.It really makes you think about is what we are doing daily right or wrong or are we just judging based off o",
    "\n                Ah, my absolute favourite anime of all time, Death Note. And boy, is there a furious discussion going on about the value of this anime, even a decade after it was released. I will carefully try to explain why I think this anime deserves the highest score I can give.\n\r\nThe premise and story should be known to almost anyone in the anime universe, and it's even somewhat popular outside of the anime medium. This popularity doesn't come from nowhere, it is genuinely the most interesting premise ",
    "\n                Story:\r\nVery unique.  I have never run across anything like it before nor after.  This series has an intelligent feel to it, and always keeps you on your toes.  However, the second half of the series became a little redundant, or rather- predictive in a sense.  \n\r\nArt:\r\nThe art is magnificent.  Not the most beautiful, frilly art per se- though definitely talented.  Eye-candy indeed.  This series uses different angles and view-points very well, and the entire time I watched, I was constantly",
    "\n                First of all, I would like to preface this review with a summary before I write anything. Death Note is an amazing anime, and you're an absolute fool if you've never watched it before; it's one of the top animes of the decade, and of the medium itself. \n\r\nThat said, I suppose it's time to delve into the actual scores given and why they were given.\n\r\nTo start, let's talk about the story. I, for one, weight the story as 40% of how I feel about an anime. Generally, if the art is glitchy or the",
    "\n                      Death Note is an anime exciting, which holds your attention from beginning to end. An episode is never enough. Its soundtrack make us shudder, especially when Raito is writing the book!\r\n     I could say that we see throughout the anime Raito gradually turning into Kira. But that is not what happens. Raito is already a born killer, he was ready when he finds the Death Note, he only lacked the means to carry out the murders.\r\n    L is the balance in the scales of justice that is create",
    "\n                Death Note is renowned in the community for being outstanding, and for good reason. The emotional connections built with these characters are very rewarding for the viewer. The writing is so smart, and brings up many intriguing philosophical dilemmas which the characters have to handle.\n\r\nThe story flows very nicely, and at the end you can feel the tension building and a sense of urgency is pressed upon you. This really helps to bring out an emotional response. The ending seemed lackluster ",
    "\n                Death Note episodes 1-25- its intended ending- is a masterpiece, period. Unfortunately, greed won out as it often does, more episodes that were never intended were shoved in there and the overall quality in every area minus the voice acting, which remained the same, took a hugely noticeable dip.\n\r\nArt-\n\r\nThe art and animation in Death Note is not flashy but it never needs to be. It's fitting, deeply symbolic and has a few genuinely gorgeous moments. The art, like every part of Death Note, i",
    "\n                Death Note has to be one the greatest cat and mouse anime of all time with an engaging plot, characters and twists.\n\r\nThe story premise itself is very unique. A notebook dropped by a god of death falls from the sky and happens to be picked up by one of the few people in the world who could adopt the role of a human god of death, acting as judge, jury and executioner.The story is written very well and causes most viewers great intri gue, and although the quality drops a bit after episode 25 ",
    "\n                Death Note is really awesome.\n\r\nAll the cat-and-mouse drama is amazing, the main characters are deep and well-developed.\n\r\nKira is obsessed with creating a  \"New World \" While L is calm while fighting for his justice.\n\r\nThe art is well done, and contains very beautiful and reflective plans.\r\nAccompanying the visual part, the soundtrack is very good -highlighting the L's theme and the first opening of the anime-\n\r\nIt is important to know that the anime loses some of the quality after the dea",
    "\n                \" Justice is a tool that can be used by anyone to justify their action. The question remain is that will you use it to defeat evil or to remain the system as it is? \"\n\r\nThe very first episode has already shown you the center of the story. If you have to power to bring punishment to the bad guys, will you do it? The story then follows up with two heroes that view justice with their own perspective and to prove that they are the real justice. No matter which side you choose, there will be som",
    "\n                First of all, I'd like to say I love the sort of drama this story brings. The kind where a highly intelligent character is constantly in a seeming dead-end and you think \"that's it, it's over for him\" only to see him pull through once more. When it comes to animes, I like to examine the ending, overall message of the story and wonder if it did a good job presenting the philosophical idea. If there even is one to be found, that is.\n\r\nThe message of this story seems very simple to me upon fin",
    "\n                I absolutely loved Death Note from episode 1 right to the end, It is a very good horror anime with not that much comedy, yet I still enjoyed it.\n\r\nThe characters of the story, particularly Light Yagami, with his dual personality really deserves an extra point on the character part.\n\r\nThe story was also very well planned out over the 37 episode run, and I personally felt that it deserved to be that little bit longer to see what would happen next with the other main characters.\n\r\nThe art was ",
    "\n                \"All depends on what kind of justice you believe in.\"\n\r\nPersonally, I enjoyed this anime a lot! The animation, Characters, Story was great. The first half keeps you hyped up. The chase between Light and L was really good. The only fault with it was it became worse after ep 25. It became a bit boring. The entry of two characters - Near and Mello kinda ruined this show a bit. The directors could have improved the character developments of these 2 characters to make it a bit interesting. I fee",
    "\n                How about a game of chess?\r\nOne with uncontested control over life and death as the prize?\n\r\nDeath Note is an odd fish. The Protagonist is also the villain.\r\nLight Yagami is the perfect little golden boy with a sharp, quick and powerful intellect; but he is also a murderous sociopath with a god complex, and a occult notebook that allows him to anonymously inflict his absolutist worldview on a defenseless society.\r\nThat is, until an eccentric detective with a sharp, quick and powerful intell",
    "\n                Death Note has a unique storyline to it. I have to agree and its a very insteresting anime indeed. But I have to say that I really didnt like the characters too much. Light has no sense of human morality and is not very complex in his emotions. The main character wants to \"take over the world\" and cares nothing for anything other than his goal. Which makes me feel as though I cant follow with the characters perspective. Light is unrelateable. \r\nMisa is ,put simply, annoying. Her lack of kno",
    "\n                Story 9/10: Why I say 9 and not 10 is because of the repetition of the first main supporting character's attributes otherwise it was a very interesting series. \n\r\nArt/Animation 8/10: The art was okay but I give it this score because at times you can't see the person's expression.\n\r\nSound 9/10: The only problem with the sound is that it probably would be better if they put a little more music dealing with the theme of mystery.\n\r\nCharacter 10/10: I love the main charac. and the first and seco",
    "\n                Dear Death Note, the 3 episode death\n\r\nContains all spoilers episode 1-3, it's the start of the show, you basically get minor spoilers\n\r\nLets start off the show story, writing wise, is well done.\n\r\nIt's a premise of a book that can insta kill people cause a death god was bored, so he threw that kind of power for someone to discover the book. Deathnote it's called.\n\r\nThe show is a cat mouse, spy vs spy esque theme, of big brain 3000 out braining big brain 3000.\n\n\n\nArt is alright, kinda basic",
    "\n                Death Note is the closest thing I've found to a perfect anime. It pairs a fantastic story with a flawless excecution to bring a nearly divine anime. With a fantastic goose chase between two intellectual titans, Death Note is sure to leave anyone speechless. Having Light Yagami as the main character and not L was genius. it brings to the table the concept that even though Light is the MC, he's not necessarily the protagonist. Death Note is a rare series where you actually get to pick who is ",
    "\n                Short Story :Death Note is one of the best anime series of all time,Death Note is a solid series with \r\nsome brilliant moments\r\nThe protagonist(Light), and his adversary(L) are both genius,at the beginning we see Yagami Light, an extremely \r\ngood student who sees a notebook falling, reads what is written on it. At first he doesn't believe it, \r\nbut then he ends up using it.He continues using the notebook, the police start to appear and more characters\n\r\nMusic : The music is heard a bit more",
    "\n                Expected much more from a classic like the \"Death Note\". It had great potential at first, the characters and the concept are both interesting and exciting. However, the show gets quiet boring to watch at times and around 17th-18th episode or so it completely starts going downhill. ESPECIALLY, after they killed L. This decision felt like the writer was stuck and didn't want to put as much effort in writing this complex story he created, so instead of finding solutions or elements which would",
    "\n                Death note is simply just 1 of those anime's everyone should watch, This show is what got me into anime. Ty Dylan!! :3 But yeah, It has some of the best characters in any anime, and the story and plot are great. Lots of twists and turns, things you didn't expect to happen but they did. There are a few plot holes but they are minor. As you expect, The anime is old and doesn't look to appalling, But it gets a lot better as you continue to watch, by the end of the show, you will have forgotten",
    "\n                I know what this is; you know what this is; everyone knows what this is. Death Note’s (DN) iconicity proceeds itself even beyond the realm of anime, a feat few series have achieved. So what actually makes this series so notable? (pun intended). DN definitely features competently crafted visuals and audio (the character themes go hard) that have aged gracefully, but it’s certainly not why people would or should remember DN. What makes DN such a memorable series is the strong personalities of",
    "\n                Death note was a very good anime to watch. I would suggest this to anyone who has just started to watch anime. It is very good because the story is easy to understand and the characters are very fun to watch. I like how Light isn't those anime characters that are basic and stay like that the whole time your watching the anime. Sometimes you like him and sometimes you hate him. The only thing I don't like about this anime is that I didn't really liked the middle of it because it started to g",
    "\n                A boy finds a notebook that can kill anyone written in it. A very interesting set up. I really enjoyed that. There were a few episodes in the middle that I felt were a little slow but overall that was a really good show. I'm glad I finally watched it all. Really makes you ask who and what is right and wrong. I really loved the rivalry between Light and L. It really makes it something special. Light was easily my favorite character in the show. He makes you root for him even though he's doin",
    "\n                Death Note is one the most well written shows ever. This anime is about a boy who finds a notebook that kills whoever's name is written into it and is being investigated by the greatest detective in the world. I highly recommend this anime, the characters are insanely smart and well written, it really makes you think about your morals and whats right and wrong and shows what people can become when giving so much power. The interactions between Light and L are so interesting to watch and it'",
    "\n                I would have given it 10 on 10 in story and overall but only if the last part didn't exist or handled differently........the main essence of the story is mind game between two geniuses with different sense of justice where you will generally think that the plannings and twists will get more and more twisted and intriguing as the story nears the ending but actually it gets more and more blunt and dumb. Also the change the anime made at the ending from the manga is useless and somehow dampens",
    "\n                I have always, and will always love psychological shows. This show talks about multiple topics dealing with psychology, sociology, ethics, among many more. The portrayal of the main character makes you unconsciously root for them while also recognizing the terrible things he commits throughout the story. \r\nIf you are interested in an anime dealing with god and superiority complexes as well as other cocktails of mental illnesses, this is definitely your cup of tea. Although the art and sound",
    "\n                This is the first review that I write, so I will try my best.\r\nI can say that I loved this series. The story is very good, it is tense, it is fun, it makes you think what the next move will be, but, I must be honest I didn't like the end, I am Team Light. \r\nCharacters were very well developed, at least most of them. L was extremely good, but they overdid it with Near, I mean, L was supposed to be better than him, but Near solved the case too fast,  even with the help of L's notes, it was to",
    "\n                The anime was rated as a \"Masterpiece\" by Anime News Network's users. The writer Zac Bertschy defined the series as a \"surprisingly gripping and original suspense tale that raises a handful of interesting questions about morality\". Death Note was one of the series to win the Best TV anime at 2007 Tokyo International Anime Fair.\n\r\nDeath Note was one of the series that influenced me the most since I started to watch anime. Before watching this series, I was not watching any suspense/thriller/",
    "\n                THIS REVIEW CONTAINS SPOILERS\n\r\nFor me, Death Note wasn't a very a good anime.\n\r\nThe characters were fine, but there were too many to develop in only 37 episodes. Light was left mostly mysterious, which is bad considering he's the main character. We only knew about his family and the reason he wanted the Death Note. THATS IT. We never learned about his personal life, more about his perosnality, etc. Ryuk was fine, and i honestly think he was the best character. He had the biggest part in th",
    "\n                Truly one of the best anime i have EVER seen. Its such a thrill ride and its so different from your typical anime. I can honestly write about this anime forever so ill make it short. Ok this anime has great visuals great plot great execution. It will undoubtedly keep you coming back for more as each ep leaves you hanging off the edge of your seat. This battle of wits between the protagonist and antagonist is truly astonishing. It is incredibly intelligent and symbolic. Listen i cant really ",
    "\n                story: really good, new things happening without interfering all too much, made a lasting thing for me. and i liked the ending.\n\r\nart: pretty good, light doesnt look like who he is which is always a nice juxtaposition, the death gods looked cool along with misa(or was it mika i cant remember)'s death god-ish inspired outfits to go along with the whole death thing\n\r\nsound: really catchy piano/guitar loops and good VAing\n\r\ncharacter: really good development with light\n\r\nenjoyment: only reason",
    "\n                Death note is one of the first shows to draw me into the medium and turn me into who I am today and despite knowing the conclusions beforehand due to being spoiled the way everything plays out is what intrigues me and despite being old it still holds up to be a good gateway anime with only 37 episodes\n\r\nThis review is biased merely due to it being my first show and after re-watching some scenes and reviews I can now acknowledge the flaws which I overlooked \r\nStory-The premise  of Death note",
    "\n                Best rival anime ever.This is of the best anime i have ever seen. The storyline is awesome plus each and every character has some speciality and their own value to make up the series a mind blowing anime. Though the ending seems to be a very tragic one with the death of the protagonist of the stor i.e. Light Yagami, still the story teaches us some of the most important lessons of life.\r\n - No matter how much necessary the cause is but if your actions are wrong then you deserve  to get punis",
    "\n                Coming into Death Note the only thing I knew about the show was the Potato chip scene and the game of Cat and Mouse between by L and Light. Something I had also heard about the show was the excellent writing and I was not disappointed. \n\r\nFirst off the characters in this show are outstanding. Lets talk about the main character Light. Lights wits are no doubt incredibly high as the way he is able to throw off the task force and L each time is nothing short of spectacular and clever. He is a ",
    "\n                Just my unprofessional opinion!\n\r\nFirst of all, shame that there is a 2nd season. The first season was fantastic, the 2nd 'meh' at best. The scores I'm giving are really only for the 1st; I'd suggest watching it and then stop.\n\r\nStory\n\r\nIt's great! The premise is easy enough to understand, albeit a bit ridiculous. Also, they keep adding new rules which might be a bit \"convenient' at times, but I find this is off-set by the constant suspense. 2 guys; one evil, one good. But which one is trul",
    "\n                Wow!!  What a series.  This is literally one of the best series I've ever seen not only in anime, but overall in general.  Everything about this series works on every level.  Even non-anime fans can appreciate that numerous plot twists, and intelligent effort put into this series.  While this obviously isn't the first anime I've seen, I highly suggest this be the first anime anyone new to the art form check out.\n\r\nPros:\n\r\n- Amazing lead characters.\r\n- Seamless plot. \r\n- Very thought provoki",
    "\n                With mediocre art and good-but-not-great sound, Death Note has to win the audience with other things. There are very unique and likeable characters. But unfortunately, all characters are one demensional and lack depth. You only need no more than 2 words to describe each of them. Again, good but not great. What truly makes DN stands out is its story and the enjoyment come with it, at least for the first half. The first half of the story is a masterpiece. It keeps taking unexpected turns whil",
    "\n                I gave the 8/10 to the character, as various characters (which came later) worsened the extremely high level of the anime - in my view. Nevertheless, I enjoyed all the episodes.\n\r\nThe Notebook of Death (aka Death Note) complies with its integration into the anime offshoot with increasingly complex usage possibilities. The simple information that you can use it to kill people is quickly becoming more widespread and its use is thought-provoking.\n\r\nHere, with an intellectually high level and a",
    "\n                \"INQUISITIVE\" is what we'll be after watching each episode of Death Note...\r\nOk now first off, it's not a childish anime show about adventures and kiddish crap, it's a masterpiece. The best thriller Anime Series i have ever watched in my entire life.Its practically a show filled with genius characters, lots of intelligent dialogue and mind-blowing plot-twists with unexpected cliff-hangers. This is a series that's definitely on my Top 10!! \r\nThe Plot and the story is so nicely written that o",
    "\n                okay 7/10 if you watch death note as a comedy. like 4/10 if you watch it for the actual plot. it is so absurdly overdramatic that it's impossible to have a good time watching it if you take it seriously. but it is hilarious if you go in knowing it is so over the top and full of drama. i had so much fun watching it and losing my mind at every overdramatic thing that happened.\n\r\nas far as characters go, i really liked mello. gender. also ryuk was the protagonist and rem was his cool lesbian b",
    "\n                Beautiful anime is the first anime, favorite, and most popular anime for most people. It was my first and I liked it very much. It is very good whether it is the progression of the subject, the characters and the style of drawing.\r\nPositive things I can say in this series:\r\n1- the plot never bored me and flowed like water\r\n2-She was able to experience different emotions.Sometimes I had fun, sometimes I was sad, sometimes I was torn and sometimes I got very excited and tried to understand th",
    "\n                So , basically , it is a physcological thriller that will keep you at your seat throughout the series, hence it is definitely an anime worth binging . The character development is insanely good and i would say the protagonist is kinda similar to thanos ( a villian who wants to wipe out 50% of humanity to bring balance on earth . Well , he is wrong but he thinks he is right). It is a masterpiece but i found the second half (you know what i mean) quite boring (my experience) . But anyways it ",
    "\n                Finished it on summer 2023 holy shit this anime is peak asf. First episode got me into it lol.\r\nWhy it's one of the greatest animes I've ever seen?\r\nThe main character Light Yagami is one of a kind. Craziest serial killer ever. I love how narcissistic and evil he is. Perfect villain. One of my favourite MC. \r\nThe story was also quite unpredictable and how Light's life has been changed so much because of a notebook that kills people, that notebook turned him into a mad man who made him belie",
    "\n                I recently rewatched Death Note, it had been about 6 years since my first watch. I'll keep this short and spoiler-free.\n\r\nWhen I first watched DN, I wasn't impressed. I felt there were lots of plotholes and that Kira could've have just skipped everything by killing those investigating him. Now, I was able to see how complex the plans of each party were, and while there are still several plot holes, notably in the latter 1/3 of the show, most aspects come together. I attribute these plot hol",
    "\n                Liked this Anime. Fantastic plot, dialogues, character development & the conclusion of the story. Story starts with a high school student Light Yagami getting the Death Note, a notebook which has incredible power : \"Killing someone whose name is written on the book\" through which he wanted to eradicate the evil from the world. He started killing the criminals by writing their names on the NoteBook. He got the pseudonym \"Kira\" from public. I had as a viewer liked this idea of his. Yes, I tho",
    "\n                I read the manga for this series. I didn't watch all of the episodes of the anime because of this. Overall I feel like the manga is actually a better format for this story, the art in the manga is top notch and the anime leaves out details. Since there's not really any high octane combat or anything that would require animation to convey well the anime adaptation wasn't very necessary, but that's just my opinion. The choir-y background music was nice though.\n\r\nOverall it's a very good and e",
    "\n                I always thought Death Note was over-hyped, so I avoided watching it for the longest time. Partway through finally watching it I found myself thinking, \"Why didn't I watch Death Note sooner?\"\n\r\nThe art is good. I had no issues with it. One thing in particular that I enjoyed was how they illustrated Light when he was thinking devious thoughts. You know, the red hair and red glint in his eyes. The sound was good as well. The music captures the right mood for all of the scenes. The opening and",
    "\n                This anime was amazing. It kept me interested and it was overall just an awesome anime. If any of you reading this have not watched Death Note, DO IT. NOW.\n\r\nStory~The story line in this anime was very captivating and it kept me on my toes. I legit binge watched episodes because I couldn't wait to see what would happen next. It is very plot-driven and because it has a great story line it's perfect. 10/10\n\r\nArt~I honestly didn't pay much attention to the art here lol rip but L is HOT so I ki",
    "\n                While the first 24 episodes were very good and well paced, the remaining 13 episodes were not.\n\r\nStarting at episode 25, a major character dies. The character's death was one of the most unsatisfying I have ever seen.\n\r\nIt felt very rushed and half-assed that I was wondering if they did this because the studio only wanted to do 37 episodes.\n\r\nIn summary, I'd give the first 24 episodes a whopping 9, however I will give the remaining, an 8..\n\r\nThe premise of Death Note is rather unique and in",
    "\n                very good character development yes\r\nin beginning it was kinda average but the more you watch the more enchanted you become with characters, such as the good ones\r\nsome characters could use some more work to smoothen out the edges\n\r\ngood sounds boom boom boom\r\ni didnt really think about it, kinda deaf\n\r\nmagnificent artstyle ofc\r\nits what you would expect early 2000s anime\n\n\n\nand very pleasurable enjoyment\r\nleft me satisfied\n\n\r\ni liked some parts, and some parts where worse, but in conclusio",
    "\n                Death Note is probably one of my all-time favorite anime.  The premise is interesting and different, the story is suspenseful, it presents itself on a very adult level and treats the audience with respect, and, best of all, the main characters (Light & L) are just amazing.  Even it is labeled a shounen anime/manga it is much more adult than 98% of shounen series out there.  It is really more of a seinen.  Despite the supernatural elements of the Shinigami and notebook of doom, the show seem",
    "\n                Death Note. What an anime. It was and is so well developed, it must have taken Tsugumi Ohba a while to make sure that everything in this Anime was Excellent or to his liking and it turned out to be one of the most awesome present day animes in my opinion. \n\r\nThe charcters were beautifully written and developed, each character had there own unique personality and style about them.\r\nThe Story line was written with dept, and in my opinion you would have to watch every episode to get the full u",
    "\n                Death Note- My favourite anime of all time. This show was outstanding. Absolutley amazing. To start off, the story. The story is like none i've ever seen, and the combination of mystery, action, and the supernatural is brilliant. The constant twists and new developments in the story will keep you up to the early hours in the morning, convincing yourself that you have to watch \"just one more episode\" I should know, i've seen the show 3 times and i still do that. Also, the character is death ",
    "\n                Death Note tells the story of Kira, a serial killer who uses a death note to create a new world under his sense of justice.\n\r\nStory (spoilers):\r\nThe first few episodes of Death Note have one of the best plots I have ever experienced. It is smart and captivating, and keeps you engaged. From the first episode up to Ray Penbar's wife death, the story was simply flawless. However, I would not say that it became predictable as it certainly was not, but later on the story was as captivating. Afte",
    "\n                Death Note is very original and even though its art is very out dated it makes up for it in its amazing plot. Light has a grand plan to take over the world as ,Kira, by killing all criminals with a Death Note, which he found while looking out of the window at school. Light meets Riuk, the death god who owns the death note, and even though he is basically useless and only eats apples and makes witty comments, Riuk kind of just a mascot. But the FBI soon catches on and reluctantly sends L, th",
    "\n                I will defend the potato chip scene forever. \n\r\nThis show is my current favorite and has held that title for a couple years. No singular part of it is particularly amazing, but it just comes together really well. It's simplicity done right. It's smart. It's self aware. It's true to the original. \n\r\nYes, there are certain parts of it that are extremely cringe- inducing. But, those are mere scenes and shots in comparison to the greater whole. The overaction and dramatization is just expertly ",
    "\n                This show is truly a masterpiece. This is a spoiler free review.\n\n\r\nStory: 10/10. In my opinion Death Note has the best story of any anime ever. If you like Attack On Titan, The Promised Neverland, or anything in that area and think it is amazing, you will love this show. It is about a high school kid who finds a notebook that if he writes someone's name in it, they simply die. It is a simple story that you will love. \n\r\nArt: 9/10. The character designs are great and the studio can make ver",
    "\n                Its a good plot and interessting while it lasts. Unpopular opinion: Misa Misa best charachter/wifu. \n\r\nBut more content left wanted after i finished even though its seems hard to continue the plot for obvious reasons at the end!\n\r\nRyuk will make your skin crawl when he is presented. But he will not be what you expect. \n\r\nNote: This area is only to be used for posting a review of the series after you have seen it. This is not a discussion area.\n\r\nNote: This area is only to be used for postin",
    "\n                Impossible not to enjoy this no matter how badly you perceived it.\n\r\nFirst half 20/10 \n\r\nUnmissable Peak Anime Content. Edge of your seat, Sound, Animation Story and Pacing intertwined perfectly. This is the reason you started to binge Anime. Sadly expect nothing in the future from this type of Anime to impact you the same again.\n\r\n2nd Half 8/10 \n\r\nThey had to end it somehow and it was good enough. The 2nd half heroes pale in comparison to the 1st half in all metrics, understandably so but ",
    "\n                    Coming into this anime, I really didn't have any expecations. Obviously this is the highest ranked anime by popularity. In my opinion I do believe this anime deserves a solid 8 because of the symbolizm shown throughout scenes, a conflict between views of justice (as shown between Light and L), and the gut wrenching cliff hangers that really make me do wonder every episode. However, the main flaw from the plot is especially the second half of the show. New characters are introduced who s",
    "\n                Where to begin, this shows almost flawless. The character writing is the best i've seen in any anime, maybe even tv show. L has so many quirks that make him feel so humoress and alive, and hes complex in a way too, making you easily see him as a great person, and hes just perfect as a character. Light is likeable and unlikeable: theres equal good and bad with him, and you see that hes a great guy without the notebook, but with it....., that's leaning toward the bad guy, but not all the ay .",
    "\n                The story was engaging and well told, the characters were (mostly) well developed and I enjoyed it very much. \n\r\nLight was a great character to follow and it left me questioning my morals. It was interesting to see Light develop into the manipulative bitch he became and how he just fell into the madness so easily. Misa deserved better though, she put up with so much and her part of story just ended too quickly. ( ´･･)ﾉ(._.`) L's antics were questionable and it left me wondering who's really",
    "\n                This is one of many anime's that is a must-watch if you are starting out. Even though I've watched this years ago, I can honestly say that this anime is definitely for those who are interested in thrillers. It has a lot of pro's to its name, but this fantastic anime does have its con's.\r\nOne major con that stuck with me, is its pacing. I can definitely say the pacing is pretty slow, and it does take some time to get to the action. But, this con is somewhat overshadowed once you watch past t",
    "\n                This is, by far, my favorite anime of all time. Everything about it was just amazing, with an absolutely awesome storyline packed into 37 episodes. \r\nStory 9/10\r\nThe story of this anime is perfect, and i liked it a lot, because the story was complex and very interesting. I would definitely have given this anime a perfect 10/10 if it were not for the ending! Because of spoilers, I'm not going to say anything about it, but for all of you out there who have watched the anime, I'm sure the majo",
    "\n                Death Note Review \r\n10/10\r\nSo here, after watching it for 3-4 times I think? I 'll make a review for this anime series. Well, it really excites me to the point that I repeated it multiple times, it's obvious right? So here it is.\r\nPLOT: 10/10\r\nThe plot really keeps me going. I love how each other side planned everything, look into every sides, analyze every details of any incidents and the like to arrest or to know the identity of that certain someone who criticize their beliefs. The story ",
    "\n                This anime is absolutely fantastic. Probably the best aspect of it is the whole genius vs genius premise, which is established very early. It's certainly one of the smartest anime I've seen, and the actions Light and L take will leave you speechless by the end of an episode, and you may even have to re-watch some of it to fully understand what you just saw. The art style is semi-realistic and its muted colors sets the mood for the show nicely. The music is a great compliment to the action. ",
    "\n                Deathnote is by far one of the greatest and most original anime i have ever seen.... after clearing that up, let's check out the different fields for this anime that make it so good...\r\n_To tackle the story first. This is by far the main point that boosts this series up. Some of the greatest animes like bleach, naruto, one piece... (not just personal, but judged by many) have earned their current status while having many elements if not most, taken from different animes or shows. And despit",
    "\n                This was a very good anime. while i was a bit reluctant to watch this at first, it drew me in pretty quickly. not to try and make a spoiler, but the first montage of light killing off criminals will forever be stuck in my memory as one of the coolest scenes in any media i have ever watched. i remember getting a chill down my spine as the scene progressed. \n\r\ncharacters are a bit predictable, but overall they are designed very well. L is one of the greatest characters of all time, he is the ",
    "\n                *dont worry, the following does not contain spoilers, i am not a douche bag who is going to ruin it for you without warning*\n\r\nDefinitely one of my favorite anime series out there, the story development and character personalities are intricate and unique. And the mystery/crime solving based storyline makes for great suspense. Even without too much blood or intense action scenes, this anime is sure to deliver an interestingly different thrill ride. The events are thought provoking as the st",
    "\n                A very popular anime that unfortunately is overrated. There are many reasons to love the main characters and the plot. This anime is unique and unlike anything you have ever seen before. However, through all this it is hard to look past the many leaps of logic that characters make and this can disengage the viewer. I was left with a bad taste in my mouth after some episodes. What’s worse than this is when you feel that an anime should have ended sooner or that the authors were forced to con",
    "\n                Death note is truly one of a kind ٩(˃̶͈̀௰˂̶͈́)و From its gripping plot to its complex characters, the series never fails to captivate! I love how they discuss morality in the series. It really makes you question your moralities and the boundaries between justice and evil. There’s no filler episodes, every episode makes me clench my butt cheeks.\r\nI absolutely adore Misa's sense of fashion! Misa introduced me to the world of gothic Lolita fashion, and I’ve been  obsessed with jp fashion ever ",
    "\n                This show is immensely overhyped. \n\r\nThe first half of the show is enjoyable. The plot and character's are intriguing. However, once Ryuzaki (the original L) dies everything goes to shit. Also, I just want to clarify that I'm speaking purely from watching the anime. Perhaps the manga is better adapted.\n\r\nFirst and foremost, the anime adaption of Death Note focuses way too much on the notebook itself rather than adapting the actual characters. The use of the Death Note becomes overly complex",
    "\n                Many people regard this anime as a masterpiece. I can't say I agree to give this adaption that amount of respect or title, I will say that it is a very good animated work. The problems that I find with this adaption happen in verious parts, that bring the whole production down for a select amount of runtime. Although there is one point in this series that it becomes almost unwatchable. \n\r\nWhat I liked\r\nWhat I liked? More like what I absolutely ADORE! In all seriousness the first 17 episodes",
    "\n                Death Note, one of the best crime show I have seen. Story is very good once you connect how realistic is everything that characters are talking about.\n\r\nI would give art a 10, but there's something about talking scenes, they need to be more dynamic than just animating the mouth while talking. \n\r\nI would give sound a 9, so why do I give it a 10? We all have moments when we think about scienece. The music from Death Note is something that makes people feel like they are very smart. Once it is",
    "\n                I finished watching this anime about 2 months ago and I am honestly impressed. I generally started watching anime more seriously in December of 2020 and I was wondering a good starting point so that I could ease into the lifestyle a bit. I saw that death note was the most popular so I started with that.\n\r\nThe story is outstanding as well as the character development that takes place in the anime. Normally, I only like anime's with a lot of action like Dragon Ball or Attack on Titan but, thi",
    "\n                I am probably the 1000st reviewer of this phenomenal anime.\r\nIf you havent watched Death Note yet. Go and watch it right now!!!\n\r\nStorywise it is probably one of the best animes till this day. Its very very catchy and it has a lot of plot twists and you cant stop watching this anime till its over!\r\nThe art is pretty basic aswell as the sound. The characters are well chosen and have brilliant personalities like Light Yagami (main protagonist), L and Ryuk.\n\r\nEnjoyment is always there.\r\nThe on",
    "\n                Death Note was one of the first anime related texts I ever watched. It's a great starter. The story is fairly simple, yet very engaging and captivating and because of that I finished the whole show in a few days. The show explores the ideas of justice from two completely different characters' viewpoints, and allows the viewer to question the ideas the show presents. As a psychological thriller, the action of this series is almost entirely mental or conversational, as each antagonist attempt",
    "\n                little spoiler\n\r\nfor me it end in episode 27(or rather 26) i watch next 2 episodes but quality of these episoes go rapidly down. i even ask lot of people(something about 11-13) who saw whole death note  and they all agree with me on that and told me if idon't want to spoil(disgusted)\r\n the viewing experience from episodes i watch until now i should stop watching and remebre it as good anime. obviusly i dont belive them and after 26 episode i watch 3 more and i stop bcs story is terrible and",
    "\n                Death Note is my favorite anime and I think it could be for several reasons:\r\n1. The story behind the action is an original one that I have never encountered in any other anime, with extraordinary potential.\r\n2. The characters are perfectly described and presented, perfectly matching the story.\r\n3. The animation is a great one for an anime from 2008, MADHOUSE doing an exceptional job.\r\nThese were just a few of the many arguments I tried to show you that Death Note anime is the best anime.\r\n",
    "\n                (biased) Death Note is by far my favorite anime of all time!!!!!!!!!!!!!!!\n\r\nstory: 10. also, unpopular opinion, but i prefer the latter half to the former. will i elaborate? no\n\r\nart: 9. one of the best styles in anime i've seen but there are noticeable hiccups in the animation here and there not to mention that the first half's overall art is marginally worse to the second's. \n\r\nsound: 10. i can only assume this means sound quality but i'll also include this; the English dub had no busine",
    "\n                HUGE SPOILERS ALERT!!!\n\r\nComplete masterpiece, i think i was lucky that this was my first anime because if it was bad i would probably drop anime but luckily i did not. this anime is a MASTERPIECE. The characters could be better but i dont mind. this anime deservers a season 2 even tho Light died, Ryuk did not (obviously) and i feel Ryuk could drop the Death Note again and there you have it season 2. i dont feel like calling out every detail of the anime but its very good. do i recommend it",
    "\n                Death Notes story is probably one of the best stories of all anime. You cant decide if you want to be on the antagonist side or the protagonist side. They both are good convincers and you just cant decide on who you want to win. \n\r\nThe art style of Death Note is also good. Its unique and there's no other way I can explain it. \n\r\nThe sounds in Death Note make the show the way it is. Makes it mysterious and intense.\n\r\nThis anime was so enjoyable and just overall a 10/10 for me but everyone ha",
    "\n                One of the best psychological/thriller and detective mystery anime. It delivers it's fame so perfectly!\n\r\nThe story is just excellent, I never felt that 'this was a bit fictious', it's set very perfectly and balances the win of the main character and it's enemy. The dialogues and background music for each situation, character is just awesome. \n\r\nEach character has it's own intro and background music and they're just awesome! The personality between the main character and it's enemy is just ",
    "\n                Ending is one of the worse endings I've seen. Near, L, and Mellow are all annoying, especially Near. The endings are all plain. Only the first opening is half decent. I've listened to ear rape with better audio and visuals then the second opening. After episode 30ish the story drops off. Shoulda ended it there, everything after that seems to be like sucky second season. Watch something worth while, this is only good if you have nothing better to watch. As for the good part. The story is rea",
    "\n                I gave the story an 8 and everything else a solid 9's across the board.  The story would have gotten a 9  if I rated it on or before about episode 20, and an easy 10 if it was within the first 5-10 episodes or so. Without giving too much away, it's hard to explain why -- but I just felt that certain plot arcs were drawn out longer than they needed to be, certain characters didn't need to be introduced to the story at all, and certain others should have stuck around until the end. All in all",
    "\n                Death note's writer Tsugumi Ohba and manga artist Takeshi Obata are geniuses for the formulaton of mystery and the difficult layout of this series! The idea of a notebook combined with the character's brilliance made it a great watch!\n\r\nDeath Note concentrates solely on plot and the pyschological thriller aspect. The plotline was  psychologically good. The protagonist turns into an antagonist. A girl is devoted to her feelings rather than killing, and she would die for the one that she love",
    "\n                Death Note is by far one of the most interesting anime I have ever watched. The storyline is very unique and the main characters are far from boring. This anime plot is just so different from all the other anime plots I've come across. The story is very suspenseful, but luckily there is some comic relief in most episodes. The characters are all very different, and it's hard to hate any of them. This anime will definitely get you thinking and it will definitely keep you at the edge of your s",
    "\n                MAJOR SPOILERS, DO NOT READ UNLESS YOU’VE SEEN THE ANIME\n\r\nEM Forster in his book ‘Aspects of the Novel’ defined the plot of a story as its sequence of events along with their timing and causation. Given this I will argue why Death Note has a great plot.\n\r\nIf you ask “Why did this character make this decision?” then you will almost always find that the author has an understanding of human motivations which exceeds that of most if not all other writers in the anime industry. The first two ep",
    "\n                First of all, I want to say that I LOVE Death Note. It was one of the first animes I've ever seen, and it's been my favorite to this day. The story is fantastic. 9/10. A book that kills someone just by writing their name is such a great concept that really leaves you thinking.\n\r\nI rated sound 10/10. While I wasn't too fond of the second opening, it eventually grew on me, and I feel that it represents the second half of the show well. Not only that, but the soundtrack throughout the show is ",
    "\n                A fantastic piece of work given how well the story advances and characters reach their respective conclusions and yet remain significant till the end. All episodes of this anime prove their relevance and none are boring or slow paced but play pivotal role in story progress without giving much space for viewer to relax or quit it, probably except for tea drinks or cake savuoring ones. This makes it one of the greatest anime that keeps viewers on edge of their seats as story traverses through",
    "\n                For me death note is personnaly the best anime i ever seen and read :) ! I enjoyed this manga so much :) !! <3 As a child this was my first anime and i enjoyed it so much ! This anime is really cool for beginner in the anime world ! \n\r\nThe atmosphere is really cool and you get to like all the main characters really quick :)  The animation is perfect and the sound environnement is great.\n\r\nHope you guys will appreciate it because it's clearly dope and when you started you cannot stop to read",
    "\n                Story: 10.\r\nProbably the best thing about Death Note is the dynamic story that has you enthralled throughout the entire 25 episode story. L and Light's interesting dichotomy and intense religious symbolism, as well as the wonder of watching L and Light clash.\r\nArt: 7\r\nNothing special but very solid character models. \r\nSound: 10\r\nThe sound REALLY punctuates every moment of the show, especially shit that probably wouldn't be nearly as exciting without the insane ost, such as the infamous pota",
    "\n                       This is one of those anime that you always come back to.  I was spoiled to have watched this when I did because this is one of the first anime I've watched just coming off of great anime like Naruto and Dragon Ball Z.  I love this anime for it's intriguing characters, plot, and premise.\n\r\n    The story is gripping from the get-go and the characters Light and L are written so incredibly well, not to mention the soundtrack perfectly compliments the anime.  Their isn't even much to say ",
    "\n                Includes spoilers\n\n\n\n\r\nI know i'm late to the party, but here's my review.\n\r\nStory: The concept is a very unique one, and pretty well executed as well. The majority of the series is occupied by the L arc, which was basically a huge cat & mouse chase. L's aggressive decisions forced light into very hard positions which he always got out of, and it was well written. The Near arc wasn't as bad as people said, in fact I enjoyed it more than the L arc (probably because I was spoiled for L's deat",
    "\n                9.02\n\r\nI really don't feel adequate writing a review for this series, I don't feel I can do it justice.\n\r\nI will say, that its story is extremely well put together and its hard to find plot holes. I suppose the author did have to be smart and patch all the holes in the story due to the intelligence of the main character, so that makes sense.\n\r\nMy one complaint is that the story did not really make me feel for the characters, I wish there was more background to the characters and mabey some ",
    "\n                Death Note is one of the most expressive and unique anime out there. A constant battle between wits, no matter the parties involved are always interesting and most importantly, very well illustrated. \n\r\nThere's a lot of philosophical and life lessons one can take from an anime like Death Note, as it portrays multiple characters from different angles. There's no good or bad, and in this sense Death Note somewhat even challenges the viewers perspective of what's good and evil.\n\r\nWhere the art",
    "\n                Death Note has everything a good anime needs. The action is continuous, the music is great, and the characters are enjoyable. The character arcs are very well made too, and the animation is spot on even though this anime is over 10 years old. L is a good character that is probably the weirdest and smartest person in the anime, and Light changes a lot throughout it. The Death Note is a godlike object that Light takes advantage of multiple times, not only using it for it's main purpose. And t",
    "\n                What can I say about this amazing anime that hasn't already been said? The story pacing up until a certain part was very nicely done. (won't spoil too much for those who have not seen it yet). the characters were voiced fantastically, both subbed and dubbed. The show had a few twists that I was not expecting to happen, and the way you just watch everything crumble. Highly suggest this anime. Light and L have one of the best Rivalries I've seen in an anime. Both incredibly brilliant and refu",
    "\n                This is a masterpieces. I think this is best anime series ever until now. Nice plot and nice ending. Although this genre is fantasy and may not occur in the real world but this story is really interesting. Tells a smart student who is fed up with all the crimes that occur in the world and wants to eliminate all crimes that occur. All such things are very good and wise but LIGHT is so ambitious that he forgets his humanity and wants to be God to punish anyone who has different views.\n\r\nThe t",
    "\n                Death Note has one of the most interesting, unique, and exciting stories in anime. The story poses philosophical questions that not many anime do. The first half of the anime is spectacular. The second half of the anime is still really great but it can get a bit confusing. The story does a great job at keeping you engaged to see how it ends.\n\r\nAll of the characters are very well written. They are all very human since they are all flawed. It’s always enjoyable to watch the characters and how",
    "\n                *Review contains spoilers*\n\r\nStory 9/10 \r\nThe story was really compelling and each episode kept you at the edge of your sit and wanting more. The story is intriguing and you often find yourself creating theories that are never spot on with what actually is going to happen!\n\r\nArt/sound 8/10\r\nIf you read my reviews, you will know art/sound are no my forte. This anime looked good to me (but I am not too picky in regards to drawings looking old or recent).\n\r\nCharacter 9/10\r\nWhat a mastermind Li",
    "\n                death note is a masterpiece and definitely a go to for people who have not watched anime before. it is perfect to hook people into watching anime. The plot was well written making death one of the best supernatural thrillers i have watched. The only problem with the series which made me give it 9 out of 10 is near. As a character itself i did not have any problem with near the only thing was that the story felt like it was rushed after near was introduced leading death note from a different",
    "\n                In my opinion, the anime was very good, one of the best I'd ever seen in fact.\n\r\nI enjoyed it. All i can say that every bit of the anime was amazing; the art was good, i thought it was quite a bit better than the average of all the anime I've watched; the story was brilliant (this might be biased because i like crime and mystery); the OST queues were well thought out and the characters weren't just lifeless and boring, there were quite a lot of emotional and entertaining scenes.\n\r\nHowever t",
    "\n                Death Note was an amazing anime. I like how short this show is. There was not a single episode that I disliked. The whole show just seems to work. The writers and animators master the vibe of this anime. A character could be doing some mindless and meaningless task and the writers could get me hyped up due to their masterful use of exciting music and exaggerated animation. This show is the perfect introduction for anyone looking to start anime and I would recommend it to anyone I know that ",
    "\n                SPOILERS:\n\r\nI just finished watching Death Note. Yes, I know I'm late to the party. It was a very good show... up until L died and a few episodes after that. \n\r\nStory: 8/10 - Was great until L died but I wasn't very satisfied with how it ended. I was expecting something big like a final standoff but instead we had a cheap immitation of earlier duels of Light vs L.\n\r\nArt: 10/10 - From colors to art style, everything is perfect. There are so many smaller meanings in the art that you pick up o",
    "\n                Death note is a unique and a guarantee Masterpiece story \n\r\nStory=10(Story started so fast but you see what happened and why it happened and who is the rival you will see how good is the story and it so freaking unique the one who write it is so good on think on Uniqueness)\n\r\nPlot=10(this anime didn't definitely lack the plot and the plot are interesting in some way \n\r\nArt=9 (art is good even though it's old anime which make this anime average)\n\r\nCharacter Development=10(the character devel",
    "\n                Still to this day I am in search of an anime similar to Death Note and still I cannot find one. If that doesn't speak volume to the creativity of this anime then I don't know what will.\n\r\nWhat separates Death Note from the rest of its class is its characters first and foremost. Yes, the idea of a book killing those whose names are written on it is also an amazing original idea, but the awesomeness of the plot takes a backseat to its characters as most good media does. After all, characters ",
    "\n                Death note was a really great, solid, and entertaining show for its exciting premice and great character relationships. Unfortunately, two of the three most interesting supporting characters dies (one dies too early in the show, the other had to die so I guess I can't complain), and the third kind of stays important but kind of gets written off. Episodes 1-25 are great. It declines in quality a little but its seriously great stuff. After that its ehhh. So if you don't mind definitely give i",
    "\n                Death Note leaves the viewer riding in suspense as it presents intellectual battles between an egotistical genius and those intent on taking him down.  This is the main draw of the show.  It's been said before, but calling Death Note a \"cat and mouse game\" is probably the most accurate way to describe it.  This is one of the easiest anime shows to recommend, especially to those who are relatively new to anime.  \n\r\n[Story] The overall story is well written and well told.  The execution isn't",
    "\n                This show is an incredible journey exploring the way that the Death Note affects human society and especially the ones who possess them. The show is like a roller coaster that moves very slowly.  It also features some of the most incredible characters I have ever seen, L and Ryuk in particular.\n\r\nPros: Original characters, OP and EDs are heavy music but deeply symbolic, musical score is deep, the tension created by the dialogue is fierce and meaningful, and the show combines Western religio",
    "\n                You won't regret watching this gem of psychological thriller anime!!!\n\r\nDeath Note was the first anime i ever watched so it has a special place in my heart. But that aside, i love anime's that keep you on your toes and make you think about them long after each episode, that was exactly what Death Note did. The characters are amazing and have very unique personalities and, THE PLOT IS AMAZING, it is so well thought out/written and is full of suspense and i honestly couldn't get enough. I lov",
    "\n                First and foremost, this series is a bad adaptation of his manga. \n\r\nNot for lack of faithfulness, because the anime respect most of the themes of the manga; but it's a bad adaptation for the fact that it makes its themes obvious. \n\r\nThis is do to he plain religious metaphors and an excitement that the director tries to transmit in almost every scene, which, in the end, is kind of ridiculous.\n\r\nWith its evident flaws, it still is an ejoyable show. It 's very easy to follow, fast paced and w",
    "\n                Here it is. The infamous anime by the name of Death Note that took the anime world by storm in fall 2006. Studio Madhouse was not pumping out 2-3 anime a season anymore and went back to their ways that made the Studio such a powerhouse a few years prior. The director chosen for the role was an ambitious story board guy by the name of Tetsurou Araki whom later went on to direct some other hits like Attack on Titan and Guilty Crown. Death Note is a different anime to say the least and in the ",
    "\n                This is a story of the ultimate cat and mouse game where the lives of many solely depends on who can outsmart the other. Death note creates an idea of what happens when one is given the power over another human life and showing that absolute power corrupts absolutely. \n\r\nThe anime tells the story brilliantly and every episode keeps you wondering what will happen next as how a good story should. The characters are well thought-out, showing the viewers different perspectives of what people be",
    "\n                I found Death Note to be great, dramatic, supernatural and suspenseful!  I highly recommend this anime if you also like protagonists who evolve into villains.\n\r\n-Story-\n\r\nThe story is overall very good.  I found the first half of the series better than the second, though.  There's so many twists and turns in the plot and the tense battle of wits between Light and L create so many nail-biting moments that keep you on the edge of your seat. \n\r\nWhat I find really good about this anime is that ",
    "\n                As you can tell I didn't completely hate this show. I actually really wanted to love it and up until a fixed point, this could have been in my top 10 easy.\n\r\nThe art I gave a 7, it's solid nothing to complain about here really. It just wasn't over the top enough to be more than good.\n\r\nSound was fine, I enjoyed all the music and the sound quality in both sub and dub was fine so 7 here as well.\n\r\nStory: I gave this a 5.The plot in itself is fine and interesting but the way they go about it a",
    "\n                The Death Note is a notebook used by Shinigami to take the lives of human beings, but if it comes into the possession of a human he too can wield its power. Brilliant high school student Light Yagami is bored with life until the day that he finds a Death Note on the ground. When he discovers that its power is real, he becomes determined to create a utopian world free of crime. As Light kills criminals through supernatural means, he becomes known as \"Kira,\" gaining followers and adversaries.",
    "\n                Though it may seem I'm rating this show a little too high, I really, REALLY, enjoyed this anime.\r\nIt was one of my first animes to watch and I was surprised.\r\nThis show had raised my standards for other animes and made me think every other anime was just as good or better. (Which now as I get more involved in shows I know better...)\r\nThe characters were all unique and interesting, the story was fantastic and the creators really knew how to pull at your emotions.\r\nAnd yes, an important chara",
    "\n                This anime was a big disappointment for me because I heard great things about it from my friends and got told to watch it because it was great. Although it did start out as a great anime with a very interesting plot that gets more exiting as it goes along it falls off real hard when one of the characters that is really important to the story dies. From there on it just goes downhill and never gets better.\n\r\nStory- Like I mentioned above, it started really great, learning how the death note ",
    "\n                I'm not going to bother writing a long explanation as to why I didn't enjoy Death Note. Before this I thought Akira was the most overrated thing I've ever watched. But no, this show baffles me at how popular it is. \n\r\nEverything from the main character becoming evil over the course of what, 3 episodes? To having episode after episode of \"HE KNEW I WAS GOING TO DRINK THE COFFEE, SO I REPLACED THE COFFEE WITH WATER AND PROCEEDED TO DRINK. I KNEW AT THAT MOMENT HE WOULD BE WATCHING SO I MADE S",
    "\n                Pros : \r\n-Promising concept\r\n-Catchy pilot episode\n\r\nCons:\r\n-Takes its audience for idiots by explaining everything\r\n-Takes itself too seriously\r\n-Extremely slow, some episodes are full of inner dialogues and dialogues that leads to nothing\r\n-Beside the two protagonists, all the characters are forgettable\r\n-Not a really dynamic score, same couple of tracks playing every episode\n\n\n-Second half of the series just goes completely silly and over the top\n\r\nI don't get the hype, this anime wants ",
    "\n                Death Note, to me, is a wonderful example at just how interesting and enthralling an anime, or indeed any story can be. Great story, great art, wonderful characters, but only a 6/10?\n\r\nYes.\n\r\nWhile Death Note is a perfect example of an enthralling story with wonderful characters, it's also a good example on how the removal of some characters, especially anticlimactically can easily break a story experience.\n\r\nWhile the first half was a wonderful masterpiece, I struggled to watch the remaind",
    "\n                Classic, solid anime. World building is great, characters are great. It's one of those classic starter anime, easy to understand and wrap your head around while still leaving you on the edge of your seat at parts. They really portray the characters amazing, even the characters you're meant to not like some how you feel like you understand them almost to a point that their crimes don't matter. On the other hand, I wish they went farther into Shinigami lore like they did in the manga but the ",
    "\n                I'll begin by saying: this anime does not contain any fight scenes. However, it doesn't need them to grasp your attention, as you are gripped by tension from the get-go. \n\r\nThis was my first ever anime, and years down the line I still highly rate it and rewatch it. The characters themselves are well thought out, and despite my knowing what happens next when I rewatch it, I'm still amazed by their thought processes and design. You have a top achieving high school student up against a recluse",
    "\n                 There are so many things I like about death note and so few things I dislike about it. Starting with what I like about it is its unique plot. I honestly never heard of a show or movie similar to it. I also enjoy that most of the main characters are not your typical, plain, boring anime character, and their personalities and wits are what keeps the show interesting and also helps move the story. \r\n    There are only two dislikes that stand out to me after watching the show. The first dislik",
    "\n                There are a few things in the world that can't be replicated in this world and one of those things is Death Note. This anime is a true masterpiece, everything about it is perfect. \n\r\nFirst off, I can't believe this anime was created in 2006 the animation is very clean and has a lot of detail to it. Madhouse did a great job with all of the animation aspects of the show. \r\nArt/Sound: 10/10\n\r\nThe story is very unique we have a smart high school boy who picks up the death note to change the wor",
    "\n                Death Note is an anime that I feel is under appreciated when it comes to the majority of anime fans. While it is one of the most popular anime's of all time as of right now, I feel like people don't appreciate the plot and deep thinking that comes to this show. From the critical thinking from L and Light, it was something that truly baffled me when watching this anime.\n\r\nStory (10):\r\nDeath Note is the story about Light Yagami, who is presented with the ability to kill anyone by simply writi",
    "\n                Death note... One one the greatest police animes out there and one of the most interesting stories out there... I'll be reviewing some aspects of it like story and art etc...\n\r\nSTORY:\r\n-The story is amazing and just the thought of someone making that kind of story is making me look up to them, Maruyama Masao is genius behind this work and i don't really doubt any parts of this anime its just to amazing.\r\n-I loved the story because it keeps the one watching it interested in it so you don't g",
    "\n                Death Note was my first anime and I can definitely say its a great beginner anime. The story, the suspense which makes you feel like watching next episode right now. If you are an anime fan and didn't watch Death Note, You are missing a great Masterpiece.\n\r\nThe Story Is Well Detailed and The Details are Fascinating too.\r\nThe Character design was great overall.\r\nDeath Note has a great soundtrack.\r\nI really Enjoyed this show so I would strongly recommend everyone to watch it.\n\r\nThe art of Dea",
    "\n                Death Note is an amazing anime, it was my very first and it got me instantly hooked on anime. It's story is really well written, the characters are for the most part really likeable and interesting, the soundtrack is great and the animation holds up well. I have rewatched this multiple times and it was enjoyable every single time.\n\r\nLight Yagami is one of the best protagonists in anime and L is an amazing antagonist.\r\nBoth of these characters are very memorable and them attempting to one-up",
    "\n                SPOILER ALERT! SPOILER ALERT! SPOILER ALERT! SPOILER ALERT! SPOILER ALERT!\r\nSPOILER ALERT! SPOILER ALERT! SPOILER ALERT! SPOILER ALERT! SPOILER ALERT!\r\nSPOILER ALERT! SPOILER ALERT! SPOILER ALERT! SPOILER ALERT! SPOILER ALERT!\n\r\nThe dialogue and screenplay between Light and L is very, very well written. It's on par with some of hollywood's great crime thrillers like, No Sudden Move, The Departed, Seven.... I would've given this 10/10 if the series ended with L's departure, but they went on ",
    "\n                100/10 Best anime I have ever watched, a masterpiece.\n\r\nThe Story 10/10\r\nOne of the most unique, creative and interesting plots I've ever seen. It keeps viewers interested and glued to the series, while maintaining a steady pace throughout. It really gets you thinking about the world and how you perceive yourself. Death Note has changed my life to be more mindful of my surroundings and the people I surround myself with. \n\r\nThe art 10/10\r\nThe art is absolutely outstanding for its time period",
    "\n                Death note is, and always will be, a favourite. There's a reason it's so widely loved - I honestly can't pick out anything I didn't like in this show. The characters are brilliantly written and don't fall into some of the bland and overplayed stereotype roles often found in anime. The plot itself is highly entertaining, and you never quite know what will happen next. This show puts a fun spin on the classic cat and mouse game, and this is one of those shows that I couldn't stop watching. \n\r",
    "\n                Death Note was released in 2006. Even after 14 years, why weebs are suggesting to the newbie's as their path to anime. So let's see about it.\n\r\nStory :-\n\r\nThis is the main reason why weebs are suggesting to everyone. It was well written, and the story goes in a correct path (not like monogatari series) with twist and turns which it is staggering.\n\r\nArt :-\n\r\nYeah! it's an 14 years old anime, you cannot expect any more from it. Madhouse have given their wonderful effort for it .70% of the art",
    "\n                Deathnote is one of my favorite animes I have seen so far. Its absolutely amazong. The story is very cool not too hard to follow and is relativly simple. The back and forth between L and Light is pretty hard to follow I had to rewind sometimes to understand cause they are too smart for me. But the back and forth is fun to listen to when they go at it. The characters I thought were all great. Light and L of course are the best two in the show and I prefer L over Light and was rooting for him",
    "\n                An incredibly average anime that is also outdated. Better experienced in manga form.\n\r\nWhen I say that, I mean it. Every bit of the magic in this anime comes directly from the manga's story, and the parts it had to fill in for itself - animation, music, and pacing - fall apart in every way. \n\r\nThe main force behind the story is the mindgaming between Light and L. It is clever and thought-out, but nowhere near perfect. For one, the story attempts to scratch at, but never actually achieves, t",
    "\n                MINOR SPOILERS IN REVIEW\n\r\nDo not get me wrong, this has been one of my favorite anime for ages.  However, the major gripes I had with this caught up to it.\n\r\nFirst, the good.  The protagonist and antagonist are amazingly designed.  I often caught myself on the edge of my seat each time they came close to catching one another.  When Light has his ups and downs you are right there with him.  You feel euphoria when he gets what he wants.  A specific example of this to anyone who has watched i",
    "\n                The characters (especially the antagonist) are hyper-intelligent in their ways and design, a 10 for great villainy. However, they did not grow well in their development enough to lead to this number of episodes, which leads me to believe the writers should have combined at least a couple of the later epsodes in order to be a perfect anime. Who cares about that when anyone who hasn't already will enjoy this series and all it has to offer the globe, especially a solid introductory anime of pe",
    "\n                Death Note\n\r\nAnimation – 9/10\n\r\nDeath Note features high-quality animation that effectively complements its dark and intense narrative. The visual style is crisp, with meticulous attention to character expressions and atmospheric settings, enhancing the overall viewing experience.​\n\r\nStoryline – 10/10\n\r\nThe series presents a gripping and morally complex narrative, exploring themes of justice, power, and the human psyche. The cat-and-mouse game between Light Yagami and the enigmatic detectiv",
    "\n                Death note is the first anime that I have watched in its entirety. The main characters are well developed and the plot is well written. The side characters also further build the story-telling. Objectively if we see, there are many other animes that have as good a plot as this, but Death Note wins over them all if we include the OST. The music is extremely well-suited and blends beautifully throughout each episode of the series, aiding the story telling and unique character development. Con",
    "\n                history\r\nToo innovative for its time, which is why it was so successful, L and Kira engage in an incredible cat and mouse duel.\n\r\nProtagonist\r\nlight and a good villain at first he was a hero but the power went to his head and he ended up becoming a villain unfortunately.\n\r\nCharacters\r\nWell done, Kira's father and his assistants are very well done in the first season, in the second some are too forced but still interesting.\n\r\nSoundtrack\n\n\nGreat, they chose very well, the songs were very well",
    "\n                A classic, and a must watch. \r\nThe story is fantastic, however some parts that we can agree are a bit...iffy, but overall it's very good. The music is outstanding, and the characters are awesome- the  character development is amazing and we get a true glimpse into each character's true identities. \r\nWhat bumps it up to a 10 is the amount symbolism in the OP, foreshadowing and the effects of the death note on the users and the one's around them.\r\nDeath note is definitely in my holy trinity o",
    "\n                Death Note is one of the best and most amazing anime I have ever seen!  My anime rating is 98%, (2nd place in the top 10 anime list).\n\r\nStory : 10/10 \r\nThe story is a masterpiece and a great genius from the author, I have never seen a similar story, intelligence plays a large role in the story and this is what makes it really special.\n\r\nArt : 10/10 \r\nDrawing and animation is very excellent, although it is considered an old (2006) anime, its production is better than the current 2020 anime.\n",
    "\n                Despite Death Note's solid main cast of characters, great soundtrack, strong visual symbolism, strong thematic ideas and at times clever plot points, I still do not enjoy it. My problem lies with how much exposition and dialogue plays integral roles in developing the narrative, crushing the pacing and storytelling in the process. The problem magnifies when not every part of this series is as clever and intricate as it attempts to express. Intelligence and calculation are the pillars of this",
    "\n                Reviews if you don't have time.\r\n*SPOILER-FREE*\n\r\nFrom time to time appears a show that reaches everyone’s ears and, with time, every medium, time during which, it shapes himself into an icon and that, that is what “Death Note” can be describe as. It is a manga adaptation by studio Madhouse steering the animation and one of the most beloved shows in the 2000’s.\n\r\nThe art, if you could put it into few or one word, would be: amazing. From the scenes and shots in the opening all the way to the",
    "\n                Extremely outstanding anime it's my first anime to watch, this is the anime I chose to begin my journey into the anime world, definitely worth watching. The story is so perfect and unique and requires a high IQ to understand, the main character got some nice development, it might be old but Death Note will always remain in the top no matter how many animes shows up. This anime considered as the beginning for many anime fans, the only small little downside is that some characters won't make "
]