[
    "\n                Death Note is definitely one of the best anime series of all time, for it presents a deeply unique and compelling story rivaled by few. I can truly say it is one of the best, if not the best anime I've watched.\n\r\nStory: The story is unique. A notebook falls from the sky, and the human who writes a name in it is capable of killing the individual pictured in his mind (I left out the details that you don't care about). This presents the viewers with a highly debatable theme based on morals and",
    "\n                Allow me to explain my love of \"the pay off\" in entertainment:\n\r\nI hate when I watch something, and it doesn't really matter if I'm following it or not because nothing pays off.  So many times I the credits of a movie roll and I'm left stupified thinking to myself \"That's it?  What about the ___ and the ___? What was the point of me paying attention to the first hour and 20 minutes of this film?\"\n\r\nSome shows or movies set little subconscious mental snares, so that when something happens la",
    "\n                May contain light spoilers...\n\r\nDeath Note is a solid series with some brilliant moments in it, but some equally ridiculous ones too. Most of it is pretty much the same thing: a long-ass cat-and-mouse game that keeps taking turns going for and against the two lead foes. Early on it's rather boring as you watching everything take it's time to pick up, and there's even an episode that consists almost entirely of two characters wandering around aimlessly that get real boring real fast. Once th",
    "\n                Warning: Spoilers\n\r\nI wanted to like this. I really did. And I did for about the first 10-15 episodes. Death Note is probably the most popular anime ever, and when I read the summary, I could see why. After viewing 27 episodes and reading a summary of the subsequent 10, however, that opinion has changed a little bit. \n\r\nFirst, a review of the things I DID like:\n\r\nA) The Concept. Notebook that kills whoever has his name written into it, death gods that love apples, and two genius teens: one ",
    "\n                Q: What happens when an unstoppable Mary Sue meets an immovable Mary Sue? \r\nA: Death Note. \n\r\nThe protagonist, and his adversary, are both genius pretty boys (with the odd names of Light and L) who have an incredible amount of achievements and skill for their young age. Light somehow predicts things that he could not possibly have the foresight to predict, because, you know, probability is a thing.  Don’t worry though, it’s not like you know that he’ll always win, because L possesses this e",
    "\n                This has to be one of the most ingenious shows ever!\n\r\nYagami Light finds the Death Note, a notebook he found falling down from the sky one day. If he knows someone's face and writes down their name, they die.\n\r\nSo, he wants to kill all the criminals in the world with this, and he gets off to a good start. But then this legendary detective - L - is set to stop him. So starts the battle of the extraordinary geniuses. Yes, they're geniuses. And the same can be said about the ones who created ",
    "\n                Death Note will forever be the best suspense anime for me..... and millions of fans.\n\r\nThe anime starts off Light Yagami, a brilliant college student. While walking towards home, he stumbled upon a notebook that has the word Death Note written on it. As soon as he finds out that the notebook can easily kill off anyone by just knowing the name and face of an person, Light only desire for one thing. To be God of the new world that he will create by erasing all unjust people of the world. And ",
    "\n                The #1 popular anime on this site, and perhaps in the world. But does Death Note deserve all that popularity and praise? People are entitled to their own opinions based off of how they perceived (if there were any) the themes in Death Note, and how much people individually enjoyed the anime. But this anime is definitely one that EVERYONE should watch and decide for themselves how much they like/dislike it. If you haven't seen Death Note yet, then I'd definitely recommend you to watch it, be",
    "\n                Death Note is probably one of the best series I&rsquo;ve ever seen. What I really like about it is that I feel the need to pay attention &ndash; that rarely happens with the other series I&rsquo;ve watched. If you blink too much you might miss what&rsquo;s happening.\n\r\nEverything that happened was just so interesting. The details are always so well thought of and there are little to no loopholes. I think something major happens in each episode. I always have my jaw dropped at the end of eac",
    "\n                Death Note\n\r\nBefore you read this review I want you to know that a &quot;10&quot; does not mean perfect, because nothing is perfect. A rating of &quot;10&quot; is what MAL says it is, &quot;outstanding.&quot;\n\r\nStory (10/10)\r\nI'm not going to bother writing a synopsis of the preface of the story since you can read one if you scroll up a little. So moving onto to what I thought of it:\n\r\nOne of the things I loved about Death Note is I felt the need to pay attention. If you don't, you're going",
    "\n                When approaching Death Note it is important not to let any preconceptions you may have about the series cloud your vision of the series itself. Being one of the most popular anime/manga series of recent times, means that it has its fair share of both advocates and detractors. In fact it is easy to have already formed an opinion on Death Note without having watched a single episode or read a single volume.\n\r\nSo, does it live up to the hype? Is Death Note a series worth watching? Well, the an",
    "\n                “The human whose name is written in this note shall die.” – Death Note\r\nImagine one day you come across a notebook, but it’s not like those notebooks that you can buy at the nearest bookstore for a buck or two. By writing someone’s name on that notebook, you can kill that someone. What would you do? Would you kill those people who bully you during your grade school? Would you kill those who rejected you when you confessed your love? Or would you…?\r\nThe story of Death Note starts when a perf",
    "\n                This is a unique show that brings a new meaning to the concept of &ldquo;Death Gods&rdquo;. Death Note would have to be the finest written non-action, non-romance anime/manga of our time, with a story that can easily get you hooked. ^_^\n\r\nThis is the setting of this incredibly unique show. From the summary it may not seem like something worth watching but the first two episodes are capable of getting almost any anime fan hooked, to this thought-provoking show. Underneath all the death and n",
    "\n                To tell the truth, there are very, very few animes that I really disliked like this one. Actually, dislike is a euphemism. I should say, I loath it. And for good reasons. \n\r\nI know lots of people think Death Note is one of the masterpiece of the anime-manga industry and that is also why I forced myself to watch it till the last minute. But as I was going through this anime, disliking it more with every episode, I really thought that it was probably me not grasping the full subtlety of the s",
    "\n                I might be the only living anime fan that hasn&rsquo;t enjoyed Death Note.  The reason really is because it seemed to be gimmicky to me.  It doesn&rsquo;t mean this series is in any way bad, no not at all, it just isn&rsquo;t my cup of tea as they say.  After about half the series I began to feel less and less like finishing, counting the number of episodes I had left to watch.  To be honest it is a quality series with many and more good features, themes, characters and ideas, but it just d",
    "\n                Death Note was probably one of the first anime series for which I read the manga first, but that's the main reason I was disappointed in it.\n\r\nSTORY - As I said in my review of the manga, I find Death Note's story impressive in many ways, the most prominent of which is its ability to deal with such serious and controversial issues without offending or alienating anyone. The themes in this series are some of the most relevant and volatile ones I've encountered in a long time, and I really ad",
    "\n                Death Note is areally wickid awsome anime that is pretty much one of the best. Everything about it is pretty cool and set up well so thatalso makes t a good anime to watch.\n\r\nStory: Death Note is about a 17 year old student names Light/Ratio Yagami who one day stumbles apon a book called the &quot;Death Note&quot; that the shinigami Ryuk droped into the human world from the shinigami world. After a few days of playing with the death note Light meets Ryuk. Because is trying to make the world",
    "\n                Basically a brief summary of Death Note from my point of view:\n\r\nDeath Note is a show that needs no introduction at all. The name is on pretty much everyone's lips, the people who have watched it or not and one thing which is certainly true is that if you aren't living under a rock all this time there's a very good chance you have heard the name atleast once in your life. It's one of the very few mediums that have crossed boundaries of it's specific origin and in this case, anime. Yes, Deat",
    "\n                We always have this inkling feeling that we can change human nature for the better. That change would be to wipe all scum and villainy off the face of the earth to ensure that we can protect the ones we love and make the world a better place. Idealistic angst plays a role in it, perfectly fitting Death Note’s theme. \n\r\nThe quote signifies the theme in such a way that characterizes the plot involving our protagonist, Light Yagami, who stumbles upon a notebook that can kill people by writing ",
    "\n                In fixed world, you won’t kill your neighbour because he ate your lunch, or kidnapped you daughter, but if he will threaten to kill, you might do that as self-defence, or even to kill to save other one. But when it comes for murders after the murder happen, usually the question if he’s deserved to be killed is divided, not because he’s not worthy of living but because he can kill others. Thing is, most people are afraid of dirty their hands, no one would wants to kill him, but if there woul",
    "\n                I have to say that even though some elements of this series can be a bit predictable, it is still effectively cerebral. It’s one of those stories where it’s not about the destination, but about the journey. This anime is very methodical with its approach to further openly re-defining the classic good vs evil battle, and keeps other aspects at a certain ambiguity that opens up a lot of legitimate debate and discussion, such as the morality in relation to this anime, though the creators of th",
    "\n                \"Ever get the feeling of being cheated\" because that's what I get about \"Death Note\".\n\r\nYagami Raito(Light) is your average high school student who just happens to hate the world (the reason, just because), one day he finds the death note a strange notebook that apparently can be used to kill people with just knowin their name, taking it as seriuosly as a chain letter he tries to prove the \"functioning\" of the book by writting in it the name of a criminal who saw in the news, short after th",
    "\n                Overview:\n\r\nDeath Note is one of the most popular anime ever to air on Cartoon Network's Adult Swim block. It is obviously  an anime that most otaku and even non-otaku are familiar with, but if you aren't I will give you some examples of the things this show did great and some things it could have improved on. \n\r\nWarning: minor spoilers. I mention a character dies, but I don't say which one.\n\r\nStory: 6/10\n\r\nThe story starts out with a very interesting premise about a brilliant student named",
    "\n                This review was first written back in 2017. Now in 2021, I think it's time for an update. Way back when, I originally decided to watch this anime because a friend of mine was practically begging me to. I was a high school student at the time who had ambitions on majoring in criminal justice once I entered college (a plan I did start, but have since changed), so I was intrigued upon reading a synopsis that pretty much described a battle between serial killer and police force. It was right up",
    "\n                All I can say is wow.  With the extreme amount of hype and popularity surrounding Death Note, it was only a matter of time before I watched it, and I must say it was everything I expected it to be and more.  A tale of a perfect kid with a perfect life trying to play his own version of God and pass judgement to the wicked?  This anime has suspense written all over it.\n\r\nI love how fucking original this plotline is.  To be honest, I was getting bored of following the same underdog or \"rags to",
    "\n                In my opinion, Death Note carries a weight of suspense that I\\'ve never experienced in most or any animes before. Its story revolves around a notebook that a Shinigami, (AKA Death God) Drops into the real world on account of a whim, one of boredom. The Shinigami, Ryuk, finds the book to be obtained by Yagami Light, a highly intelligent, even elite student, who takes it upon himself to see it as a higher calling to become God of a New World, without criminals or crime, with which he can kill",
    "\n                Death Note is not what you think it is!  \n\r\nSure.  On the surface, it’s a cat-and-mouse game between two investigative savants whom use their wits and cleverness to out-maneuver one another to claim psychological victory.  But there’s a deeper story that is rarely, if ever, discussed.  Which is unfortunate because it is central to not only understanding the main characters, but ourselves.  Before we open that can of worms, however, let’s provide a little background knowledge, as it may have",
    "\n                Look, I am not a regular viewer of anime. For all I know, I'm probably missing something that I would not otherwise if I viewed anime as regularly as you. Still, Death Note was an interesting experience that made me realise that following the culture surrounding it is a good way of losing whatever sense of taste I have apparently cultivated. \n\r\nDeath Note is not a bad show. Its just a show that is too clever for its own good. Actually, \"clever\" makes it sound like a backhanded compliment- \"",
    "\n                Let's be honest: There's a lot of shitty anime out there. Whether it's bland harems, obnoxious ecchi, or vapid dramas, many people have seen what physically and artistically represents the fact that sometimes even inane dimwits can slip through the cracks of entertainment. Thus, it makes sense that when a so-called \"smart\" anime hits the streets, people would naturally be enticed by the allure of a mature, thoughtful work. A lot of times these fail to impress as the author spends so much ti",
    "\n                WARNING: Minor spoilers within.\n\r\nTITLE: Death Note\n\r\nMANGA/ANIME: Death Note was originally a manga authored by Tsugumi Ohba and with art done by Takeshi Obata (well-known for his work on the Hikaru no Go manga).  It was serialized in Kadokawa's Weekly Shonen Jump from May 2003 until December of 2006, and was licensed Stateside by Viz Media, with all volumes currently available.\n\r\nThe anime version of Death Note was produced by Studio Madhouse (well-known for their work on Paranoia Agent a",
    "\n                The pen really is, mightier than the sword. This anime is proof.\n\r\n [ 1 MINUTE REVIEW ]\n\r\nDeath Note is one of the best anime out there and for many, it IS the best. This supernatural mystery thriller is simply amazing. With an extremely compelling storyline and a ruthless protagonist(s), this show keeps you at the edge of your seat with its exceptionally fast pacing. Watching the two main characters battle it out psychologically in a deadly game of cat and mouse is a real treat. With beaut",
    "\n                “This world is rotten. The rotten should die.” \n\r\nStory- 9/10\r\nDeath note has a very well written story. The two masterminds, Light Yagami and ‘L’ have realistic and intelligent conflicts, through testing each other’s resolve and pulling poker faces so straight I could hear Lady Gaga in the background. In crime genres, it is common for a ‘genius’ police officer to pick up some evidence and go, ‘hmmm, this gun has been scratched here. Therefore the suspect is male, 28 and lives in America!’ ",
    "\n                You may be thinking &quot;Why has this guy given a low rating compared to everyone else?&quot;\n\r\nWell, unlike the DN fanboys, I spotted the immediate problems in the story, which seems pretty big considering that Light and L are geniuses.\n\r\nStory:\r\nIt got off to a strong start, with twists in the story being explained logically step-by-step, and without any repetitiveness. However, it began to get more and more illogical as the story went on. Someone watching the show might not realise it, ",
    "\n                Death Note: Ah, you know! That anime where apples are a huge theme with a whiny genius who wants to rule the world! Of course. It was good but ended with lack luster.\n\r\nLet's start with the story: I'll try to keep it spoiler free.\n\r\nStory: Light Yagami is a young, Japanese male genius who is bored with life. One day he finds something called a Death Note, a notebook with the ability to kill. He uses this death note to rule down on all he deams unworthy (criminals). He sets off his plan but ",
    "\n                \"However gifted you are you alone can't change the world\". - L\n\r\nPreface: \n\r\nGrab a bag of potato chips, all you wannabe gods of the New World, cause I'm about to shine some Light on this review Note. \n\r\n****Minor Character Spoilers marked with ****\n\r\nOverview: \n\r\nLight Yagami, resident high school genius and bored student stares longingly out the window, wishing something would happen in the tedium of the everyday. One day, a black notebook falls from the sky. He opens it and inscribed ins",
    "\n                What if one person was given the power to kill anyone they wanted, whenever they wanted, simply by writing their name in a notebook?\n\r\nIf you’re screaming at me about spoilers, you must not have realized what the title of this anime implies. This question is the basic theme throughout the entire show. While it sounds very strange, I can almost promise you that you have never seen anything like it before. This anime is easily one of my favorites, and I’ll show you why. I’ll also show you why",
    "\n                Death Note is a Japanese manga series created by writer Tsugumi Ohba and manga artist Takeshi Obata which was adapted into an anime and directed by Araki, Tetsurou and produced by Maruyama, Masao. It centers on Light Yagami, a high school student who discovers a supernatural notebook, the titular \"Death Note\" or “Desu Noto”. This notebook grants the ability to kill anyone whose name is written. The series follows Light's subsequent efforts to create a criminal-free world using this extra or",
    "\n                Psychological thrillers are easy to write, but not as easy to like. A lot of what makes psychological thrillers work is making the characters act in a very believable and human fashion, which we don't normally see because the writers make the themes normally control the story and characters in psychological thrillers. This tends to ruin immersion a lot, especially when the purpose of such a story is to discuss the humanity behind their actions or lack thereof.\n\r\nThe trick behind psychologic",
    "\n                Death Note, what a ride.\n\r\nThis series is one that after watching i would most definitely recommend to anyone, the suspense and heart-stopping thrills that this program provides is unrivaled by most any other anime and leads the viewers to construct active thought processes on what they support and believe in when developing this stand-off between two different ideals on the state of the world and the lengths to which it is ok to truly think that you are making the world a better place. A r",
    "\n                I must say that honestly I believe Death Note is the greatest anime of all time. It is the COMPLETE package. It is the only anime I ever watched that I could not stop watching. It really makes you think and it has soooo many good twists throughout the entire series. You never really know what's going to happen next.\n\r\nStory: I mean, it's so unique. What other series have you heard of with Shinigamis and notebooks that can kill people? And it really appeals to a lot of different tastes. It i",
    "\n                If you like psychological thrillers then i suggest you go watch a James Patterson movie. \r\nDeath Note did not cut it for me, the endless (and sometimes random) mind fight between L and Light gets tedious a few episodes in which slows down the plot considerably. \r\nThe Sherlock Holmes logic of the characters reduced to intricate details like the colour of a chair (or something) which leads to a massive, yet not massive, clue to the identity of L or Light repeats itself several times always en",
    "\n                Death note is a real masterpiece, this is my first serie where I cannot tell anything bad about.\n\r\nLet's start with the story:  Light Yagami is boy of 17 that is frustrated in how rotten this world is. When he has found the death note ( rules:  1) The human whose name is written in this note shall die. 2) This note will not take effect unless the writer has the person's face in their mind when writing his/her name. Therefore, people sharing the same name will not be affected. 3) If the caus",
    "\n                 Unique, clever, thrilling, addictive.\n\r\n I cannot fathom the brain and thought process of who created this. \n\r\n In my opinion, \"Outstanding\" summarises Death Note from start to finish.\n\r\n I have never watched anything so 'clever' in my entire life. You think you're smart enough to guess what happens next, I guarantee you won't. After a couple of episodes, you'll be hooked.\n\r\n This is truly an anime anyone can watch. It pushes the limits of what can be created via fiction. The sense of mora",
    "\n                Death Note is the first anime that I have ever watched. At the time, I did not consider myself to be a fan of anime in the slightest, and it was my girlfriend that convinced me to give this show a chance. It did not disappoint, and it has changed my view on anime completely.\n\r\nI will try my best to keep this review spoiler free, not revealing any major plot points, which could ultimately ruin the show for those yet to watch it. \n\r\nI personally feel that the concept of Death Note is unlike a",
    "\n                Death Note, as I'm sure you know by now, revolves around Light Yagami, a genius high school student, who finds a notebook titled Death Note, giving him the power to kill someone simply by writing his or her name into it. He takes it upon himself to rid the world of criminals, and hopes to become the God of the new world he creates. Upon killing many criminals, the world takes notice, giving this unknown killer the name Kira. The greatest detective in the world, L, is notified and takes up t",
    "\n                \"I'LL TAKE A POTATO CHIP... AND EAAAT IT!!!\"\n\r\nAhhh yes. The ever so popular Death Note. To be honest I never understood what people saw in it. I was kinda never able to bring myself to watch it thinking that it was probably boring and dull. Well, I was wrong. \n\r\nLet's start with the story then. It's simple enough, we have a bored psychopathic high school student (Light Yagami) who finds a notebook (called Death Note). It's not just an average notebook though, oh no. This one can kill a hum",
    "\n                Its quite psychological. \n\r\nWhat was keeping this series from being a 10? \r\nIf you can answer this question, I'll boost it up to a 10. \n\r\nSo, the \"name\" part required to use the death note, \r\nIs it like your legal birth name or a the name it says on your citizenship record? What if your parents died and didn't give you a name? Will you then be immune to the death note?  \r\nThe ending felt kinda rushed.\n\r\nStory- (10/10) \r\nBook that kills people if the person's name is written in it. Pretty da",
    "\n                I first came about Death Note when some of my friends started watching it and arguing who was better, Light or L? It got rather annoying, and for some reason, I planned to join in the argument by watching it... And also too see what makes Death Note &quot;this good&quot;. Like me, I'm sure a lot people who have watched Death Note watched it because they were curious. Just a few warnings about the anime, there are some &ldquo;extreme writing&rdquo; elements in it that would make you think th",
    "\n                After a certain event occurs roughly halfway through the story, the anime loses all its steam. Before this event, the anime would have easily been an 8 or 9, but the story just... flops after it. Almost everyone who has watched the anime knows what I'm referring to by \"this event\", which just goes to show how it ruined the second half of the show. Even the first half, the \"best part\" of the show, would still be overhyped just by itself. Overall, I would say that while some people may like t",
    "\n                Have you ever thought about the way the world is now? Have you seen it in a positive light or a negative light? Have you ever thought about how you can change the world you're living in, for what you think is the better? Then one day, you find yourself with an unlikely weapon which you use to change the world.\n\r\nWelcome to one of the most critically-acclaimed anime in the world, \"Death Note\".\n\r\nThe story begins with Light Yagami, a 17-year-old high school student who is basically bored with",
    "\n                Presumably the most expected anime of the 2006/2007 Winter season, and the new year Death Note conveys story components and an intelligent honesty that is all the more generally seen in your collegeate scholarly classics than your ordinary Shounen Jump title. \n\r\nThe story is about the uprightness of mortal equity guy who successively esteemed in a general sense imperfect by corrupt, limited limit of man and their profoundly ruooted feeling of pride and grandiosity. The lead character Light ",
    "\n                \"I'll Take A Potato Chip... AND EAT IT!\" -Light Yagami\n\r\nThe 2006 Psychological-Thriller anime and the top 32 of the best animes in MyAnimeList, Death Note, is no exception and by far, the horrific masterpiece of the 21st century. Unlike any Detective, mystery animes out there like \"Detective Conan\", Death Note is the one who can make you going at the edge of your seat. It has tons of plot twists, the chase between good and evil is fantastic, logics and puzzles surrounding the story, and ot",
    "\n                Today I will be reviewing another favorite anime of mine (and many others), Death Note. Death Note did not seem like a title I would like, and I first thought the fanbase for this was just crazy. But one day I was bored and decided \"what the hell\" and figured I'd see what the hype was all about. I checked out episode 6 or 7 on Adult Swim on demand, and boy am I glad that I did. I got hooked. I thought this would be another series where I'd disagree completely with every other anime fan out ",
    "\n                Fan rating: 5/5\r\nCritic Rating: 4/5\r\nOverall rating: 9/10\n\r\nDeath Note is hard boiled. It's not a mystery, because you know whodunnit. You follow the criminal's perspective. What is an antihero? Is it a hero with villainous qualities or is it just a villain who gets the story told from his viewpoint? Both probably.\n\r\nI think of Death Note as a study of narcissism induced by brilliance or just being a sociopath. In other words, we sometimes possess traits that by nature alienate us from peop",
    "\n                First off, let me say i'm didn't give this anime a 10. I wasn't completely amazed but people have different opinions after all and nevertheless i still think this is a show with few flaws and alot of enjoyment. It has a very nice feel to it and this is a great watch for those into the mystery genre especially. The show is hardly at times slow and usually packed with suspenseful and captivating moments, plenty of plot twists as well.\n\r\nStory (9). Right off the bat i'm going to say i think th",
    "\n                The most best quote that can describe this anime is \"With great power , comes great responsibility\" . The anime itself is showing us what could great power do to a human whose knowledge are godlike . Death Note make me watch the whole 37 episodes in one go . Enough said , its one of my memorable anime ever .\n\r\nStory:9\r\nThe story start with a highschool student , Light Yagami , who discover a book that contains the power of death . This book grant its user the ability to kill anyone whose fa",
    "\n                If you watch anime, I highly suggest that you watch Death Note. It is a story about detectives, serial killers, Shinigami, and apples. With such an outrageous premise, you might think that Death Note is kind of ridiculous or that it might have sloppy storytelling. No, Death Note is a clean, dark, and serious drama.\n\r\nI give the story a 10 out of 10. When I was watched Death Note, the story went where I thought it would go. It was predictable, most stories follow a certain flow. But when it ",
    "\n                Death Note Review\n\r\nTHIS REVIEW HAS SPOILERS\n\r\nStory:\r\nThe story of Death Note revolves around a 17 year-old boy called Yagami Light and a Shinigami, whose name is Ryuk. In the Shinigami World, Ryuk was bored and then decided to throw his Death Note to the human world. But what does this notebook do? Well... “The humans whose name is written in this note shall die.”\r\nOn the human world, Light catches the notebook, but at first, he thinks it’s just a joke. Despite that, he takes the Death No",
    "\n                ~*Death Note: How to Make \"Smart\" Characters*~\n\r\nThe dynamic of Death Note is simple:\n\r\n-Protagonist (whichever one you thought it was in this show) comes up with a plan A.\r\n-Antagonist (whichever one you thought it was) has already anticipated plan A and has come up with plan B in order to thwart plan B.\r\n-Protagonist, as it turns out, has anticipated this anticipation, and so has devised plan C to counter plan B.\r\n-Antagonist, as it turns out, has anticipated this anticipation, and so has",
    "\n                It's strange, don't you think? How in a world filled with otaku that crave action or moe, and sometimes both, that possibly the most popular anime out there is Death Note, a psychological thriller that spends 90% of it's time talking. Perhaps it's because it's a product of Shonen Jump, or maybe because of the directing style of Tetsuro Araki, or maybe because the anime itself is just that good. After all, over the years we've had plenty of anime trend and take up the majority of discussion ",
    "\n                Better make sure you're wearing a seat belt, because this piece of knowledge may rock your world: I've never actually watched the Death Note anime all the way through before. I know, how dare I! It's still the most popular anime on MAL, remains one of the most popular anime in today's culture, and is continuing to get more interpretations than the Bible - which is kind of fitting given how many people today still worship the notebook's rules. Hell, I even championed it as one of those anime",
    "\n                \"Death Note\" is one of those anime that achieved huge amount of fame as a manga, so its incredible success as an anime always had a feeling of inevitability about it. I first heard about it a couple of years prior to its release, when a few of my friends were reading the manga. Unfortunately for me, a couple of them discussing the \"Death Note\" manga right in front of me gave away a big plot point that occurs mid series. At the time I didn't mind, as I don't really read manga, but I was a bi",
    "\n                There is hardly any anime enthusiast who hasn’t seen Death Note and it has more than enough spoiler-less reviews. But what I feel the need of for this anime is a full fledged analysis of its accomplishments. And so, here I am trying to do that very thing. And since I’m going to have to point out several significant plot points and twists as examples, this review-esque prose will contain heavy amount of spoilers. If you’re one of those who haven’t yet seen the anime, I suggest doing so befor",
    "\n                “The whole is greater than the sum of its parts.” - Aristotle. \r\nIn Death Note's case, much, much greater. \n\r\nOn the first day, Billy learned to ride his bike. On the second day, he learned to ride it with only one hand on the handle. On the third day, he could ride it without any hands. After that, riding without any hands is all he wanted to do. The thrill and excitement was overwhelming and he could not go back. \n\r\nHailed as one of the best anime of all time, Death Note deserves to be on",
    "\n                Death Note... The most popular anime, Death Note... The controversial anime that some consider overrated, others consider average, and a lot of people, the greatest anime ever. After watching 400 anime, I am going to declare that Death Note is one of the greatest anime ever. I'll try not to spoil anything at all about this masterpiece, but if I accidentally do I apologize in advance. Oh and if you don't like \"themes\" and \"AP Lit symbolism\" far-fetched crap, then I'd say you may not consider",
    "\n                Whoever fights monsters should see to it that in the process he does not become a monster. And if you gaze long enough into an abyss, the abyss will gaze back into you. - Friedrich Nietzsche\n\r\nDeath Note is a thriller of the highest order, I'm sure Dean Koontz, Stephen King and Naoki Urasawa are proud of Tsugumi Ohba's accomplishment within the genre of supernatural/psychological thriller. I also saw somewhere on the web that a person listed Death Note's genre as chess master, I feel that i",
    "\n                This review will be on Portuguese, if so you can translate to your language.\n\r\nDeath Note ( Desu Noto, \"Caderno da Morte\") é uma série de mangá escrita por Tsugumi Ohba e ilustrada por Takeshi Obata, e que cuja adaptação para anime foi dirigida por Tetsuro Araki. A história centra-se em Light Yagami, um estudante do ensino médio que descobre um caderno sobrenatural chamado \"Death Note\", no qual pode matar pessoas se os nomes forem escritos nele e se o portador visualizar mentalmente o rosto",
    "\n                Introduction\r\nHow far would you go for justice? Would you throw away your ideals if you had the chance to “cleanse the world of evil”? What even are your views on justice and just how far would you go if you suddenly had the chance to make those thoughts come true. As it has once been said before, “Don’t judge a man when he has nothing, give him power and that’s a true test of his character.”\r\nDeath note is an anime that can be classed as a mystery, thriller type show but in actual fact it ",
    "\n                So my previous review for this was in short, shit.\n\r\nTime to give it an actual review after rewatching the show. \n\r\nNote: I will have * with a number placed inside which mean there will be some text at the very bottom that contains spoilers. So if you don't mind the spoilers you should check that. \n\r\nStory: Deathnote is about the best character of all time, Light Yagami. He finds a notebook and inside, it states \"The human whose name is written in this note shall die.\"\r\nDeathnote is one of ",
    "\n                Oh the great Death note what hasn't been said about this anime?... To be honest Death Note in my opinion its everything people said and more. \r\nThe story starts out simple, but later you will have to pay a lot of attention to details as things become much more complicated and a bit harder to follow. That might be a problem for some people, but like a said if you really pay attention you'll be a lot more interested in this characters and get familiar with them. Personally, I found it to be r",
    "\n                                      When you watch a masterpiece such as Deathnote, the review isn't such as a question. How good was it? Should i watch this? No the review is only in question for the morals of its contents, shades and slashes of dark gray and malice rains over this anime. What in gods watchful eyes did i just watch,\"Did god blink\" ladiies and gentleman you just watched a evil yes, and sinning yes masterpiece among very few animes.       \n                  \n\n \n\r\nAnthony R Latimore",
    "\n                When the Devil rebelled against God, he was cast out of Heaven and made to suffer in Hell. When Adam and Eve ate from the Tree of the Knowledge of Good and Evil, they, too, were cast out of paradise and exiled into a life that ultimately culminates with death. Though ostensibly dissimilar, the sins of man and the Devil are, in fact, the same: they desired to put themselves on the level of God, and for that they were punished.\n\r\nIn many ways, this is the basis of the Faustian archetype. A ma",
    "\n                Note ~ This review contains major spoilers. I would also like to say that this is my first review on MAL. So kindly overlook the faults or mistakes I made. Feedbacks are certainly appreciated!\n\n\r\nDeath Note is one of the most critically and commercially acclaimed anime of all time, and it absolutely deserves to be so. It's an incredibly thrilling experience consisting of many marvelous twists and turns that never fail to amaze the viewers, and some of the greatest cat and mouse chases in al",
    "\n                Synopsis:\r\nYagami Light is as perfect a hero as you could imagine--perfect grades, perfect public record, perfect looks--in every facet, his image is squeaky clean. \n\r\nThis all ends one fateful day when the Shinigami known as Ryuk drops his Death Note out of the realm of the afterlife, into Light's schoolyard. Light stumbles across it and reads the directions: write the name of the person you want dead in the Death Note--with their image in your mind--and they will die in the manner you hav",
    "\n                Story: 9\r\nArt: 8\r\nSound: 9\r\nCharacter 10\r\nEnjoyment: 10\r\nOverall: 9\n\r\nThis review does NOT contain any major spoilers.\n\r\nI'm going to go out on a limb here and say that I didn't mind the 2nd part of this series. I know the 1st part was definitely the better of the two but the 2nd was also very good. In the end they could have done without the 2nd part, but by no means was it bad. I actually enjoyed it nonetheless, overall better than most anime series that I've seen.\n\n\n\r\nPutting that aside ",
    "\n                \"No matter how gifted you are, you alone cannot change the world...\"\n\r\nWhat if you could? What if you were given the opportunity to change the world? How would you go about doing this? It could go either way, you could change it for the better, or for the worse. However, at first this question seems unrealistic, very few people have been able to do it. Just like the quote says, a single person cannot change the world. In most cases, this is true. You'd need the help from thousands of people",
    "\n                Alright bros, time for a heads up. The first 25 episodes of Death Note are goddamn V.I.P. quality material. You want plot twists? Done. You want to see two chessmasters continuously one upping the shit out of each other? Check. You want to see some fucking intense notebook writing action? Double check. You want to see some L x Light foot action? Well, you're a sick bastard, but yeah, it's in here.\n\r\nAs far as the plot is concerned, the basic premise is this. A shinigami named Ryuk is bored ",
    "\n                ***Spoiler Free Review***\r\nI've been wanting to review Death Note for a while now, since it's a personal favorite of mine, so let's get to it.\n\r\nDeath Note follows the story of Light Yagami, a high school student who's bored of his everyday life. A fateful day he discovers by mistake a magical notebook with the power to kill humans just by writing the individual's name on the notebook and picturing his face in your mind. This is where it all starts.\n\r\nThe anime shows Light as a person tired",
    "\n                I  asked someone for a great psychological anime like Serial Experiments Lain and this was there first recommendation. The series is very enjoyable but have some tranquillizers or beer on hand because the suspense never lets up.\n\r\nThe first half of the series (L's Arc) is masterfully done. L's Arc definately deserves all 10's. I felt it was on par with a Robert Ludlum novel (not the movies). The constant intellectual attacks and re-posts were very believable and had me in astonishment the w",
    "\n                Death note review (9.5/10)\n\r\n(This aims to be a spoiler-free review. However, if included, any explicit spoilers will be in a marked off section at the bottom of the review.)\n\r\nStory:\n\r\nDeath note has a quite original concept behind it; a book in which you can write peoples' names to kill them. Death note is a mature, intelligent anime which displays a battle of wits between the main characters. You get thrown straight into the story with in 5 minutes and the action really does not let up f",
    "\n                ~ Evil deeds will be punished, this is something that should be. ~\n\r\nDeath Note.\r\nIt's a cult classic, widely beloved show, that holds a large sway in the otaku community. It is in essence,  an extremely vivid and well thought out story that redefines the meaning of the \r\nword \"justice\"...\n\r\nSpawning from the simple, supernatural/fantasy themed idea that by writing down somebody's name that you could cause them to die, comes an extremely intricate and entangled story that documents almost f",
    "\n                Death Note is a big game of cat and mouse. The two main characters are Light Yagami, who finds the Death Note and uses it to kill criminals to create his \"perfect\" world (nicknamed \"Kira\" by the media) and L, which is the investigator brought in to figure out who Kira is. They are constantly trying to get one up on each other and always are one step ahead of each other. The story is great and the characters are amazing. If you like mindgames or detective stories, then certainly give Death N",
    "\n                And the chorus SINGS!!\n\r\nPros: \n\r\n- Gothic atmosphere, ^ ~ ^ ooohhh how i love it\r\n- Intense rivalry, There can be only one!!\r\n- Shinigami nuff said\r\n- Brilliant writing and artistic visuals\r\n- Suspense all day everyday \r\n- Intriguing characters, my fav iz L O u O\n\n\n- Soundtrack tis orgasmic!!\r\n- Rules make it that more intense\r\n- Dub tis awesome -thumbs up-\r\n- Mundane things turn EPIC!!\n\r\nCons: \n\r\n- Some characters are not well developed and useless\r\n- The third act turns dull, like super ",
    "\n                Death Note. One of the most popular anime out there, and that happens for a reason. And the reason is that this anime is just great! Many of you may say that i overrate it, but i think there are some factors that deserve to be overrated. It is also one of my favourite anime series.\n\r\nStory: 9\r\nDeath note is about Light Yagami, who finds a strange notebook. It didn't take him a lot of time to realize that this is not a normal notebook, but it has the ability to kill someone just by writing t",
    "\n                This anime took me a while to really get around to and I do regret not watching it earlier.....somewhat. This anime started off very slow for me to a certain degree due to the fact that I did not understand how the story would expand on the context of the deathnote. However, once i got through a few episodes I simply could not let go of it. It got really emotional at points where i had not anticipated, and the overall feelings i had towards the characters were raw and very real. \n\r\nI found ",
    "\n                This is my first review so I apologise for the quality of it :3\n\r\nDeath Note is, without a doubt, one of the best anime ever created.  It tells a unique and enjoyable story, to the likes of which I have not seen with any other anime of the same genre. I feel I can confidently say that it is one of the best anime out there, if not, then without a doubt one of the best I have ever seen.\n\r\nStory:\r\n The concept of the story is rather simple, a notebook falls from the sky with the power to kill ",
    "\n                This anime though. Honestly, I truly enjoy it. This may seem weird but I love both the protagonist and the antagonist. Yagami Light is a very erudite student that was bored with his life, waking up to the same old thing. He picked up a book that fell from the sky called the Death Note and was amused by it. He didn't actually think that the book might work but what the heck, he started writing a criminal's name and the criminal was killed. He was taken aback by the result and experimented wi",
    "\n                *FOR THE VERY FEW OF YOU OUT THERE WHO HAVEN'T SEEN THIS ANIME JUGGERNAUT, SPOILERS FOR DEATH NOTE. ALSO, THIS REVIEW WILL BE HUGE, BUT PLEASE BEAR WITH ME\"\n\r\nLet's flash back to 2006. Anime at the time was a decently popular entertainment medium with a few great hits that many internationals know. However, we never really got a global phenomenon from the anime industry. A pair of shoes came on at around the same time, and one year later, that pair got an English dub that showed the world t",
    "\n                Death Note. This is one of those anime series that had me riveted from the beginning. Sure the story kind of moves slow. There is some times a lack of action. What is lacking in action is more than made up for with intelligent story telling, and a very psychological intense scenario. A high school kid finds a note book, if he sees a picture, and knows their name, he can write it in the book and kill them, and write how it will happen. This power corrupts. The story gets intense as they call",
    "\n                Look, don't get me wrong. I love death note manga. It's my favorite. But the anime COMPLETLY killed it. I've always been a fan of Takeshi Obata, and i still am. His art is great and the story line remains intriguing. But the way they went about showing it is just... different... wrong. It doesn't feel right, but I can't put my finger on exactly what IT is. Not to mention that the voices just sound all wrong, even in the japanese version. The voice actors just don't sound the way that I, and",
    "\n                CONTAINS SOME SPOILERS\n\r\nDeath Note, Death Note, Death Note. I can't even remember the number of people who had suggested this anime, and claimed this to be the best of them all. Fair enough, I gave it a watch. Dropped it the first time after 20 episodes, can't really explain why. That was a few years back; maybe I wasn't ready for such genres yet, as I, like every other adolescent boy, was happy watching typical mainstream shounen.\n\r\nSo, after improving my anime knowledge over the years, I",
    "\n                10/10\r\nSummary\r\nDeath Note is about an average high school kid with above average intelligence named Light Yagami. Light finds a book on the ground with the title ‘Death Note’ inscribed on it. The magical book has the power to kill anyone whose name is written in the book as long as that person’s face is being pictured in the mind of the writer as they jot down their victim’s name.\r\nLight soon goes insane with his newfound power and starts to rid the world of all criminals. His ideology is ",
    "\n                This is my number 1 favorite anime. I re-watched it at least 3 times. \n\r\nWhen I first heard of this anime, I thought \"oh it's just another popular anime without much going on in there\". That was a very wrong assumption. Once I've given it a chance, I couldn't stop watching.\n\r\nStory: Amazing, original, outstanding. Whoever came up with the plot is a pure genius. There are no words to describe the atmosphere it gives while watching.\r\nIt has many themes in it. \r\nIf you love crime- this is for ",
    "\n                Well, Death Note. A name pretty much everyone who watches anime knows. This series is great and will keep a viewer interested almost nonstop.\n\r\nStory: The story is completely original and was one of the coolest stories ever. A 17 year old finds a notebook that kills the person of whoever's name is written in it. Sounds legit. The story is honestly very cool, but it can be confusing at some points during the middle of the series. But, one complaint I do have is the weakness of the second sea",
    "\n                One of the best anime out there, Death Note gave me a different perception of world, and changed my opinion for anime industry.\n\r\nStory: A refreshing original story with a lot of suspence driving you crazy. A story that compines a lot of elements as horror, drama, action even and some romance with a magnificent way. Based in a ethical question: Does it is right to kill humans so you can create the perfect world?. The answer depends one the viewer, and his moral. You will get caught in an am",
    "\n                Discussion:\n\r\nI'll start off by saying Death Note is among the most exciting television to watch. The confrontations between the characters are absolutely exhilarating. Even by their very first confrontation in the second episode, you can see that the two lead characters, Yagami Light and \"L\", are genius, devious, and at least partially insane. Yagami Light, who works under the public alias \"Kira\" to punish criminals with the Death Note, and \"L\", a world-renowned detective who has solved se",
    "\n                Short introduction of me :D\r\nHello,I will be trying to make this review as shortest possible and with almost no spoilers.This is for people who are doubting should they watch anime or not\n\n\n\r\nShort preview:\n\r\nLight Yagami is a highschool student,who wishes to change the world.\r\nHe gets an opportunity when a Death Note falls from the sky which got dropped by Ryuk a shinigami.\n\n\n\n(Death Note is textbook who created shinigami or death god in english.If you write someone's name they will die.Bu",
    "\n                I just finished watching Death Note last night, and I just had to write a review for the series.\n\r\nAfter my friend spending months trying to get me to watch Death note, I decided, \"what the hay, I might as well give it a try.\" From the very first episode I was hooked.\n\r\nStory: I like the story a lot. I thought it was pretty original compared to a lot of anime's I've seen where the plot is recycled. If you don't know already, the Death Note is a notebook in which whose ever name is written d",
    "\n                One of the most interesting manga titles to come around for some time, Deathnote presents the reader with some very heady subjects you might not expect, such as morality, the nature of good and evil and some great social commentary.\n\r\nFrom the pages of the manga to the silver screen and then to the small screen. Manga = breathtaking, Film = groundbreaking, Anime = phenomenal.\n\r\nDeath Note the anime is one of the best animes to come out for a very long time. The storyline is amazing but not ",
    "\n                SHITTY REVIEW\r\n-shamelessly presents-\r\nDeath Note(sub)\r\nDeath Note is an anime that almost whoever has watched has give it a rating of above 7 .and it is not for a trivial matter.DN has everything to make you watch 25episode in a row.but what about the rest of episodes you may ask.That is what this review will explain.\n\r\nStory 10/9.8-The story is simple.A boy genius Light Yagami who is bored of  his school life and tired of the 'rotting' world founds a notebook in which if  we write someone",
    "\n                when reviewing, I only review anime that I think is good. I don't review anime that I don't like, because I think it's like sticking your finger in the ass of a person you really hate and then tasting it. then you proceed to put your finger again to his ass and savoring the taste to make sure you are tasting real shit just to confirm it is shit.\n\r\nwell anyways!\n\r\ndeath note hmm... 10/10 very good! I haven't even watched it but, I already finished it just being spoiled by my classmates and f",
    "\n                THIS REVIEW CONTAINS SPOILERS. I have been FORCED to include this at the top of my review after it was UNJUSTLY taken down by a moderator previously. As said in Orwell's 1984, \"Injustice anywhere is a threat to justice everywhere.\"\n\r\nWhat a joke. I knew pretty much instantly that yagami was kira because they hint at it so heavily in every episode. I feels like the show is setting up L to be super smart and a detective but he just seemed so stupid for the whole thing because it was obvious w",
    "\n                Alright everyone. if you have not seen this yet it is a MUST! It is one of the best animes out their in my opinion. This anime is a shorter anime with under 60 episodes long and it kept my leaning at the edge of seat. The story starts with a necessary build to introduce the deathnote, but never makes it too slow to get bored of the show. Then it starts getting interesting when they investigate how so many people are dying and why. From this moment on it is pretty much a game of chess betwee",
    "\n                You've never been more antsy in your life. You're in your car driving back to your place with a 10/10 redhead sitting shotgun. You must have rescued an orphan in your last life because you're a fucking loser and this smokeshow is going home with you. Your pants tighten, your forehead begins to perpspirate, and your hands clench on the steering wheel as you try not to fuck this up. You don't even try to start a conversation, because you're scared you'll spit a meme or something and she'll ge",
    "\n                I have watched Death Note several times. No matter how many times i watch it, it keeps surprising me with more. Its a very mysterious anime where u have to keep focus on whats going to happen next. It draws you in the story and makes you feel alive in it.Thats one of the reasons so many people enjoy watching it including me. Its a mysterious cat and mouse anime where u have to try to prevail without making others know your true nature. The storyline is unbelievabe good and the laugh of Yaga",
    "\n                Death Note is definitely worth your time.  This is true if you are completely new to anime or if you're a seasoned veteran (in which case you've probably already seen it).  It follows Light Yagami, a teenager who happens to find a magical notebook dropped by a God of Death which grants the user the ability to kill a human by writing their name while mentally visualizing their face. Light decides that he wants utilize his newfound power to rid the world of those he finds to be evil or detrim",
    "\n                Captivating from the first hit, death note is a thrilling, exciting, huge mind game, and we get the front row seat.\n\r\nIt\\'s funny how a regular school person like Light Yagami finds a notebook that happens to kill anyone\\'s name that you write in it. What\\'s also fascinating is that you can even alter how the person dies. With this being known, Light finds a new hobby when obtaining this notebook, and gets a great idea: Why not cleanse the world of all of the bad people?! and create a new w",
    "\n                What can I say about Death Note that hasnt already been said? Well when my friend told me to watch it I never expected that I would be watching a show of such incredible quality...\n\r\nStory: Death Note has definitely one of the BEST storylines I've ever seen in an anime, almost every single episode was very intense and incredible and would leave me wanting to see more. The plot twists thrown and the battles of intelligence between the two main characters was outstanding and the way they woul",
    "\n                Death Note was the first anime that I watched and knew it was 'real' anime. That was one hell of a transition, from watching Dragonball as a kid, to delving into the cerebral universe of Light and co. Simply put; Death Note is a sophisticated journey through the human reactions to Godly power, its characters range from phsychotic to completely logical, yet all of them have an array of diverse motives.\r\nThe story itself is consistently brilliant, too often you'll be watching a series and kno",
    "\n                DEATH NOTE. WHOA! What can I say? Simply one of the best animes of all time. \n\r\nIt's a true masterpiece. As you watch the series, you get to question your own morality; you don't know if you are going to root for L or for Yagumi Light. It's very suspenseful, artistic, bizarre, intelligent and surprising as well. Kudos to the animation team who made this anime possible. It's heart-stopping scenes are all to watch for. You can't get enough of an episode to the next because you are undoubtedly",
    "\n                Imho Death note is a Masterpiece. Very thought provoking.\n\r\nStory/Plot: Most of you have probably read the synopsis so thats  already taken care of. Death Note is a very thought provoking anime and the story just keeps you intrigued through the whole series. The thing i love about it, is how it views on both the protagonist and antagonist's perspective and way of thinking. Another thing is that you really have your own opinion on who is the protagonist or antagonist depending what moral you",
    "\n                [WARNING][slight potential spoilers below, nothing to crazy]\n\n\n\n\r\nI am definitely in the minority with my opinion/review of this show it seems but let me try to justify why i disliked this show so much.\n\r\nDeathnote was an anime that could have been one of the greatest ever made yet it made incredibly poor decisions regarding key plot points (killing off certain characters) and had an ending that was extremely dissatisfying. The first season was magnificent all the way up until how it ended.",
    "\n                Death Note was literally a rollercoaster that had its railings removed midway and I fell to my literal death. This anime was so close to being one of my favorite ones but it didn't make it. For the first half of the anime, I was so dang hooked because of the Light VS L case with all the suspense as they battle with their wits and all these clever tricks and plot twists. The whole idea that Light was trying everything to cover up his identity from L who kept uncovering everything; THAT WAS T",
    "\n                When I dove into the anime otaku word there were some anime's I knew I needed to watch or at least try and one of them was death note, I had known about this anime even as an outsider and I also understood the basic concept where there is a supernatural notebook for whom ever's name you write into it shall die.\n\r\nImpression\r\nto start off the approach this anime takes I found similar to who bleach started, your main character is a teenager and one day some supernatural stuff happens and then",
    "\n                It's hard to categorize Death Note at times it's so faced paced and then other times it seems to slow down to a stand still. The characters L and Light who face each other in a duel to reveal the identity of the entity known as &quot;Kira.&quot;..oh yeah theres also Ryuk the friendly neighborhood Shinigami (Lit. &quot;Death God&quot; \r\nWithout giving too much away the battle between L and Light becomes much more personal rather then a game which it is sometimes made out to be. Both characte",
    "\n                I'll start by saying that this is my all-time favourite anime. Oh, and I'm a girl.\n\r\nThis may be shounen (marketed to a male audience of 10+), and I can see how guys would be more attracted to this sort of plot, but it's a masterpiece that, in my opinion, both guys and girls will enjoy.\r\nThe concept itself is very simple: Light, a bored, but brilliant high school student, wants to build a new world free of criminals and has the perfect tool in his hands to do so. What makes it so good is ho",
    "\n                THIS REVIEW CONTAINS SPOILERS\n\r\nI liked it and hated it at the same time.\n\r\nThey actively closed every possible loophole from the Death Note, but ruined it with the antagonists using baseless theories. They should have just ended the series after episode 25.\n\r\nCharacters: 10 for Light, 10 foy Misa and 10 for Ryuk. 4 for L, 2 for Light's father, 0 for Mello, 0 for Near. Total: I'll give em 7, even though it's a 5 average.\r\nLight, Ryuk and Misa were really fun characters, and were the main re",
    "\n                Story:\r\n\"Deep\". There's one word to describe Death Note. When I first began watching this, I knew it was going to involve some paranormal/horror factor. But since I noticed how attractive the protagonist was, I'd expected it to have romance. Then I realized, three episodes in, that Light Yagami was actually the antagonist in a way, because of his monsterousness. I was completely shocked but at the same time pulled into it even more. The storyline is very complex and it keeps you right in fr",
    "\n                Death Note's point of view is, of course, that the protagonist is actually Light's Moriarity to L's Holmes. Having a villain as an entertainment centerpiece is nothing new; just look back at Shakespeare's Richard III to see an ignoble main character who addresses the audience as he schemes. More modern examples would be The Sopranos, Pulp Fiction, or even the strikingly similar Showtime series Dexter. Indeed, it is not Light's prominence as a megalomaniac lethario that compromises Death Not",
    "\n                \"The human whose name is written in this note shall die.\"\n\r\nWhen I became obsessed with this show and recommended it to some of my friends, they dismissed it, thinking that anime was somehow childish, and would be stupid, so I made them watch the first 2 episodes. Of course, they became hooked- it's impossible not to.\n\r\nLight believes that the world is rotten, and so vows to create a world without evil, using his 'Death Note'. The mood of the series is dark, and it follows the chilling batt",
    "\n                –NO SPOILERS–\n\r\nFirst of all I have to say that this was my second anime (after DB/DBZ, so basically you could say the first real one), so I might be a little partial, but if I am, then so is everyone else here. This anime is in my opinion in its own league, and very few animes I watched came even close to it after the pinky cloud flew away after watching them.\n\r\nOne thing you must know though: if you're looking for action, move along, seriously, now is not the time to watch it (and be let ",
    "\n                After a long wait, Death Note episode 25 is finally out thanks to Kuro_Hana fansubbers ^.^ I still think the anime/manga turned a bit weird after episodes 20 or so... But thanks to the new developments in the storyline, I'm still gonna be hooked ^.^\n\r\nDeath note is DEFINITELY  my current anime favorite.  Although it doesn't have that usual samurai skilled-magical -boy fantasy power-upping appeal that i usually look for in anime, this one certainly got me addicted.\n\r\nThe basic premise of the",
    "\n                Death Note literally blew my mind! \n\r\nThe issues it brings up will alter your perception of the world and make you question your humanity, however, it does it in a way that will make you want to watch the next episode. SPOILERS AHEAD. Even though this anime is very serious it does have its moments. The detective L, who is later replaced by Near and Mello to lead the Kira investigation, has a very unique way of looking at the world and is extremely smart but physically under developed. Altho",
    "\n                I've seen Death Note four times, twice subbed and twice dubbed. This series is renown worldwide as a cultural icon of Anime. You ask a random person to name an Anime; Death Note will be there with Cowboy Bebop, Attack On Titan and Pokemon. \n\r\nThis series is a complex look at morality and poses some very interesting questions. It's a tale of how power corrupts even the purest of intentions. The protagonist of this story originally has the goal for peace through administering justice upon the",
    "\n                Hello Guys , I am going to write a review on this amazing anime called Death Note . I am going to list down the pros and cons of the anime and my personal rating >.> . \r\n- Anime Type : Psychology , Mystery , Thriller , Action and Supernatural .\n\r\n- Pros : \r\n- If you like clue solving mysteries and anything that have to do with guessing , this anime might fulfil that needs.\r\n- This anime provides many suspense and have a lot of plot twist especially in season 2 >.> but I personally liked it ",
    "\n                Death Note, arguably one of the most popular anime, if not, THE most popular anime there is. Rightly so...\n\r\nAlthough I wasn't floored from the first episode, I most definitely addicted to this series soon after. The constant mystery and drama is unrivalled to anything I have ever seen, anime or not. And this is why anime, in my opinion is much better than regular TV shows. Death Note proves this where you will undoubted fall in love with some of the characters or perhaps not. The audience ",
    "\n                So stuff iv heard about this anime:\r\n-it slows down in the middle\r\n-stop watching around episode 25 (its bad after that)\r\nFor the most part I do agree that this anime does slow down around the middle but the more you watch the more it makes sense and it adds to the impact the show has later on. Now the big thing. The episodes towards the end. This is the most talked about part and the part that divides most audiences. Once again I can understand why. However (No spoilers) I thought what the",
    "\n                *SPOILER FREE REVIEW*\n\r\nSo you've watched anime like DBZ, Naruto, Bleach or One Piece, and maybe you liked them. But then you come to MAL and see that there's a little anime called \"Death Note\". The name itself intrigues you, doesn't it? So after watching it you think to yourself, \"well that was pretty good, nothing really good about it EXCEPT EVERYTHING.\" Almost.\n\n\r\nStory:-9\r\nThis part of the review will split the ratings into 2 parts: the \"L arc\" and the \"N arc\".\n\r\nThe story of Death Note",
    "\n                *WARNING SPOILERS IN THE REVIEW*\n\r\nStory: The story to Death Note is unique, and original. The story is about a High School genius named Light Yagami, as he was sitting next to the window in the last row like every other High School student, he saw a book falling from the sky called the Death Note after class he picked it up and put it into his backpack. When he got home, he decided to use it to cleanse the world from evil and make peace. But then he let power corrupt him, and became insane",
    "\n                Well... my friend introduced this to me a while back. She said it was fun and really well-made, but with all the L and Light shipping by fans, I thought, \"Another piece of yaoi crud. Joy.\" I mean... To those of you who like yaoi, good for you! But it's just... Not my type. I'm sorry. \n\r\nFinally, out of my utter boredom, I got desperate. \"I'll watch it just so I can make fun of it, and point out to all the fans out there that this show is awful!\" ...And then, I watched episode 1.\n\n\r\nStory~\r\n",
    "\n                The Suspense Is \"Killing\" Me ~ Can you sign my Death Note?\n\r\nDeath Note was the first anime that I have watched and from the first episode, I was enticed to watch more. The anime starts off with Yagami Light, A 17 year old student that picks up a notebook named the \"Death Note\". At first he thinks the Death Note's power to kill people is fake, but later finds out that it works. With this new acquisition Yagami Light has the power of god in his grasp, and uses it to kill criminals to make a ",
    "\n                Death Note.  One of the most well-known animes in existence with its unique storyline, unique characters and overall plot.  ...I hate this series.  \n\r\nStory (8/10): For those of you who DON'T know, Death note is basically an anime featuring a crazy man that self-proclaims himself as god and a detective that can make Sherlock Holmes his bitch, chasing around each other with overly complicated plans with insane amounts of resources, trying to find out each other's identities so they can bring",
    "\n                Death note starts with a student who has a strong sense of justice finds a notebook that can kill others which influences Light to decide to kill all criminals, because they cause only harm to others. \n\r\nWhat is a criminal? Someone who causes harm to others or someone who opposes Light? Its both! Light had a good idea to get rid of all criminals but he lost himself in the power of what the death note has. That problem caused light to kill innocent people who were opposing him, which made me",
    "\n                I know I am going to struggle with bias when I write this review. I just really did not like how the anime ended (not even that, how a certain character changed so much over the course of the anime). I am one that does not necessarily want a happy ending, but at the very least a struggle for good. This is almost contradictory in a sense because a lot of times I really do adore the bad guys, but in this case it was just depressing to realize who the true bad guy is.\n\r\nStory: 8/10\n\r\nIt is abo",
    "\n                Man oh man...I feel like I need to catch my breath after this one. This, has to be in my top 5 of all time...I am angry at myself for waiting so long to finally watch it! Possibly the most intricate and clever anime (and television program period) I've ever seen. The cat and mouse between Light and L was mesmerizing...it was just perfect. Twist after twist had me wondering who was going to come out on top and how one or the other was going to get out of the pickle they were in. The Shinigam",
    "\n                So, this is my first time for make a review for an Anime, so i will give it my best try...Specially for my Favourite series..\n\r\nDid you ever thinking about the \"Perfect\" world? a world where no criminals and crimes? Where everyone else safe and live their life freely without scared out about criminals and bad guys? \r\nWhere is the Justice when corrupt politicians can freely walking on the outside?\r\nWhere is the Justice when a Criminals still working on the world?\r\n\"The World is Rotten\" as Li",
    "\n                In lack of a better word, I should say this anime is completely, absolutely and totally awesome. I guess Death Note is the most famous anime in the world, and there's a reason for it.\n\r\n1. STORY (10/10): Can you list me any other story similar with Death Note? Can you? I'm sure you can't because Death Note's story is completely original. A straight A student who suddenly found a strange notebook, and later found out this notebook, he could clean the world, killing all the bad people. It's a",
    "\n                Death Note:\n\r\nStory:\r\nVery imaginative, creative, complex and precise story. A book that can kill people in various ways of which the writer specifies. With rules balancing out the power of the Death Note, I think the creator got the mix just right. Yagami Ratio, a Japanese student and also a genius, contemplates one day, of what it would be like if all the people who were making the world rotten with crime and corruption - were gone!\r\nOne day from the sky, falls a Note Book called, &quot;D",
    "\n                Story:\r\nWell developed. Well written, and held consistency throughout the entire series. Character actions were consistent with their profile. Plot was well laid out. The story drops a little midway, but to me, it makes up that drop because of its consistency and idea. So maintains a 10.\n\n\r\nArt:\r\nMature animations (not cartoony). Well fitted for the story.\n\n\r\nSound:\r\nThe BEST part! It was well chosen, and the added an extra dimension to the anime. \r\nThe worst thing one could do to an anime ",
    "\n                Death Note is something that I think every anime fan should at the very least give a chance. It's something that I've personally found to be a bit of a masterpiece in media, let alone anime. \n\r\nDeath Note has a fairly unique story, that to many is a simple bad of good versus evil, and without spoiling to much for anyone that possibly still hasn't had a chance to experience it- I personally have a different take on the anime's subject matter. I find that Death Note is as far from black and w",
    "\n                Death Note isn't really the best show ever but, it isn't that bad. At the beginning like around the first 9 episodes, it was really one heck of a ride. Then of course, it's story got complicated and the story goes down.\n\r\nThere's this kid named Light Yagami - a bored High-school genius, one day, saw a notebook that fell from the sky. That notebook is the \"Death Note\". One particular rule of that notebook states that \"The human whose name is written in this note shall die.\". At first, he tho",
    "\n                When an anime leaves you feeling that you have obtained a heightened sense of intelligence after viewing it, you know you have a winner. Death Note is a masterfully crafted cerebral volley that may perhaps change the way you think. \n\r\nStory: Any good story can spread from a single well defined and provocative plot element, in this case, Death Note. The death note is a notebook, containing a set of rules and blank sheets of paper, which kills any name entered into it. The rules stipulate tha",
    "\n                Story:\r\nA story about an super intelligent young man who resents crime and corruption in the world. His life undergoes a drastic change , when he discovers a mysterious notebook, known as the &quot;Death Note&quot;. The Death Note's instructions claim that if a human's name is written on it, that person will die. After trying it out and meeting the previous owner of the Death Note; he beings his seek to become &quot;the God of the new world&quot; by passing his own judgments.\n\r\nArt:\r\nOutsta",
    "\n                Death Note is one of those animes you will have to rewatch several times to get the full story and understand the full story. And even then there will be quite a few things that still have you puzzled.\n\r\nThe main character, Light Yagami, a stellar high school student, comes across a notebook called the 'Death Note' dropped by a shinigami named Ryuk. The whole story is of Light's image of creating a world cleansed of all evil using this notebook, and the detective L's attempts to prevent him",
    "\n                Death Note is a anime that you either love or hate it. The story starts out simple enough, (normal person gets powers etc), but then takes an immediate turn. Light is an exceptional character which believes that his way is the only way to \"righting the world\" and toward the end, you really start to want him to succeed. The story line has many little (or not so little) strategic moves that is almost representative of a game of chess. The constant mental battle between Light and L really keep",
    "\n                Death Note is one bloody epic anime, leaving you on the edge of your seat waiting to see what happens next. These are the animes, that want to keep me watching into the early hours of the morning. A dark anime, that blends really well.\n\r\nStory - The basic storyline starts of like this. Light Yagami is a 17 year old boy but he is extremely intelligent for his age, so intelligent in fact that he has helped NPA (National Police Agency) solve multiple cases. Anyway, he does find his life boring",
    "\n                The general plot of Death Note is an outstanding representation of extremes. Yagami Light shows us what happens if we have the abilities of god and misuse it for personal uses even though the original intention was meant for the good. What would happen if the Death Note falls to someone like Light? This story is an possible interpretation that would happen if such thing did occur in which someone such as Light had an strong sense of justice and happens to take it to the extremes in which on",
    "\n                Oh Death Note. How much i love thee. Death Note has to be one of the Greatest works of fiction ever created. The story is pulse pounding with it's main characters progression from an incredibly smart teenager, who turns into a cold hearted psychopath. This show has some of the most absolutely intense scenes i've ever seen, and most of them are just with two characters talking! How?! Well it's because of the ingenious writing put into this spectacular crime drama. The greatest part of this s",
    "\n                Death Note is definitely one of the most ingenious anime I've ever watched. It was very enjoyable, and it is great for beginner anime watchers. What I loved about Death note was that it held my interest. It was full of suspense, and always kept me wondering about what would happen next. I usually try for about 5 episodes of anime a night, but with Death Note, I was knocking out 10 or more episodes a night. I would definitely recommend this anime to anybody.\n\r\nStory:  10/10\n\r\nThe series begi",
    "\n                Well here it goes, my first anime review. And what better way to start than with a series I hold very high in regards to my anime viewing experience. Yes, Death Note is definitely one of those shows that most people can get into (whether they are a seasoned anime viewer or not) with quiet ease. This is a show that you can probably convince some of your \"normal\" friends to sit down and watch without explaining too much before hand. I believe it's this accessibility that garners the respect i",
    "\n                Death Note will always have a special place in my heart, not only for nostalgia sake, but because i genuinely enjoyed it and one of the few animes that got me into anime. Now the Review.\n\r\nStory:\r\nIn simple terms it's somewhat of a chance between L and Light Yagami and who can outwit the other, putting each other to the test to eliminate one another. Kira (Light) wanting to be \"god of the new world\", while L sees him as a delusional teenager, who thinks he's a \"god\" but in reality just a cr",
    "\n                Ok, so, Death Note.  I put off watching this because of everyone talking about it and blah blah blah, but finally I got too curious because the concept sounded somehow interesting.  The first episode and I was actually hooked.  I couldn't stop watching...I wanted to see what would happen next and I ended up watching like, five episodes at a time for the next week.  This was all the fun of a good old detective-versus-dark force crimeflick, from the dark force's perspective and the characters",
    "\n                Death Note: 37 episodes of the main character Light Yagami  going up against some of the greatest users of logic in fiction outside of Sherlock Holmes. L is particularly fun to watch. The premise starts strong and keeps getting stronger as elements are brought up and used and taken as far as they can go.\n\r\nNow if only I could say the same for the characters, in particular, three characters are introduced after Episode 26. (The only real break/ half-recap episode in the series.) Any major ch",
    "\n                I think Death Note was an OKAY anime.\n\r\nI didn't really like how L was, I don't know, I personally thought it was weird. Also, I thought that Ryuk and Rem also had a very awkward appearnace; even if they clearly aren't supposed to have a human-like form.\n\r\nI didn't like how one of the characters was defeated so easily after all that strategy. (Sorry trying not to spoil anything)\n\r\nI liked how there was a lot of logic and strategy put into this anime, it was very clever on how L and Light fo",
    "\n                *Note that this is my first review so it may not be done really well*\n\r\nDeath note, probably one of the most popular anime series out there, has continued to be a fan favorite even though it was released more than a decade ago.  For that time, it was regarded as a magnificent piece of fiction and made a huge splash in the anime world. It is often cited as one of the many gateway anime to bring people into watching anime and many people have paraded it as a masterpiece. However, it has been ",
    "\n                Light Yagami is a bored genius living in Japan, whose life is changed forever when an equally bored Shinigami(Death God) drops a mysterious notebook from the sky....\n\r\nA smart psychological anime that starts off amazingly strong and gradually declines. Some characters are good(most of the good ones die though), and one character in particular is the most annoying character in any anime I've seen.\n\r\nOverall, Death Note is a classic that every anime fan should watch.\n\r\nPros:\r\n- Starts off str",
    "\n                Death Note is one of the best animes I have seen. The story was very original about what is true justice. Whether killing people is right or not. The challenges of Light and L. The way the solve it. (I gained more knowledge from it) Mentally testing each other. Not having fillers like some animes that has nothing to move the theme along.  The drama that it gave it like \" ...I will take a potato chip and EAT IT\" Light Yagami and all the funny parts of it all.  So overall, this is an awesome ",
    "\n                Deathnote is quite a show. Never before has a show had such a far reaching influnce. It finds appeal in the east, the west, with the young and the old. For the westerners in the world, this is the first anime i would suggest watching. My parents and even grandparents have watched this show with me, and they love it. This is the very definition of mass appeal without selling out. Whether you like Deathnot or not, this is the best anime ever made without question. It's not my personal favorit",
    "\n                Death Note is definitely a dramatic, attention-keeping anime that I would love to watch again. \r\nThe story line of this anime is very unexpected at some points. With most animes and/or tv shows that I watch, I can easily guess the ending or at least compile a list of suspects. With Death Note, that was not the case. Everything from relationships to killings were very unexpected. The author of the manga and the director of the show must have been extremely intelligent people. They came up wi",
    "\n                \"Deathnote\" is one of the few anime that is both highly intellectual and cynical in a very mature way.\r\nThe show is pure brain food.\r\nIf you like cynicism and a dark view on humanity and like brainy shows like the first seasons of \"House\", Ghost in the Shell or the old Sherlock Homes books,\r\nThis is a must see.\r\nIf you are like everybody else you probably find it disturbing \r\nthat the protagonist is a sociopath hero and the anti-villain is a amoral super detective that cares more about the ",
    "\n                If you had the power to kill anybody just by writing their name into a book what would you do? Would you become a vigilante killing anybody who makes the world a worse place to live in, or would you kill anybody who defies you, making you a God one step at a time...\n\r\nWhen I first saw death note I watched the entire series in one sitting. It wasn't particularly short either so that shows you how much I liked it. The intelligent and contrasting characters kept me entertained along with its i",
    "\n                Death Note.\r\nDeath note, one of the most popular anime ever. There are an incredible amount of people saying it is a masterpiece and declare it as the best anime ever, others say it's proper shit and a waste of time. So today I'll be talking about some arguments from both points of view. This review is not spoiler free but I will tell you before I get into major spoilers if you don't want to hear them if you have not already been spoilt to it already. This is the Youtube video version of my",
    "\n                I have to say, after finishing the show yesterday, I couldn't reflect accurately upon what I had just seen. It was an amazing show that made me feel like I had taken a spectacular journey in only 37 short episodes. The last 10 episodes aren't as thrilling as I had hoped perhaps, but still, looking back on this journey I'd be lying if I said I didn't enjoy it. \n\r\nEven the last 10 episodes gave a necessary conclusion to a show that I think many of us didn't want to see end. My only wish for t",
    "\n                Death Note is a recognisable anime and deservingly so given its unique but not completely off the planet weird storyline.\n\r\nDeath Note revolves around a Death Note, a notebook with which the user can kill by merely writing a person's name in it whilst picturing the person. When Light Yagami, a high school student, discovers a Death Note belonging to a Shinigami, he sets about a quest to cleanse the world of evil. However, there are many who attempt to bring \"Kira\" to justice, namely the eni",
    "\n                Death Note is, for me, the best mystery anime to ever exist. It is an essential viewing for those who want to dig deep into the mind of people whose actions you may or may not agree with. Perhaps that is the reason why I loved it so much.\n\r\nPROS\n\r\nTo start, this anime has an important theme - the definition of right and wrong. Yes, this theme has been used to death (no pun intended) on other anime, TV shows, and movies as well. Yet, no other story has come as close to understanding this the",
    "\n                Reseña de Death Note en español SIN SPOILERS\n\r\nDeath Note. El anime con el cual entrar de lleno al mundo del anime. Generalmente todos comenzaron a ver anime por la televisión con series como: Dragon ball, pokemon, digimon, etc. Sin tener idea que eran \"anime\", pero ya sabiendo que es anime Death Note es la mejor opción. El argumento se trata de un estudiante genio y deprimido de la vida, encuentra una libreta con la cual tiene el poder de asesinar a las personas escribiendo su nombre. El a",
    "\n                *Light spoilers*\n\r\nDeath Note really brought something intriguing to savor in the anime universe: a notebook that can kill people. The concept must be appealing to most demographics who crave enjoyment. Once the underlying theme is set, the other designs fall naturally into place. Such is the case with Death Note.\n\r\nIt started with lots of promise, with two geniuses facing off against each other with the 'Shinigami' providing added swirl to the intensity. Its a lot like Sherlock vs Moriarty",
    "\n                [Introduction]\r\nDeath Note is a very unique anime. It is not every day that you find an anime, or any television show for that matter, that keeps you on your toes for multiple episodes.\n\r\nThe plot picks up pace with the entry of The World’s greatest detective, called L. While the premise was already interesting, the entry of L provided a different perspective to what Light was doing. From the eyes of Light, he was cleansing the world of evil. On the other hand, L believes that what he was d",
    "\n                A masterpiece, simply said. Death Note is everything an anime should be. The first unique anime that changed the way I felt about animes. Death Note was the anime that got me back into animes. I was an avid watcher of anime on Toonami and Anime Unleashed on Tech TV. As I grew older I separated from animes and felt that nothing new would ever be as good as an anime during my childhood. Well I was wrong, this anime blew me a way in more then words can describe. The love you will feel for thes",
    "\n                Intro: Are you a fan of M. Night Shyamalan or movies with cool psychological and intellectual story elements? If so, you've come to the right place. A lot of people tell me that Death Note is one of their favorite anime and after finally watching it, I finally understand why. Not my personal favorite or even in my top twenty, but I had a lot of fun watching this anime. It's a pretty unique story with fun characters to watch as they progress and grow. Now that that's out of the way, let me b",
    "\n                Well all This is my first review , excuse me but i am Writing this as this Anime has mean allot to me and i Hope You can share this excperience . I`m starting this review by saying this Anime means allot to me . L & Light , The trauma,the intrigue of these characters is Truly phenomenal. Really i have never felt something like that.Its a Tug of war between Justice and injustice . I believe that Light is one of the Truest characters and the closest To Human nature of many humans in the world",
    "\n                DEATH NOTE REVIEW:\n\r\nMINDSET:\r\nIt is more cool that it is dark and moralistic with its themes.\n\r\nREVIEW:\r\nTo me, I view Death Note as a show whose emphasis is not towards realism, but in the more rule of cool aspects since this is a Shonen Jump show where talking about. It has some aspects of it, but for the most part, You are really just looking at how two sides of the argument with near grey morality have an eipc battle with the power of their wits and cunning. And this is how most people",
    "\n                Ah, Death Note. One of my favorite anime of all time. Death Note is a pretty unique experience. You follow Light Yagami, an completely ordinary student. However, this all change when Light find the \"Death Note\", a mysterious notebook owned by all the Shinigamis, a.k.a \"Gods of Death\". This is where things gets crazy. Light, after testing the Death Note on some random criminal, start to like his newfound powers, maybe even too much. With those powers, Light intend to kill all the criminals, ",
    "\n                I'm pretty sure everyone on the planet who's seen any anime has seen Death Note. It's a staple and it might just be the best game of cat and mouse story where neither one knows which they are. Well worth a watch, deserving of the hype, and a solid gateway show if you've seen a few movies but never watched a series before.\n\r\nThe premise is simple, write a name in the death notebook and they'll die the way it's written. That's a pretty simple story mechanic, but it opens up a lot to explore. ",
    "\n                Death Note... ah yeah... Death Note didn't really go down so well. \n\r\nThe simplest way to put it is that it's about two high school then college kids who attempt to outwit each other in games of strategic internet keyboarding. \n\r\nRight! Sounds like MAL eh BA DUM TISHHHHHHH\n\r\nOk sorry. \n\r\nAnyway, the biggest thing to note about Death Note is that like everything happens in the  first few episodes. In that span we go from someone who has the power of life and death over all kinds of people an",
    "\n                Death Note definitely deserves all the praise it gets. I don't think it's overhyped at all. Albeit, the premise is a tad bit unrealistic. But that didn't prevent me from enjoying the anime. It's not like the show prides itself off it's realism. It's about a notebook that kills people, for fuck's sake. I respect the writers immensely, because they acknowledge that the premise is unrealistic. And by simply doing that, they turn a totally bullshit scenario into something more familiar. They us",
    "\n                Death Note\n\r\nReview By: John Fragglepuss Evans\n\r\nDeath Note is a popular anime and it is easy to see why. It is a quality show that has plenty of character development, a complex storyline, good animation, a quality soundtrack, and a realistic setting combined with supernatural aspects. The show involves a lot of death so the immense popularity does somewhat surprise me, but then again, Attack on Titan is one of the most popular anime out there, and it involves just as much death and maturi",
    "\n                death note is a show that is often compared to a game of cat and mouse, except you never know who is the cat or mouse at any one time which leads to a rather gripping show and honestly would be worth scores of 9 or 10... however, there is on MASSIVE problem that many fans simply overlook or maybe they are just blinded by episodes 1-25 because after that the show, which is standing proudly on the peak of anime greatness, comes crashing down into the abyss. this is the problem i have with peo",
    "\n                *This review contains spoilers*\r\nFirst review.\r\nDeath Note is an anime I feel very conflicted about. I hope that this review might explain my opinion. \n\r\nThe story of Light and his quest to become \"God of the new world\" is one I find very interesting and appealing on a personal level. The \"Death Note\" is a very unique plot device and like many magical plot devices it has a set of rules to stop the plot from ending before it starts. The beginning is the best place to start: We are introduced",
    "\n                Text written in English\n\r\nWhen I saw the first episodes of Death Note, I thought it was\r\nsimplez and such, but after I will realize that the anime is quite complex, because of the Death Note rules, the first episodes of death note were simply legendary, for he was a young anime style, with indirect battles and using strategy and the fact that the two protagonists were on opposite sides, but we can not tell which side was the good or evil because both have goals that benefit the world, more ",
    "\n                I am quite prideful to admit that Death Note has changed my life. It has allowed me to start questioning the idea of mortality and human worth. One simple question which will allow you to determine whether the protagonist is a villain or a hero: Should a man who has done terrible crime(s) (such as raping a woman) be respected as a human being and do they deserve to live? If your answer is no, like me, welcome to the dark club, where you believe Light Yagami, our signature character, to be t",
    "\n                Death Note in a word: Ethics\n\r\nWho's right? Who's wrong? Who's the hero? Who's the villain? Why?\n\r\nEven though Death Note is one of the \"mainstream animes\" like SAO and AOT, I really enjoyed it. I do agree the fan base can be annoying at times, but judging the anime solely on its content, I liked it a lot. I've seen both the dubbed and subbed and found both to be addicting. So, I say no worries there.\n\r\nThe quality I enjoyed the most was the way it made the viewer question their own persona",
    "\n                Tl;dr: This is my first anime I've watched through and through, it's a pretty great show. I personally didn't like some parts of the second half due to some pacing issues and writing issues with Near and Mello.\n\r\nDeath Note is a battle of wits, two intellectual power houses face off in a game of 4-D chess, who will win, who will lose? The show sets up a very interesting premise and some even more interesting rules behind the Death Note itself, instead of making the notebook a cop-out for ev",
    "\n                Death note just about tops my anime list. It is the most intellectual and thrilling show I've ever seen. I mean who knew a story about a note book could be that interesting? The character development throughout the series is excellent and the plot line is just phenomenal. This story will really keep you on your toes until the very end! Every scene is crucial in the plot development so it's important to pay attention to the entire dialog being said. I loved the quality of the picture and the",
    "\n                Oh my god this is one of the best things I've ever seen I cant believe this is only 17 this should at least be 5 or 6 I love this show to no content. Bleach and Dbz were not even close to how amazing the story is . It is about a high schooler named light who hates where the world has gone all of the sudden a note book falls from the sky and lands right in front of him and he takes it home cause wouldn't you? When he starts reading it he thinks it's a joke that if you write someone's\n       ",
    "\n                Anime: Death note\n\r\nTitle: My expectations have been satisfied.\n\r\nAbout the Anime: Have you ever felt like the world would be a better place if certain people weren’t around? Such grim daydreams might occur when watching the dismal daily news, but on one fateful day, Yagami Light finds that these daydreams can become reality. By pure happenstance, he comes across a black notebook entitled \"Death Note\", whose text within states that whoever's name is written on its pages will die. With the a",
    "\n                Death Note is like the edgy lovechild of the police dramas my step-dad watches at night when he thinks I’m asleep and my fantasies about killing him. I’m pretty sure every kid whose parents split up has dreamed about the power of a Death Note. Imagine the revenge against the bullies at school and my biological dad who left us for a Scandinavian chick! Although it’s not real, it hurts to know that the Death Note is wasted on some uppity rich kid who just wants to kill criminals. Seriously, L",
    "\n                Death Note is definitely one of the most mind freaking, mind blasting anime's to watch. The characters Light Yagami and L are made in a way that they both have outstanding intellectual capacity of understanding things. Their judging and acting to the situation is very accurate. Its like a chess game where if you have thought about a counter then the other person has already thought about what has to be done.\r\nDeath Note is a cake; everything good about a cake; and therefore people should se",
    "\n                DEATH NOTE tells the story of Light Yagami, a 17th years old boy who found a Note that has Mystical Power to kill someone by writing its name on it.\n\r\nMy Priority watch this anime? (High)\r\nThis is a must Watch! \r\nDeath Note is now available on Bluray Remastered!\n\r\n-Character\r\nLight Yagami uses the Death Note to kill bad guys and create a Bright and Ideal World. he is more look like a Villain than a Heroes, which makes it interesting.\n\r\nthen there's Lawliet also known as 'L' the best detecti",
    "\n                ~ No matter how gifted you are, you alone cannot change the world ~ (Death Note)\n\r\nStory: The world is full of injustices. From the beginning of time, strong has always preyed upon the weak. The young guns are full of hope and dreams. One of them is Yagami Light, a high schooler who had this desire to wipe out the evil from this world. Since his journey to become the \"god of the new world\" begins. \n\r\nIt is a highly refined story which show two brilliant minds battling it out for what they b",
    "\n                I was feeling in the begin of the anime when i was watching the first episode ''What a drag.'' I was after watching the first episode not very motivated to watch more. So i quited the anime and after 6 months. I was getting some animes at the day i was going at summer vacation. So i grabbed Death Note very fast and watched the whole anime in 5 days to a week. I must say that it was a good anime. I didn't like every person, like N or Mello.\n\r\n(The following is written contains spoilers, like",
    "\n                What is right what is wrong, is that something that could be judged? No, because everyone have their own views regarding 'justice' though at the end of the day it's just about various opinions conflicting with each other as everyone believe that their 'justice' is correct and what the majority believes is what is known as 'justice' or 'law'. But to be honest that's just our opinions which aren't right but not neccesorily wrong as every person views crime from a different aspect regardless o",
    "\n                Revenge, trust, murder, love, pride, justice, faith, sin, sacrifice, good, and evil. These are all things we think we understand. Until one day, be it a random coincidence or a faithful encounter, our beliefs are put to the test. Nobodies like ourselves struggle to find out just how exactly we fit into this world while the others carve a place for us. These entities stand above us. They try to rewrite what we think and how we feel. And even their most benevolent intentions soon turn to glut",
    "\n                Well what should I say and where should I begin\r\nDeath note is one of the fewest Anime out there that can really make you believe in the brilliance of Animated shows for real, and quite frankly it is an Anime with no need for reviews, one can just simply cry out (WATCH DEATH NOTE) instead of pointlessly trying to convince people who didn't yet watch it\n\r\nFrom beginning we are graced by our anti-hero Light Yagami, a brilliant high school student who happens upon a Note that exacts death on a",
    "\n                Notice: Spoilers in Story section\n\r\nNow, I absolutely loved the anime. I will not say it's the best, or the worst. It is entirely my opinion. I saw this when I was in fifth grade, and I re watched it many times throughout my life. This could mean two things; I'm brutally honest, or I'm just a critic.\n\r\nStory: (8)\n\r\nThe story was an amazing idea. Watching to smart minds compete against one and anouther was the best idea I heard. Each time I watched it, I could see more jokes that peak throug",
    "\n                I just finished watching the series and it amazed me until the very end. I actually don't watch animes with long series of episodes, however, when I tried watching the first episode, the plot caught my attention to look forward on what will happen next - causing me to watch all episodes one after another. It took me several days to recover from the heavy feeling of my heart caused by the ending. Overall, it's brilliant!\n\r\nMy Thoughts:\r\n1.) Yagami Light's major mistake that caused him to lea",
    "\n                A little late in writing this review but that's OK.  What can I say about Death Note, this Anime is truly one of the best ever made in all of Anime history.  With it's excellent story and characters how can you not like it.  \n\r\nStory:\r\nLight Yagami is an ace student with great potential, but he is fed up with crime and evil in world.  When he finds a notebook called the &quot;Death Note&quot;, everything starts to change from him and the world around.  He soon learns that the notebook can b",
    "\n                This review is to give any newcomers a basic idea of what this anime is about, so there wont be ANY spoilers (Even if it is the slightest of spoilers) in this review. After all this time I finally decided to write the review and relieve the awesomeness of this anime that was trapped within me onto this review. By the time you finish this review, you will find yourself watching Death Note. So here comes another review of one of the best anime series of all time.\n\r\nGenre - If you are a deep t",
    "\n                The true biggest betrayal in anime history is when people compare Lelouch from Code Geass to Light. It is one of the worst comparisons I have seen as of yet, its pretty much like comparing Thanos to Voldemort... they have nothing in common besides being villains. One character is given no development, has infinite plot devices/holes, and has a shitty motive. The other is the great Lelouch.\n\r\nDeath Note has no clear stand out trait that makes you say \"man that part of the show was far and be",
    "\n                Like Berserk, Sunabozu and a slew of others Death Note features a protagonist who is, not to mince words, a complete cunt. In fact nearly all of the characters in Death Note are unlike able cunts (apart from one, the only character I liked and she gets shit on repeatedly), but luckily they are quite entertaining and engaging cunts. Death Note is in many ways a spin on the classical murder mystery tarted up with some odd supernatural trappings. However it is the unfolding of the investigatio",
    "\n                \"You either die a hero or live long enough to see yourself become the villain.\" - Harvey Dent\n\r\nThis quote, I believe, fully matches Death Note. What a brilliant anime. It has a very unique story: a god of death drops a notebook into the human world. A boy, Light Yagami, picks it up and discovers it has the power to kill anyone with only a name. He resolves to become the God of a new world, free of crime and corruption. He is constantly opposed by L, the world's greatest detective who has m",
    "\n                When I first heard of death note, It really didn't interest me. An anime about someone with a note book which can kill people. What's the fun about that? Nothing. But I just had to give it a chance. Because all my friends were watching the anime. And so I watched the first episode.\n\r\nThe story got me! It isn't about someone with a notebook just killing people, no, the whole essence of the story is about morality. When is someone good and when is some a bad person? If you get divine power, w",
    "\n                Death Note, incredibly famous, but for a (good) reason. It's probably one of the best thrillers that exist in anime, and if we're talking about psychological thrillers, it may very well be at the top.\n\r\nIf you've read the synopsis you know the base of the story and what will happen. The story is unique in that a book from another realm comes into the human world, and anyone can find it, and write in it to kill the person they are thinking about. The protagonist, Yagami Light, finds this boo",
    "\n                '' THIS REVIEW CONTAINS SPOILER ''\n\n\r\nCarrying the concept of Genius, Cunning, Justice and of course Death uWu: v, Anime which tells about the brain war of one person against one world alias Solo Vs Squad between LightYagami against L, Near, Mello, FBI, Japanese Police, SPK, Mafia etc. Why I say alone because indeed Light's subordinates like Mikami and Takada are just a puppet controlled by Light while L and a world even Light himself work together to reveal Light's own identity (KIRA).\r\nOf",
    "\n                Death Note is very very good! The cat and mouse chase between Light and L (the GOAT) is very brilliant, and there are so many twists that come out of nowhere that are very entertaining!!! Some people might pull these out as plot armour or random bullshit, but even if that was the case, who cares!? If its for entertainment sake, then let's go!!!\n\r\nUsually in anime you see battles like beating the shit out of each other, rather than battles done by brainpower and tactics! And Death Note does ",
    "\n                Death Note is frustrating.\n\r\nAbout fifteen to eighteen episodes in, I was about ready to believe that the show deserved its ranking at #1 as this site's \"Most Popular Anime\", and I was more than willing to list it on my favorite anime list...but then something happened.  That spark Death Note had, that hook, that energy it drew me in with started to decay, and by episode 37 I was left an emotional wreck, trying to place the exact moment where the show lost me and how it did.\n\r\nFirst off, it",
    "\n                There is a good reason why Death Note has become so well known, not just only within the anime community but within other forms of pop-culture as well. This anime has captured the attention of many people and rightfully so. There is so much that this show does correctly within its format and how it makes the viewer feel and think.\n\r\nNot many shows are able to captivate audiences like Death Note has. With a story so intriguing in it’s premise and one where characters are never stale, there i",
    "\n                To begin with: Death Note is one of my favorite...if not my favorite anime. It has a unique plot line, and you have to keep up with the story or you'll be lost.\n\r\nStory:\r\nA note belonging to a Shinigami falls to the human world. Anyone whose name is written in the note will die. A student named Light Yagami picks up this notebook, and uses it to rid the world of all criminals. \n\r\n...Basically, if you yourself found a Death Note, would you use it for the same goal? What would you do if you f",
    "\n                Hands down one of my top 5!!!\n\r\nWHAT YOU NEED TO KNOW:  Yagami Light is an exceptionally brilliant boy with a father on the police force.  Light loves detective work, and likes to follow his fathers cases.  One day while at school he finds a a note book.  To sum it up, if you write someone's name in the notebook...they die.  Watch the series for the twists and exceptions. The series has a deeply developed plot, with several twists.\n\r\nLight tries to cleanse the world of all evil by using the",
    "\n                Ever thought of killing someone you disliked to make the world a better place in almost a blink of an eye? Well death note is the perfect example of this\n\r\nLight Yagami believes this to be true, why not watch this anime to find out how fun it is for light yagami to start killing people without even physically touching them? It will be worth the watch...\n\r\nOverall I thought the anime is a masterpiece because the main character was evil unlike most main characters in other animes and he has a",
    "\n                Let's see here... Death Note is a really f*cking great anime, the only bad thing I can come up with is one character, and one character only: Misa Amane, god she was annoying, other than that it's flawless, IMO.\r\nNow, enough about pointless stuff.\n\r\nStory: You already got a synopsis of the story so I won't go too deep in it.\r\nLight Yagami, a 17-year old genius who finds a notebook with the words \"Death\" and \"Note\" on it.\r\nWith this book he wants to cleanse the world from criminals and becom",
    "\n                This anime is one of grate anime in history of manga. It has outstanding art ,sound ,character,story .You can watch it again and again . The death note writer has made a masterpiece story . \n\r\nStory - This story revolves around a clever student and police department of Japan .A death note gets in hand of evil student Light Yagami . He dreams world without crime. He gets a notebook called death note he kills every criminal living in world. He thinks himself as god of world . Many special age",
    "\n                I’ve just finished this and... I’m just speechless. The only thing I can say is go watch death note right now, cause if there’s something I’m certain of is that this show will be impactful in some way, most likely emotionally or philosophically, in your everyday life. Like I said, I’m at a loss for words, but this show has something to say, a really important message that is worth hearing at least once in your life. So, if you’re tired of hearing how much of a classic this is, and seeing it",
    "\n                death note is a very popular anime, and it is not hard to see why.the idea of two very intelligent people trying to defeat each other in a mind game centring around a note book with the power to kill is not the norm for most animes.no robots.no superpowers.no fanservice and best of all no filler.Death note is a psychological thriller that keeps you on the edge of your seat.\n\r\nStory:death notes story is brillant.Light yagami finds some smart way to use the death note and the master detctive ",
    "\n                Death Note is the perfect anime for those who like the darker genres of anime, or very detective/mystery type things. You always have curve balls thrown at you, and the characters are loveable. Each one has their own likableness to them, but they all have their weak points as well. Well rounded foundation, good plot, great artwork. Now, for the live-action movies.. Equally as great. I loved every bit of the anime and the movies, both live-action and animated. The manga I haven't read really",
    "\n                Death Note is the most amazing story I have ever seen. It remains to this day my favorite piece of fiction.  The story is incredibly unique. The story has some dark themes, and really makes you think.\n\r\nThe story is mostly split up into 3 parts, but the majority of the series breaks down to the battle between the Japanese police department and Kira, a mass murder who kills criminals by writing their name in a notebook. The epic battles of intelligence between the police investigation and Ki",
    "\n                This has to be the best Anime ever created. Period. Light Yagami may be a psychopath, but I do understand his vision for a better world. He's like... Saint Dane from Pendragon. He started with a good vision, but power corrupted him. He made the mistake of thinking himself to be a God, and he payed with his life. He also made bad decisions in choosing his disciples. Misa Amane was a complete moron, and Teru Mikami was insane. Light's mind games with L and Near, and even Mello, were all inter",
    "\n                For me, Yagami Light is an adolescent  who get tired of studying, watching tv or using his computer. He get bored of following the rules of a society that he dislikes a lot; when he found a note with the ability of killing people without letting a clue of his identity, he wanted to create a perfect world, a world in which he would be a god.\n\r\nAlthough the idea of a world in which there are no \"bad guys\" is something wanted by most honorable citizens, Light will find out that he cannot make ",
    "\n                THIS WILL CONTAIN SOME SPOILERS: Well Death Note is a very good anime but I feel as though it really does make some really bad choices. The anime is unofficialy broken up in to three parts. The 1st part i felt was very good. It kept a very good tension with the search for the mysterious Kira aka Light Yagami. At one point it had me rooting so hard for Light to figure out this girls name so he could kill her, which i found terribly morbid but it was compelling enough to make me wish death on",
    "\n                This was the last anime that I thought I'd need to write a review for because I thought it was universally acclaimed, but when I stumbled upon this reviews section I found out I was unfortunately wrong. As it always goes with popular things, people feel the need to show others they dislike Death Note so they come off as cool and indie, and make use of poor argumentation and sheer lack of understanding of the anime in order to do so. I don't need to talk about all the great things Death Note",
    "\n                This anime is the shit, I remember watching it during my third year of my university degree and I finished it so quickly. Its thrilling, full of excitement and will get you of your seat at no time. Yo this writer is some bad motherfucker man, he needs to get an oscar for this shit. Man had to delay some pussy for a couple of days just to finish this because it was worth the time. Hoes, money and clothes can change you but when I decided that this anime was important to give time to spend wa",
    "\n                Death Note (デスノート) (Desu Noto) is one of the best, if the not the best Anime series of all-time. It is a true masterpiece in my opinion. \n\r\nDeath Note \r\nDirected by: Tetsurou Araki \r\nWritten by: Toshiki Inoue\r\nCreated by: Tsugumi Ohba, Takeshi Obata\n\r\nStory (10/10) \r\nThe story is absolutely unique. A notebook called the Death Note falls from the Shinigami Realm into the Human World. The human who finds the Death Note can kill anyone they want just by simply writing their name into the Death",
    "\n                death note was pretty freaking good.\n\r\n I just finished watching the last episode and it was amazing. Lots of critical thinking involved and intense situations. Most of the story takes place with them doing their cop work. There are so many clues leading to who \"Kira\" is and the characters try really hard to not believe who he is. \n\r\nwhat I meant by critical thinking was that they do a lot of tricks to get the person who \"kira\" is exposed. Many intense situations and in a way a lot of manip",
    "\n                Death Note is a must watch for anyone wanting to watch an anime. Its popularity speaks for itself. I liked Light Yagami more than most and he is one of my favorite characters. Unfortunately, the anime is not entirely perfect and gave a very letdown ending. But still, I would recommend that you watch it till the end, at least for Light Yagami. He is not the smartest guy on the planet, but he sure gave quite the fight.\n\r\nThe anime, which consists of 2 arcs, has the first arc executed perfectl",
    "\n                My first anime tv show that I ever watched.\n\r\nNumber of Episodes: 37 (about 20 minutes an episode)\n\r\nPlot: A+ *Based on a rather simple concept of a book that you write people's names in and that person dies. If a person tried to become a god of the world wielding the book, would anybody be able to stop them? It is quite impressive how intellectual this show is. It's a fun psychological battle of wits that you can't help but be amazed at how smart Kira is and how clever the task forces are ",
    "\n                VERY MILD PLOT SPOILERS. YOU HAVE BEEN WARNED.\n\r\nDeath Note is nearly a masterpiece; it certainly deserves to be one of the most popular anime of all time. The mystery and drama are played off incredibly, and the two MCs bounce off each other perfectly.\n\r\nLight Yagami is a student who, one idle school day, sees a book fall from the sky. He learns that writing somebody's name in said book will cause them to die soon after, with more caveats and freedoms explained later in the show. The book'",
    "\n                Light *breathes*\r\nL :\"he is Kira\"\r\nLight \"holds his breath for a second\"\r\nL:\"wow, he figured out my master plan, I'm now 98% more sure that he is Kira!\"\r\nsupportive cast: \"no! he can't be Kira!\"\n\r\nSue me, but the famous mind battles between L and Light were the worst part of the show for me. From episode to episode you have them circling around each other without any progression and development. Up to the memory loss arc the plot barely moves in any meaningful direction, it's all about L an",
    "\n                TLDR: I came into Death Note knowing big plot points. If you are like me and put the show off  for a long time because of that, still watch it. It is worth it.\n\r\nI watched this anime knowing certain major spoilers, which is why it took me so long to get myself to watch it. However seeing it on Netflix and bored this quarantine I said why not. Definitely glad I made that choice because Death Note still holds up to be an incredible strong story through the knowledge of major spoilers. The sou",
    "\n                --------------\r\n CRITERIA\r\n--------------\r\nStory: 8.5 \r\nAn Amazingly unique story of the likes I’ve never seen before. The main protagonist being a high school student, who like many others can see the faults in the world but is unable to act upon them. One day a he stumbles upon a mysterious book that has supernatural powers and one too many rules. The protagonist Light Yagami uses this book in order to ‘cleanse’ the world and make a new purer world with him as Kami.\n\r\nEnding: 4 \r\nOne of t",
    "\n                The evils in this world are inescapable.  No matter where you look, no matter where you go, there are people out there who seem to do nothing but hurt others.  They take advantage of them, preying on anyone they can get even the smallest leverage over, letting their own ingenuity do the rest.  Rapists, murderers, thieves, all of them are nothing but soulless vampires hurting the people around them with no thoughts towards anyone’s feelings but their own.  There’s no escaping it.  God made a",
    "\n                O my god, this anime is one of the best anime I have ever seen if not the best! anime.\r\nThe story is brilliant such a simple idea of a death note can make such a incredible thriller.\r\nThe first episodes were brilliant, I know after 5 episodes that I wanted such a death note. \n\r\nThe character:\r\nLight (aka kira) is incredible, he is extremely smart, popular and good looking. He is bored, bored with his life and bored with other people. He hates criminals he disgusts them. Then when he gets th",
    "\n                I love love LOVED Death Note! It is definitely the best anime I've seen so far. The story is very interesting, an average high school boy who goes from, well, average, to a 'psycotic murderer', as I like to put it. The story is pretty much a game of cat and mouse between L and Light/Kira until Near and Mello arc starts. I love the way the characters think, they are extremely smart and I feel by watching this anime my deductive skills have raised. Even though I dont particularly 'like' Light",
    "\n                “I’ll take a potato chip… and eat it.” – Light Yagami\n\r\nThis is perhaps one of the most iconic quotes in all of anime, and yet so many people fail to realise its profound deeper meaning. It is not simply a quote about eating potato chips: it represents the life-or-death battle for supremacy between Light and L. It is a metaphor for Light’s ability to continue to murder criminals, which he can do with the ease of eating a potato chip.\n\r\nEach individual potato chip that one eats is not consid",
    "\n                Death Note was an excessively suspenseful anime full of excitement and thrill. Although the ending had been a little abrupt, if you rewatch it a couple of times, you might see the beauty of what this anime possesses. Each individual character had unique characteristics, which made delighted me even more. The plot was extremely planned out well; young Light Yagami finds a sole Death Note and starts creating schemes to extinguish evil from the world. He is considered as the &quot;best&quot; i",
    "\n                I can't help but think that Death Note's acclaim came too early. Viewers should have waited until the story concluded before bestowing it with accolades, because the second half of the series completely falls apart after a brilliant start. The engine driving the show (Light versus L in a duel of the wits) breaks down, leaving the viewer feeling cheated out of what they were promised at the start. I will do my best to state my complaints without spoiling the progression of events, but it's i",
    "\n                This, so far, is the BEST animanga I've ever read/watched.\n\r\nSTORY: 10/10. The whole synopsis of the anime was simply astounding, from the start to finish. :)\n\r\nART: 10/10. The anime was perfect, in art's perspective.\n\r\nSOUND: 10/10, because primarily, I loved the soundtrack!\n\r\nCHARACTER: 10/10. Technically, I am (and always will be) pro-Light. I am really curious of what would've happened if he succeeded.\n\n\n\nENJOYMENT: 10/10. Although I watched at least 5 shows a day until I reached ep. 20",
    "\n                This is the first in my top 10 animes I have ever watched that I will be reviewing though there's little to be said that hasn't been said. \n\r\nThis anime withstood the test of time and still stands to be one of the most brilliant things I have ever seen. There are no certain heroes in this anime and you keep rooting for your anti-hero (Light) long past his expiration date that is set off in the middle of the anime. \n\r\nThe story is simple and there's abundance of action and in-action, where b",
    "\n                Death Note is a true master piece of an anime. It is rare that a medium, other than a documentary, can make you feel so smart. Death Note's constant twists that always keep you on your toes and masterful use of storytelling does this perfectly, as you begin to predict which move L or Kira would make next.  \n\r\nI actually came into Death Note expecting to be disappointed an uninterested, as it was the first anime I had watched and I absolutely hated the medium at that point (don't worry, I'm ",
    "\n                Ok,this is my first review .dont be harsh on me .English is not my cup of tea .my mother does not speak this language..\r\nBefore this anime i have watch 4 show namely PLEASE TEACHER ,ELFEN LIED ,PLEASE TWINS ,rumbling hearts but after watching this my choice of anime or should i say that death note made me realise that there is a lot of depth and greatness in anime realm or should a say that DEATH NOTE  made me otaku ... but anyway ..\r\nThere is nothing about this anime that hasnt been mentio",
    "\n                Unlike most other anime fans, it took me quite some time to even consider watching Death Note. It's pretty damned popular, that's for sure, but upon completing it, I felt compelled to give my own two cents to the series.\n\r\nThe Story (Potential spoilers may be ahead?): 8/10\n\r\nDeath Note comes in two major portions, so we'll start with the first portion. \n\r\nThe series starts out pretty interestingly, unraveling rather vividly in the very first episode. Light's actions with the supernatural De",
    "\n                Death Note is a work of art! \n\r\nThis anime is the type of show that will have you watching it episode after episode. With a bright, beautiful 'villain' whose name is literally Light, and a shady, gluttonous 'hero' named L its hard to not love this anime just for the juxtaposition of a typical story duo. \n\r\nThe characters in Death Note all have fantastic detailed background stories that make you fall in love with each one individually, from child prodigies to master thief's to gods of death ",
    "\n                Where to begin when you want to review a classic like DEATH NOTE? \n\r\nAnd a classic it is, indeed.\r\nDeath Note was, and still is, one of the few animes that showed us that you do not need super muscles and insane large-scale battles to have true action.\r\nThis is a PASSIVE-AGGRESSIVE show, no kamehamehas of the sort, mind only.\n\r\nThe entire series relies upon TWO RIVALS. \r\nOne is Light Yagami, a talented and charismatic young man who stumbles upon a death-giving notebook, and choses to use th",
    "\n                Only two words can describe this anime series Suspense Incarnate and is really one of the most thrilling anime of today. It combines mystery, supernatural, and philological elements which make it really epic and the themes of justice, corruption, godhood, and control can truly make it awesome and relate to the flaws of society. The characters have complex but aspiring personalities that it can make you relate with and even feel sympathy for them as they struggle to reach their goals. Howeve",
    "\n                If you happen to look at my rating, it may seem rather low, and for some reason, my singular rating might discourage your from watching/reading. DO NOT DO THIS. I ended up disliking Death Note after an occurance about halfway through. I think. It's been a long time since I saw it. Anyways, I just couldn't deal with it and was unable to continue. It's still a wonderful anime. The artwork for the Shinigami's is amazing. They're creepy and almost gross, yet acceptable. You can't help but like ",
    "\n                If you're looking for an anime that's a bit different, you may want to try Death Note. This may seem like your typical everyday anime, but it's really not. To be honest, it actually has a very unique and well thought-out plot, so you don't get confused as easily. Even if you happen to get confused in a previous episode, you don't have to worry, because they make sure to explain it to you in the episodes to follow. \n\r\nPlot-- This anime follows the story of Light Yagami, an innocent high scho",
    "\n                \"Death Note\". The name itself is used as the gold standard for greatness in Anime. To say \"Death Note is a must see for Anime fans\" is like saying that \"Oxygen is a must breath for human beings\". I don't doubt it's greatness. But, I don't think it's perfect. \n\r\nThe show is as well written as any TV show to date (that includes all TV shows) and it features characters that have transcended the Anime world and are now part of pop culture itself. I didn't need to see the show to know who L or L",
    "\n                Death note is an all time classic and one of the best and most beloved anime ever. The story follows the high school student Light Yagami who loathes the world since it is filled with criminals and the shinigami (God of death) Ryuk who is bored of the shinigami lifestyle. Light discovers a mysterious notebook called the Death Note that says that if you write the name of a person and picture their face in your mind that person will die within 60 seconds. Doubting it's a prank, Light tests it",
    "\n                OK, so I'll try make this short as I realise reading a lengthy review can be quite tedious when you'd much rather be spending the time watching anime :)\n\r\nFor me, there are two words which describe this: Suspenseful and Thrilling.\n\r\nThe story begins of Yagami Light, a regular student stumbles upon a \"Death Note\" that, to keep it simple, when a name is written, that person shall die of a heart attack or a written cause chosen by the writer.\n\r\nThe story develops onwards, whereby Light elimina",
    "\n                Death Note has a very distinct storytelling style. If you love classical who-done-it movies and series you are going to love this series. The first part of the series gives you a very strategic storytelling experience. 2 people dancing around each other without knowing who the other person is.\n\r\nAfter the mid season climax the series takes a bit of a slower pace which actually strengthens the series. After this is becomes more of a puzzle with each episode bringing you more pieces as you go",
    "\n                After watching Code Geass, everyone suggested watching this, so I gave it a go, and was overall disappointed. It was a good anime, but it didn't live up to the anticipation of it. \n\r\nStory: 7\r\nFirst story arc (before the events leading up to the introduction of near) was 9/10\r\nIt was good, thrilling, interesting and all round amazing. However lost points for how many Marry Sues were in the anime. \r\nSecond (after near was introduced) was 5/10\r\nIt was ok, but WAY to predictable and I didn't e",
    "\n                I understand that Death Note has a very large following.\r\nPeople enjoy its dark and complex story line. The concept of the death note, in which people die if their names are written in it, is quite interesting. This simple concept is the fuel for a greater story that is this show.\n\r\nUnfortunately, the show crashes really hard at a certain point. \r\nIt reaches a really high point and you expect some great weaving of plots and actions taken by characters. The story then spirals down and down a",
    "\n                Light: L\r\nL: Kira\r\nBoth: I will hunt you down where ever you are hiding and I will eliminate you.\r\nLight: I am...\r\nL: I am...\r\nBoth: Justice!\n\r\nDeath Note is palpably one of the nonpareil anime of all time, proffering a acutely and riveting rigmarole diegesis emulated by scanty. I can verily say that it is one of the best anime I've ever watched. As the exordium dwindles out to a seraphic, male chorus soaring atop vivacious sight of prosaic stage of Shinigami realm, it gives me palpitation.",
    "\n                I think I am not exaggerating if I tell you that Death Note is one of the best anime series ever made. \n\r\nDeath Note is a story about a boy who finds a notebook in which he can write peoples names to make them die. Killing them has no consequences at all which makes this an interesting aspect of the story, because Light (the boy) has to figure what to do with this power. After a short while the best character in anime history is introduced. A boy named L. His character is great because he i",
    "\n                DISCLAIMER: Although this series gets a 10 from, by no means whatsoever does that mean I think that 'Death Note' is a 'Masterpiece'. I give scores via a point system, and the points ended up adding up to 10. The show definitely has it flaws, which shall be explored in this review, but they are greatly outweighed by its successes. \n\r\nI'll skip over giving 'Death Note' a summary, because the one provided by MAL is pretty much self-explanatory. The premise of the show is great, but the way the",
    "\n                Death Note is one of the best series of all time. I won't say it's absolutely the best (for example I liked Higurashi no Naku Koro ni better), but still on top.\r\nImagine chess and then add awesomness, and you'll get Death Note. This is the best way of describing it. But now I'll end glorifying this serie and try to describe why it's this good.\r\nThis anime contains of two parts, and you'll know when one ends and the other begins. I will call them halves. I liked the first half way better tha",
    "\n                Honestly the only reason I watched this was because of the fact that this show has been one of the top rated and most popular animes of all time.\n\r\nSo I watched The first few episodes like a few months ago and then I stopped because it was getting pretty boring. Then I was like damn I haven't watched it yet so I'll just finish it. So in the past few days I've been watching the show and I was like damn imagine if I watched this when I was younger that would be crazy cuz I never seen such ama",
    "\n                It was a really interesting story that always left you wanting to know more. It had good background development for the characters and you really saw what each character was like. They used cool effects and light to make it more dramatic and showed us what each person was thinking. It has loads of plot twists to keep it interesting. It was a really clever storyline and I could never guess what was going to happen next. The series became more and more detailed and added lots of cool story po",
    "\n                *SPOILERS*\n\r\nIt really does live up to the hype. Lately I've been wanting to get into some of the shows regarded as contemporary classics in anime and I picked Death Note to start off. I had seen a couple episodes over a year ago with my cousin, but I never picked it up again until now. A man, is this show a journey.\n\r\nThe show is split up into three parts in my opinion, the first being Light's initial killing spree, the second being between his memory loss and the time skip, and the third ",
    "\n                Death Note is an anime series about a young man that stumbles upon an object that gives him the limitless power to kill anyone in the world by writing down their name.\n\r\nIf you had this power, what would you do? Would you use it for good, purging humanity of the most vile, wicked creatures? Would you intend to use it for good but be blinded by the sheer power you possessed? What would happen if the wrong person acquired this power, e.g. a narcissist?\n\r\nDeath Note continually asks these ques",
    "\n                I'm writing this in 2017. Death Note is Tumblr's #18 Anime/Manga. This series aired in 2006 and 2007, so it's ten years old and still popular. Its timelessness is again proven by its spot as MAL's #1 anime series.\n\r\nI'm on the side of many others -- for me, the first third of the series is what shone. L and Light's cat-and-mouse battle was interesting, but when Light starts working with the team, it gets a bit monotonous. When Near comes into the picture, it's over for me. I understood thin",
    "\n                This is a Review out of 100. 35/100 for Story, 35/100 for Characters, 15/100 for Sound, 15/100 for Animation.\n\r\nStory - 28/35 - The story was very original, especially for a shounen series. Instead of physical fights, this show opted for mental fights, or mind games. You never really knew what would happen next, and while the show followed a cat vs mouse flow, you never knew who was gonna be the cat and who was gonna be the mouse. The show also brought up the question of what you would do i",
    "\n                \"I have two rules. First: I am never wrong. Second: If I am wrong, then back to the first rule.\" -L\n\r\nAll right. So here it is. My second, sometimes first favorite anime, for very good reasons. Let's delve into those reasons, shall we?\n\r\nFirst thing I have to say is, that there is a reason why a lot of people call it the best. And that's because in my opinion, it really is. It's really deep, and the show focuses on mind game after mind game. If this show were a game of chess, it would be on",
    "\n                Death Note was the first anime I ever watched. I can't quite remember how I found out about it as it has been quite a few years, but this show changed my outlook on a lot of things, both when it comes to critically analysing art (video games, anime, film, etc) and even my general outlook on life. Death Note's story revolves around two characters, Light and L. Throughout the series, Light and L are in a prolonged game of cat and mouse, trying to outsmart one another with mind games. The seri",
    "\n                Death Note is definitely in my list of all time favorite anime, along with the likes of FMA. It is an anime which definitely has the power to keep you engaged throughout the course of 37 episodes and I would definitely recommend it for someone who is looking to watch an anime which is both serious and wonderful.\n\r\nThe story, as most of the people will agree is quite unique. The concept of a notebook which can cause the death of a person by simply writing the name of him/her is new and the s",
    "\n                - English Review (Translated version)\n\r\nAt this point nothing new can be said about \"Death Note\". It is one of the best rated anime in the world and probably the best known of all (not in vain is number 1 in the ranking of popularity of MAL), except perhaps some more classic shonen like \"Dragon Ball\" or \"One Piece\". With these credentials it is impossible to discover something, although at least I want to offer my point of view: \"Death Note\" is a great work, but I also believe that within i",
    "\n                Hadn't watched an anime in a loooong time and thought why not give it a shot, it could be worth your time. It was the beginning of a fairly okay, not great, ride in the anime series.\r\n(Disappointed with my list of animes lately, thought each would have been a 'Death Note' - quality wise).Was and still is to date the best anime I've ever watched (Haven't watched that many though lol). First episode in, and I was hooked immediately.  \n\r\n9, because it gets just slightly boring after 20 episode",
    "\n                Note:\r\nSkip ahead to the second paragraph if you aren't interested in my breakdown of why I believe my delaying this series has only made me able to appreciate it more.\n\r\nAs I have picked this title up ten years after original airing A LOT of Anime fans I know and come across over the decade have mentioned this one as a must see and I gotta say, I'm both disappointed and glad. I'll elaborate quickly. I'm disappointed because I put off watching this for so long which is probably the obvious ",
    "\n                Does criminal who comited crime should die? Is this justice?\r\nThat's the main question in this anime and I think that's what make it most interesting because whe have 2 protagonists Kira and L both of them do what they think is justice and what should be done. As you watch the anime you try to find an anwaser to this question, every one have different opinion and there is atleast 3 topics about it on most of anime forums.\n\r\nDN is first no shonen type anime that I watched and it make me love",
    "\n                A high school/college student with the power to kill anybody who wants, is a genius, and has an extreme god-complex; all the ingredients to make the most generic and awful story of all time.  Thankfully, Death Note does not fall into this unremarkable category.  Instead Death Note is one of the best anime series around; a rather dark theme is present through the entire show which is complemented by a complex and suspenseful story line.  Character development is premeditated and well conceiv",
    "\n                Never has an anime made me think and contemplate life as much as this one has. Death Note truly takes you on a journey. It speaks to you and says, \"I'm going to mess with your head so bad, that you end up overthinking, and under thinking everything I have to offer.\" If you want an anime that messes with your head, makes you think things through, the Death Note is for you. You know its funny. I see my little brother watch mindless shows on TV day in and day out, they have nothing. They're so",
    "\n                Never, in my whole life have i watched a better show than Death Note. It's the only show i rated with the most 10's in it. \n\r\nStory - 10/10 (A+)\r\nAt first you might think &quot;Oh woop-dee-doo. A notebook. How uninteresting.&quot; Hush, or else your name will be written. lol. Jokes aside, the originality of it all is so amazing. The only thing that isn't original is the whole Shinigami deal, but that's not a big deal. Every episode feels like 10, it's just so long and full of suspense aroun",
    "\n                *PHILOSOPHICAL BREAKDOWN*\n\r\nThis anime was masterclass. So many tense moments and twists and turns which just made it absolutely phenomenal. The 'death note' was a really clever idea by the author, which plays on our morals on what we would do if we had the the death note. Would we use it for good? Or use it to get revenge on those that hurt us? Or Perhaps become the most powerful being.\n\r\nI personally feel that the idea of being Kira explores ideas of the author who may be trying to say hu",
    "\n                Death Note was the first anime I truly enjoyed in a long while. It's overall compelling story, well-written characters, and the ideals that it tackles all contributed to my amusement.\n\r\nThe show started off at a running pace, but began to loose steam by the middle of the series. The middle story arcs seemed to drag on for too long. And the ending episodes, no doubt the best part of the series, seemed somewhat rushed. The characters introduced should have had more time to be developed, thoug",
    "\n                (As it will be with all my reviews, TL;DR version at the bottom)\n\r\nWhat would happen if by sheer coincidence you were at school on a break and you found a notebook that says \"the person whose name is written in this notebook will die\"? How will you react to it? Furthermore, if this is real and not a gimmick, what would you do with such power?\n\r\nDeath Note starts with last year at highschool student Light Yagami in this particular scenario, he finds the Death Note and doesn't trust so much t",
    "\n                As of writing this review, I have seen Death Note, from beginning to end, about four times (though I have watched specific moments, like the potato chip scene, countless times): this is more times than I have watched any other anime.  If I were to have written this review immediately after the first time I saw it, I probably would have scored it ten, but after seeing it over and over, and being welcomed to other anime (like Monster and Cowboy Bebop), my feelings have sobered up. This (minus",
    "\n                This was one of the first anime series I saw that made me really appreciate the medium as an art form. I thought this would be over-hyped but it more than meets my expectations. I could not give it a perfect 10 for reasons stated below. I have seen hundreds of anime series and this series always seems to stay relevant in my mind when I weight which anime series are top-tier and which ones are completely passable. If you are super-picky about stuff like me, you deserve to at least check out ",
    "\n                Here I am, once again reviewing anime, but this time it’s a full 37 episode series. Which further proves that I have no life. That’s 15.5 hours of pure Light and darkness, see what I did there? Anyway, here’s my view on the beloved anime series Death Note.\n\r\nI have been wanting to watch Death Note for a while now and I finally had the chance to do so, thanks to my favourite streaming service which isn’t illegal, Netflix. At first the first episode put me off of the series slightly so I left",
    "\n                Power can either be a blessing or a tool, and can be manipulated to fulfill either our desires or our responsibilities. Now, what happens when you give a bored teenager the power to kill anyone as long as they know their name and face? You get a fucking sociopath/psychopath protagonist to one of the most suspenseful, entertaining anime that ever existed. This show is outstanding, and there really isn't anything that is quite as suspenseful or detailed.\n\r\nOur story starts off with a bored te",
    "\n                As most of you know, Death Note is one of the most famous anime show around there.\r\nThe story revolves around a boy who finds a notebook which has the power to cause the death of any people, as long its name is written on a page, and the user knows his face.\r\nThis boy, having a megalomaniac sense of himself, thinks he has the right to be a judge, and kill any person he may see as deviant.\r\nThe most interesting thing about this show is how he actually presentes two possible visions of justic",
    "\n                “In the end, there’s no greater motivation that revenge.” - Mello \n\r\nDeath Note honestly deserves all the praise it gets; it’s an amazing nuance story that’s engaging from start to finish.\n\r\n A wicked endearing journey from the Kanto region where Light is faced against psychological battles with people who want to defy god. \n\r\nWhat I mostly love about Death Note is the psychological mind games; Tsugumi Ohba is able to craft a beautifully masterful story that calling it nothing less than a m",
    "\n                As one of the most recognized anime of all time, Death Note is in my opinion one of the most agreeable anime ever.\n\r\nThe basic plot is as follows:\r\nLight Yagami, an academically outstanding High School student, is bored with life and finds faults in society while going about his daily life. By chance, he discovers a notebook that was dropped in the schoolyard titled Death Note. According to the included instructions inside the notebook, the notebook gives those who use it the power to kill ",
    "\n                I have ALWAYS loved Death Note. I discovered it around 4 years ago whe I was a weaboo and couldn't stop watching it. And even today I rewatch the whole thing when I'm bored. \r\nIt would have gotten a 10, if not for the second half of the overall story. The moment Near and Mellow enter the show, it goes to shit. It feels weird to have them, doing their thing and the ending has ruined my love for the overall series. So now, when I rewatch it, I watch it up till the point where they enter the s",
    "\n                Created in 2004 by writer Tsugumi Ohba and illustrator Takeshi Obata, Death Note originated as a manga that received critical acclaim a month after its release. The anime, released in 2006, was given great praise immediately after it‘s TV distribution. Having heard of its fan base and popularity, I decided to purchase a few volumes of the manga and rent a few episodes of the anime, careful to not have big expectations.\n\r\nWhat I got was simply a riveting masterpiece that I have no shame in c",
    "\n                To start it off, this will be my first review; so I'm sorry if it's not helpful to some ^^;\r\nOkay, anyways, before I started watching the anime series, I actually watched the movie of Death Note first since my older brother recommended it to me. And I fell in love with it! It was such an amazing movie. And because of that, I decided to watch the anime series.\r\nThe anime is mainly about mystery; so if you're into mystery a lot, I recommend you to watch this anime. And even if you're not, you",
    "\n                When mortals gain the ability to determine the deaths of their neighbors, they start to believe themselves to be God. Death Note is without a doubt, one of the best anime of all time where a game of wits plays out between a young man with a God complex and an eccentric investigator who is obsessed with solving the case.\n\r\nIt all starts when a notebook falls from the sky and a young man named Yagami Light picks it up, he later finds out that it is called the Death Note and that if someone wr",
    "\n                The greatness of this anime can be found in many ways of viewing. Death note is one of these anime shows which aren't limited to the borders of one particular genre. And this is that magical place in art life where we can find real and persistent enjoyment. Innovative, wonderfully passionate characters, smart plot, thrilling sometimes pretty depressive atmosphere, astonishing soundtrack etc..\n\r\nEven the last thing that I've mentioned can be interpreted as medium between high inteligence of ",
    "\n                death note is my favorite anime of all time. and to some that may seem like a stretch, but it shows us the vulnerability of humanity and our psyche in and of itself. it's one of those anime where it makes you /think/ and honestly just really messes with your head. \n\r\ndeath note tells the story of a young man who looked at the world, saw its many flaws, and said, \"i'm gonna change it with this convenient thing that i found called the death note,\" and light yagami is the perfect example of a ",
    "\n                -Story (10/10)\n\r\nThe story goes about a high-school genius student, Yagami Light that finds a mysterious notebook on the ground. He later finds out the notebook has an ability to kill people simply by writing their names and while doing so, thinking of that persons face. Not long, the police finds out that random criminals are dying by heartattack and they conclude it's a homocide. It is all basically the cat and mouse chase throughout the whole anime between the genius detective known as L",
    "\n                Hello friends. As you will see from my profile, I have just recently joined this community and this is the 1st Anime I have ever seen (other than the obvious mainstream Pokemon/Yu Gi Oh! ones)\n\r\nIt's hard for me to rate Death Note as I really have nothing to compare it to yet, but for now I will set it as an 8. \n\r\nSome areas where it fell down for me?\n\r\nI didn't particularly like the way it ended\n\r\nAlso my rating was at 9 right up to \"Renewal\", After that I feel things started to get a bit ",
    "\n                Out of 100 Nobles watching…\r\n84 were impressed!\r\n10 thought the story stagnated in the last third\r\n6 though conflict peaked around episode 7\n\r\nI finally watched Death Note. Probably one of the most influential anime of my generation Death Note is the perfect anime for an edgy high schooler so I probably should have watched it 14 years ago when I *was* an edgy high schooler. I’m not going to do a big long write up picking apart Death Note. It’s a good show and just about everyone should watc",
    "\n                Light in all his vainglory was rendered helpless in his moment of reckoning. That is the remainder of the Death Note manga (post-chapter 58) in a nutshell... Oh shit, where to begin. Death Note anime episodes 1-25 is gold and Death Note anime's second half \"Season 2\" (post-chapter 58 in the manga) is a trip into the abyss of cringeville. The manga told an interesting tale of a dance of wit and psychological chess between four intellectuals: Kira, L, and L's successors. I skipped the anime's",
    "\n                If you're planning on watching Death note, but you're not sure?? Just watch it!! It's a must for all anime fans! This was my first anime ever and it's now the reason why I fell in love with anime!! After completing 200 different anime, this one is still my favorite. \r\nThe story is just completely different. This is more a battle of geniuses and that's what makes it interesting, complicated plot twists! And the psychological part in the series is outstanding! I really loved this series, alth",
    "\n                Death Note is an ever masterpiece, and this title won't easily fleet. \n\r\nIn oversimplification, this anime is about a mouse and a cat cyclically chasing and trapping in each other's baits-- but it's deadly, genius, and nerve-wracking. I can still remember my first time watching this and I really had to give myself a breather for each passing episodes because I am so into the dangerous chasing game of Light and L. \n\r\nThe wig-snatching moments often occur when it involves even the smallest th",
    "\n                dont have intention of stealing others work, but this anime is one of the best, no doubt about it ^.^\n\r\nthe reason i watched this anime is because it got me favourite voice actor, Miyano, Mamoru, from Ouran to Eureka Seven to Death Note. and i have to say he is a very talented voice actor as well :=)\n\r\ni actually pretty surprise how the story goes, because most of the story within anime is pretty straight forward and kinda easy to understand, but with Death Note, one must stay ahead of the ",
    "\n                death not is a great anime that i would reccomend to everyone it may not be as long as bleach or other animes like it but death notes does a fantastic job of getting in a plot that is unmatched to nearly any others. \n\r\nit starts out as light (the main character) trys to find meaning to his life when he stumbles across a note book that can kill people. finding this hard to belive he tests it to find out its the real thing. he starts out with good morals but becomes power hungry and starts be",
    "\n                Story: Yagami Light finds a death note (which looks like a note book) lying on the ground and he picks up and discovers the truth of the death note.When u write a persons name in it they will die in 40 secs of a heart attack if their death is not written in detail. Light is a genius and his plans and plots to &quot;eliminate&quot; evil are just perfect..the way he plans on how to use the note book even when &quot;L&quot; who is this detective person(and is also a genius) is on his back susp",
    "\n                OK there are so many reviews for this series its insane but just in case someone out there somewhere thinking the same thing i was then hopefully this helps\r\nfirst off i was interested in watching this series but then it just became so popular i was going to wait until the hype had died down a bit, but a friend got the series on DVD and i borrowed it....\n\r\nStory...\r\ni do not understand how someone came up with this story its a good one and isn't a subject that's all to popular and over done",
    "\n                This show isn't like normal anime. Usually, they start off slow then, after a couple episodes, you can get into it. With Death Note, it gets interesting from the first episode.\n\r\nStory~\r\nIt starts off with a Death God named Ryuk dropping his notebook into the human world. Naturally, he has to go down there to get it but soon, he finds out, it has already been taken. A 17 year old highschool genius named Light finds it outside of his school. Written on the front are the words Death Note. App",
    "\n                When I started watching this anime, it was all because I've heard about from all my anime-fanatic friends. I thought it'd be good, and I had high expectations for this anime. Once I started watching it, I couldn't get enough. Light Yagami is one of the most distinguished, unique anime character I've ever met. With a desire to bring justice to the world, and at the same time does something illegal -- mass murder -- to try to cleanse the world of its evil. \r\nAfter watching this anime, I'm sur",
    "\n                Death Note is the perfect thriller.  A game of cat-and-mouse between the two most intelligent main characters, it's so suspense-packed that you have to watch the next episode even if you are dying you will watch and forget about going to the hospital, the story is very well though out unlike many other anime, Death Note has a way of keeping ahead of the viewer, and one can never predict what is about to happen. \r\nAs you continue watching it you realize how much more there is to the story th",
    "\n                This is the single greatest show I've ever watched. This is the first Anime I've ever watched, so I don't really know much about it, but after this, I'm definitely going to seek out more. Death Note is  A Dark thriller type of show, similar to something like C.S.I (But 100 times better). It keeps you on the edge of your seat the whole time, wondering what will happen next. They do A fantastic job of painting a picture of what the characters personalities are, and you really start to root fo",
    "\n                This is the anime everyone told me to watch. After growing up watching the likes of Yu-Gi-Oh, Bakugan, Beyblade, Pokemon, and Avatar the Last Airbender (if you count that one), I kind of stopped watching anime. Only recently did I start getting back into it. One Punch Man was the first series that got me hooked. This one, however, really did it for me. This is what I wanted anime to be. I was constantly entertained while watching this show. Sure, the second arc wasn't as good as the first, ",
    "\n                What can I say about Death Note that hasn’t been said before? It is truly one of the most interesting, suspenseful, exciting animes I have ever seen. \n\r\nMost people would say that they lost interest after the second arc. At first upon watching it was quite displeased with the second arc, but in time I grew to love it. In my eyes it took a risk and completely changed the game, it was as if they pulled the rug from underneath you. Then I understood the brilliance of Death Note. \n\r\nThe charact",
    "\n                [Edited for spoilers] Original Review can be found on Animenfo.com -via Kyzoryn\n\r\nDeath Note is a variance of Code Geass. With that being said, Death Note depicts a story without fighting, blood-shed and physical super powers that many anime are built upon; instead it focuses upon the psychological aspects through a battle of two geniuses, Light Yagami the protagonist and L the antagonist.\n\r\nThe beauty of the storyline is not the good vs. bad (which is actually a grey area) is the fork betw",
    "\n                had this retained the cat/mouse tension and had more of the intense / brilliant gambits this would be a no brainer 9+, but unfortunately this series dies with the main antagonist. it's unfortunate the illusion of the protagonists and antagonists intelligence / wit falls apart with critical errors in logic (made later on) that are seemingly made for no other reason but to help the series meet its anticlimactic and overdue demise. it's a shame, this was gripping early on. i can't help but fee",
    "\n                Undoubtedly one of the most famous and iconic anime of all time. Death Note is an anime that really forces you to question your own morality and views of the two main characters Light and L, who represent two opposite sides of the moral spectrum. Light believes that the ends of creating a perfect world justify the means of slaughtering potentially millions of evildoers among the human race, while L believes that the means are so sickeningly nihilistic that there cannot possibly be any good ",
    "\n                I have to admit, in a good way, that it wasn't what I was expecting. Death Note has a pretty big score on MAL, it's also palced no.1 on Most Popular Anime and I kind of can understand why it is\n\r\nStory:\r\nIn my opinion it has a great foundation for a great story although it became a bit predictable what would happen in the end when it started getting closer to it. I did get a bit disappointed because I think it started with a great energy and a great intensity, specially for this theme, but ",
    "\n                After 10 years of people recommending me this anime, I've watched it all in less than 48 hours.\r\n(May contain spoilers, read at own risk)\n\r\nI'd describe Death Note as a satisfying thing to watch if you're able to disconnect the rational part of your brain that is telling you that what you're watching is cheesy and just straight up a bit lame at times, especially the last part of the show.\r\nDon't get me wrong, I enjoyed it a lot, I even cried a few tears when Aizawa appears out of nowhere wi",
    "\n                Having finished watching it - I have to admit that this was completely amazing. Just a couple things to complain about (I mean, there's gotta be something right..?)\n\r\n*SPOILERS AHEAD*\n\r\n1) Misa-Misa: Just the way she pines after Light really pisses me off and how naive and stupid she can really be. ESPECIALLY WHEN SHE BECAME THE SECOND KIRA - THE WAY SHE HANDLED IT WAS SO RIDICULOUSLY TERRIBLE.\r\n2) Mello and Near: These characters honestly were nothing compared to L. They felt like amateurs",
    "\n                Although i can't Rank every single thing with a 10/10 i'll feel like it is my obligation to give a 10/10 in the Overall , i will explain why. Ok so , Death Note is one of those animes you quickly fall in love with without even expecting , at first as you read the sypnosis you might think that the anime itself is pretty boring as it has no action , like \" ok there's a guy that kills with his note book , boringgg \" but you could not be more wrong if you think that way.  Death Note is a really",
    "\n                This was quite a unique anime. The first I've seen that has and actually keeps a very dark theme throughout the whole story. I won't go into very much detail here but overall, Death Note was a cinematic page turner. I really enjoyed the multitudes of cliffhangers and plot twists which kept me interested and always on the edge of my seat. I would definitely recommend this anime to anyone and everyone who has not seen Death Note. Although this was an amazing anime, I would have to say that I ",
    "\n                At least the first season I enjoyed it a lot; and, although I do not identify with any of the characters, they are all very well done. However, and I will try not to spoil it too much, I felt that as the plot progressed, that tone of \"realistic\" in the actions of the characters was disappearing. \n\r\nThe first season could get a 9/10, since the \"game\" between Light and L. is very interesting and entertaining. \n\r\nBut the second season I would put a 5/10; Not because I didn't like the ending at",
    "\n                “Power tends to corrupt. Absolute power corrupts absolutely.”\n\r\n  Even a brief flirtation with power can radically transform a benevolent and selfless individual into a presumptuous egoist. Such tragedy is the very essence of the anime series “Death Note” which devastatingly depicts the malformation of protagonist Light Yagami from a dignified idealist into a haughty murderer. The moral ambiguity of the story encourages the viewer to critique their own ideals of what constitutes good and ev",
    "\n                TL;DR Death note is my favorite anime I ever watched for very good reason there is very few filler everything feels like it progress the story in some way whether its progressing Light and L's battle or having funny dialogue from Ruyk and the rest of the supporting cast. \n\r\nStory\n\r\nThe story is about a shinigami dropping a book that can kill anyone with just knowing a name or face. Light the main character picks it up and tries to kill all criminals to make a new world and become a god of i",
    "\n                (Spoilers incoming)\n\r\nStory: 10/10. The interplay between Light and L's manipulation games, as well as the suspense that builds in not knowing who'll emerge victorious, will have you on the edge of your seat for the first 25 episodes. The show starts to drag after Episode 25 into the 30s, and unfortunately the introduction of Near and Mello as Light's adversaries marks a drop in the show's quality. This doesn't affect the story and overall narrative that much, but whereas L relied on actual",
    "\n                Before I begin my review, I'll tell you a funny story on how I got into this show and started getting more into Anime. I follow one of my favorite YouTubers named \"Vannamelon\" (vannananabanana on MyAnimeList) on Twitter, and I knew she loved anime, so I asked for a recommendation, and she said her favorite was \"Death Note\", so I ended up buying the complete series on Blu Ray and once I put the first disc in, I was hooked. Too hooked; like I want to buy the manga, live action films, director",
    "\n                [STORY: 10/10]\r\nDeath Note is one of the most captivating stories to ever be told through Japanese animation. The two protagonists go head to head throughout this series in order to save the world from the other, believing in their own way and sense of justice. These two are such a challenge for one another that it becomes one of the most suspenseful rivalries between two characters that I've witnessed to date. Truly a masterpiece in how the story is presented and ends.\n\r\n[ART: 9/10]\r\nThe s",
    "\n                Death note is one of the best animated series and series in general.It's a masterpiece and a fantastic experience.\n\r\nStory 10/10\r\nA notebook drops in front of a very intelligent high school student named Yagami Light. He can write anyone's name and that person shall die. A Shinigami (God of Death) is responsible for a notebook and for Light's notebook that Shinigami is Ryuk a funny and goofy character. Light chooses to kill every criminal in the world so a better world would be created and ",
    "\n                Pros:\r\n-Cerebral story written towards a more intelligent audience \r\n-The concept of \"the bad guy\" being the main character\r\n-making the viewer root for \"the bad guy\"\r\n-many twists that are fairly hard to predict\r\n-each episode ties in beautifully into the next\r\n-Light is one of the best characters in anime\r\n-'L' is an equal opponent to Light\n\r\nCons:\n\n\n-The pacing of the 3/4 mark of the series isn't as good\r\n-'N' is not nearly as good an antagonist as 'L' was\n\r\nMY Overall Score: 9.4",
    "\n                Only a month ago I had finished watching DeathNote and I can tell you that I feel that it is one of the best shows that I've seen to date. DeathNote left me at the edge of my seat in suspense and with an unquenchable thirst for more. I seriously recommend this, for anyone who is interested in the fantasy/mystery genre to watch. \n\r\nStory: The anime begins with a normal college student stumbling upon a notebook that has the power to kill anyone whose name is written in it, given that you have",
    "\n                Death Note tells the story of Light (Raito) Yagami, a seventeen-year-old genius whose life drastically changes when he chances upon the Death Note. The black notebook, despite its unassuming appearance, has the deadly ability to kill, requiring only a name and a face. Dropped in the human world by the bored death god (shinigami) called Ryuk, the Death Note proves itself a most destructive weapon when Light decides to use it to kill criminals, intending for himself to be the god of the new w",
    "\n                Story Summary:\n\r\nThe story in death note revolves around Light Yagami, and outsanding student (smartest of Japan) who is pretty bored by school. A Shinigami (God of Death) named Ryuk drops his Death Note in to the earth world. The Death Note is a notebook in which you can write names to kill people in whichever way you like. Light finds the book and tries to use it to kill every criminal in the world to make the world a better place. Soon, the best detective in the world mysteriously named ",
    "\n                First season was great, no questions. Reliable 8/10. \r\nIn some moments anime should've be more daring, deep and tough, but considering the plot main motion (confrontation of 2 minds), it was amazing recreational performance and the most realistic anime I've ever seen so far. Ending of the first season could've been a perfect finish for this story, but creators decided to extend the show, and it was a terrible nightmare. \n\r\nSecond season is a disgusting abomination. 0/10.\r\nTottally ruined in",
    "\n                While I was watching Death Note, there were many questions which kept popping up in my head, with the main one being, of course — \"why did it take me so long to get to this show?\"\n\r\nSince it first came out 10 years ago, I have not only heard about this anime and its concept (as well as its huge fan base), but have also constantly stumbled upon drawings, pictures, merchandise and many other things depicting L, Misa, and Light Yagami as well as the Death Note itself. Even though that should c",
    "\n                *to those people who are only looking for a quick summary, skip to the end*\n\r\nIf you happen to get a power that allows you to kill anyone, regardless of who they are, for as long as you know their name and face, what would you do? Most people would probably use it for their own selfish desires, like to kill that noisy neighbor who doesn’t know where his own lawn ends, or that slave driver of a boss that just piles up more and more paperwork on your desk, or maybe even that fat bastard who w",
    "\n                death note was one of the few series that has changed the world, It was a phenomenon in Japan, today it is considered a cult series.\n\r\nUnder the premise that the best student in Japan gets a book with the power to kill anyone just by writing their name on it. Oh my God!!! that was the most original thing in the world, this anime leaves many thoughtful questions, Is it possible to eliminate all the evil in the world? The end justifies the means? Authoritarian justice for a common good? a pun",
    "\n                Even if you're not a huge anime fan, Death Note is worth watching. There is a very good chance you'd enjoy it. My dad, who is mostly indifferent to anime including Ghibli, fell in love with Death Note. Death Note is a suspenseful thriller, where the protagonist, Light Yagami, may not be such a hero, but it's hard not to root for him. Makes you think deeply about the meaning of morality, while simultaneously keeping you at the edge of your seat. It's a battle of wits, great dialogue, and max",
    "\n                \"Death Note\" is a captivating and intelligent anime that explores themes such as power, justice, and morality in a thought-provoking manner. The series keeps you on the edge of your seat from beginning to end, offering a complex story and memorable characters.\n\r\nThe story revolves around Light Yagami, a highly intelligent and ambitious student whose life takes a drastic turn when he finds a Death Note, a mysterious notebook that grants him the power to kill people by simply writing their na",
    "\n                Light Yagami is like any regular teenage student. He goes to school, and goes home afterwards. But he realizes the wrong in the world today. Murders, robbery, ect. But what he wasn't expecting was to find a book that could possibly change everything. Light notices directions on the inside of the book that states that by just thinking of someone and writing their name on one of the pages could kill them within seconds. Light decides he is going to try to change the world and starts targeting",
    "\n                I started out with the Death Note manga, and at first I will admit, I wasn't really sure if it was any good. I thought since it belonged to Shonen Jump, that it was going to be one of those regular main-stream animes like Naruto, Bleach and One Piece. I was very wrong. It starts out very good. The shinigami realm in the beginning may freak out some people, but you have to stick around. It starts you off with you know what is going to happen, yet you don't at the same time. Light Yagami (Mai",
    "\n                Although it’s been said many times, this is ONE OF THE BEST ANIME. \n\r\nThere’s a long review coming…………\n\r\nAbout the STORY\r\nThe story is so rich. Every episode you get so excited, you can’t help but watch it again. It is also very much original and at the same time very risky. I mean to make the protagonist to be so irritating, that is very risky but I find it so courageous. But setting aside how exciting the story is, I absolutely believe that the strongest edge of this series is the lessons",
    "\n                This anime is focused mainly on the fight between \"L\"and Light light is the MC he acquired a death note which a shinigami dropped in the human world a shinigami is a god of death by the way. And when Light figures out how to use it he realizes the power he has in his hand which is if he wrote a name in the death note the human will die in 40 seconds of either a heart attack or a cause he wrote. And humanity realizes that someone is behind this and so they start calling him KIRA which is a g",
    "\n                Probbably the best anime I ever watched.\n\r\nJust wow.\n\r\nStory:Outstanding\n\r\nSpoilers ahead:Light Yagami is a genius high school student who discovers the \"Death Note\", a notebook that kills anyone whose name is written in it, as long as the writer has seen that person's face. After experimenting with the notebook, Light meets the Shinigami Ryuk, the notebook's original owner, who dropped the notebook to the human world out of boredom. Light tells Ryuk of his plan to rule as a god over a new ",
    "\n                =====Introduction=====\r\nMany people I know started their anime experience with Death Note as it works as a decent medium if you've watched several western thrillers since it appeals to the western audience. I hadn't watched Death Note for a long time in the assumption that it's one of those run-of-the-mill mainstream anime that I tend to avoid. If you're interested in a review of the series as to how it compares to modern anime, this might offer that perspective. Death Note has a slight tou",
    "\n                Death Note is one of those anime that almost everyone knows about and for good reason the show has some of the most well written characters and an even more well written story.\r\nThe story revolves around the concepts \"is it okay to kill someone evil\" and \"should anyone hold the power to end someone's life on a whim\". The story starts off with Ryuk a Shinigami Death God and Light Yagami, they are both bored in their world so Ryuk decides to drop the Deathnote (a notebook with the power to ki",
    "\n                What would you do if you had the power over life?\n\r\nDeath Note explains this very concept and presents it in a very interesting way. The main character, Light Yagami, discovers a notebook (the death note) on the ground at his school and learns of its use. Being a young man who believes that evil men should be punished, Light attempts to use the power of the Death Note to mold the world into one that is crime-free. However, the police are working to catch him (dubbed 'The Kira Killer'), the ",
    "\n                If you love mind games, high stakes, and just a dash of murder, Death Note is the anime for you! It's like a chess match, but instead of pieces, the players are using the lives of unsuspecting victims. It's like Clue, but instead of a candlestick, the weapon is a magical notebook. And it's like Dexter, but instead of being a serial killer with a code, the main character is a serial killer with an ego.\n\r\nThe series follows the brilliant and cocky Light Yagami as he discovers a supernatural n",
    "\n                Death Note\n\r\nI remember watching these anime for a long time ago. But I recently rewatched it.\n\r\nFrom all the animes I have ever watched, Death Note justs top them all. I believe we all have once looked out of a window hoping something would happen. At first glance, I wasn't entirely sure how the creator of the manga would make a story of a person who can kill anyone he writes down and thinks of. But the creator truly surprised me. The intros are just truly art. I love how the creator gets ",
    "\n                very good and intense but I really do thing that it does start to drag its feet near the end, but maybe it's due to me being a bit too impatient and just wanting it to end already nearing the end or it could be that I did already know how it ended because I was spoiled.\r\nAlthough I didn't have the best time with it, it was amazing at the start and would've gave it a 9/10 if it kept it up but for now it's a 7/10 but i really do recommend it to everyone who hasn't seen it and likes and/or doe",
    "\n                *SPOILERS AHEAD* and I’m gonna focus on the characters on this review\n\r\nI’m quite new to the anime medium as a whole but I can say without a doubt that Light is probably the most sinister character I’ve ever seen so far. In the first half of the story It casually starts off with him picking up a notebook that grants the power of killing anyone who’s name is written on it. Light doubted it at first until he tested it out for the first time and from that moment on he goes on a nonstop killing",
    "\n                This Anime is amazing! I recommend it to any anime fan out there, even newer ones. 10/10\n\r\nThe story follows a character named Light Yagami, who discovers this book called a Death Note. Who ever's name is written in the notebook they'll die in 40 seconds. Light thinks its fake so he tests it out on a random criminal he saw on the news channel. The book actually works and the criminal dies from a heart attack. \n\r\nSurprised, Light decides to use the death note to kill off criminals. Until, th",
    "\n                SPOILERS AHEAD\r\nThis show is the epitome of depressing endings. I knew Light was eventually going to die but it was still kinda sad and how Ryuk was the one to finish it was kinda worse. L’s death was also sad, and he never found out what happened to his friend Naomi Misora. My favorite is Misa, I just love her personality and she’s such a comic relief. I also liked Matsuda a bit, at first he seems like some stupid adult who acts like a teenager, but in the end he had the guts to shoot Ligh",
    "\n                One of the best shows I've ever seen. From the first episode I was completely captivated. No other show has been able to be so fast paced, yet mysterious, so dramatic, yet serious, so simple, yet so mind blowing. The cliffhangers on every episode sucked me in, I couldn't stop watching. Not to mention, every minute I watched, was a minute of genuine enjoyment.\n\r\nStory 10/10: Twists and turns everywhere, I was mindblown at how Light outsmarted L, and how L set up the genius traps to find Kira",
    "\n                I really enjoyed Death Note. The moral question of killing bad people is a well known dilemma, but Death Note presents it in a unique way. The system of Shinigami and death notes is an original and exciting idea that is thoroughly explored. Although some of the later rules were contrived and obscure, it was exciting that we got to see many different facets of death note use by many different users in such a short span of time.\r\nThe suspense element of Death Note left me on the edge many tim",
    "\n                This is a super short review. No Spoilers.\n\r\nIn its genre, Death Note is Perfect.\n\r\nDeath Note managed to hold my attention. It lost my attention for a total of 3-4 mins, and that says a lot. I believe what makes Death Note a special story is its straightforwardness with things. The confrontations, the mind games were so straightforward. Every and each episode, this anime held nothing back from its audience. What more, the story introduced us to unique and lovable (some hateful) characters,",
    "\n                Hands down, what of the best shows out there right know.\n\r\n   The story revolves around a teenager in his last year of high school. He is one of the top people in is school in academics. One day while looking out the window he sees a strange notebook just fall from the sky. Intrigued, he waits till after class to investigate the notebook. When he picks it up he reads the words written on it, \"DEATH NOTE\". At first glance he just thinks it's a joke but still intrigued, he decides to take it ",
    "\n                My thoughts:\n\r\n- The anime's story premise is easily the best part. Development at the start is good. A title like 'Death Note' speaks for itself in this regard. \r\n- That being said, the resolution of story was easily the worst part since it was always a matter of \"does the character have a trick up his sleeve this time\" etc. Not very much surprise for me.\r\n- Seeing how it is a crime-mystery, a lot of supporting information is told to you after the scene. Tension shown through time not thro",
    "\n                Death Note, being my first anime ever, has probably become one of the most unique anime I've ever seen. Now that I think about it, I honestly can't think of another anime that has been written similarly to Death Note. (I've seen around 50 different anime series by the time I have written this review) \n\r\nStory: Death Note's story in the first arc is absolutely phenomenal with its highly driven suspense and thought-provoking circumstances. Each and every episode from 1 to 15 serves a huge pur",
    "\n                Be warned, watching this show will turn you into a weeb.\n\r\nStory: 8\r\nit is a good anime with a well written story; it is dark and psychologically thrilling keeping you on the edge of your seat for the most part through.\n\r\nArt: 6\r\nThe art is old, but hasn't aged to badly and can only be described as fair for its age. \n\r\nSound: 7\r\nThe sound is good, but it feels like more could have been done soundwise to enhance the experience,\n\n\n\r\nCharacters: 7\r\nThe characters are deep and well written on a",
    "\n                This was the first anime I watched, so the score may be a bit biased. I see a lot of people rating it a 8-9 but for me it's definitely one of, if not, my favorite anime. If you don't know what it is about, it's about the world's smartest student who gets his hands on a notebook that kills people if you write their names. To which, he uses to kill criminals and rid the world of evil. But of course, what HE is doing is evil. So, the world's greatest detective (L) tries to find how all of thes",
    "\n                Story: The story was simply amazing.... For the first part of Death Note that is. Death Note was on top of the heavens, being classified as a perfect anime and Yet Part two of the anime is where things became horrid. The story is about Light Yagami a high school student finding a notebook that fell from the sky called the Death Note ( Yeah I wish money fell out of the sky then I’d be happy too hahaha ) Once he fins the Death Note he decides to use the power to punish those that have been fo",
    "\n                Death Note is one of those anime's that after episode 1, its really boring but it moves on fairly quick to your excitement that I have to say from what I've seen, Death Note goes above and beyond your typical run-of-the-mill action based anime. \n\r\nWhere in other anime's, it relies on action packed battles and fights, Death Note has that refreshing feel that changes its pace. It's sneaky, slick, clever, and witty with the eccentric \"L\" who leads the investigation against the protagonist. Its",
    "\n                Death Note Review\n\r\nThe Death Note anime, directed by Tetsurō Araki and animated by Madhouse, began airing in Japan on October 3, 2006, and finished its run on June 26, 2007, totaling 37 twenty-minute episodes. \n\n\r\nSTORY\r\nEssentially at it's core, death note is a story about A genius teenager named Light Yagami , who is bored with life and one day after school, finds a book entitled 'death note' which states the person who's name is written in the book will die . Light Intrigued by this tes",
    "\n                Though I'm relatively new to anime, certainly this genre, I decided to give it a try and hell was that a great decision. This story gives you a character that you should hate, however, sympathies with because he is \"trying to do the right thing\". He has a very dodgy mentality like that of most criminals and it is scary to see how he is so capable of creating chaos by manipulation. Those who go against him you will hate at first, but then realize they are the good guys in the story.\n\r\nI mara",
    "\n                I've read all of the manga and light novels and watched all the episodes and movies and I never grow tired of it. It's definitely an original and I'm very proud to say I was living as the legend was in the process of making and that it has made a huge impact in our generation.\n\r\nDeath Note challenges the topic of \"divine judgement\" in a rather amusing way. I think the way of using the Death Note is an original. I mean, who would've thought you could kill someone just by knowing their face a",
    "\n                Death Note was the third anime I started watching after Naruto and Claymore and I enjoyed it the most by far (or am enjoying it, seen 35/37 episodes) \n\r\nWith Death Note I had to hold myself back from watching it all in one day, and decided to watch two episodes every Tuesday, sometimes 3 >.< I recommend to watch this anime over a period of time as watching it all in such a short gap with just ruin it, (you can do that with Bleach and Naruto); the anime is really THAT good, take your time ge",
    "\n                So after watching several different animes I was recommended this one.\r\nI thought it was suck but the concept was brilliant!\n\r\nStory: 8\n\r\nThe idea for the story is excellent.  Bright and shining student Light Yagime uncovers the death note in the school yard.  With this note he has the power to kill anyone by just writing their name in the book.  There are some rules and the situation gets a little hairy when the police get involved.\n\r\nArt :7\n\r\nJust your traditional anime drawing, similar t",
    "\n                To begin, this anime follows our 17 year old high school student Light, as he finds a notebook known as the death note one day during school. The story then introduces a pleasure seeking death god, who purposely dropped the notebook to see what will come of it. Light discovers that if he writes someones name in the notebook they will soon die. Thus the madness begins. This anime is brilliant, it will drag you into situations were you are forced to use your brain and will most likely fail tr",
    "\n                Death Note is one of the most powerful anime I have ever seen. The story and thought behind it are amazing at every turn. You have to keep up and pay attention, but if you do, this anime will give you immense satisfaction.\n\r\nRight up until episode 25. I have watched the entire thing, and with that in mind I can reccommend everyone to stop watching after that episode. That's where shit really goes down the drain. My score is based on the first 25 episodes. If I had to judge them all, the ove",
    "\n                Death note is probably one of the most strategic, suspense filling anime out there.  pretty much every episode is very well thought out and keeps me at the edge of my seat which i appreciate  because not many anime can keep this up through out the series.\n\r\nThe story is very unique, and the concept of it all is truly a masterpiece.  a death note owned by the shinigami's is capable of killing a person simply by writing there name . sounds scary right? this note book falls into the hands of y",
    "\n                I first watched Death Note on a whim in 2008, and it completely won me over in 2 episodes. It's such a special anime, that is cerebral and cunning. The protagonist and antagonist are just so enjoyable and interesting, its impossible to not be drawn in and watch for hours at a time. They play off each other so well, it really does warrant mention. \n\r\nOf course, the excellent story is accentuated by the slick animation, and of course the sound. The Voice Acting is among the best of the medium",
    "\n                Death Note is a pretty good show about this guy called Light Yagami. Light is a smart man. Really smart. Like a genius. He is a genius, and that is the plot of Death Note. Genius verses genius in a battle of wits. \r\n.\r\nIn his death note, Light can write down the name of anyone once he pictures their face and has their real name, and once he does that, they will die. But he has an enemy, L, who tries to stop him.\n\r\nThis is a good show, and the only thing not good about it is Near and Mello a",
    "\n                I watched this anime for a long time. I just wrote this review because a lot of recent anime made me disappointed. I think death note can be made as a reference on how to make anime with interesting stories and characters. how this character can present something that reflects in real life and imagination that is out of control. this is awesome...  This review was made to make some production houses aware of the quality and not just quantity. \r\nIn the last year, there has been much anime wi",
    "\n                This was one anime that I was heavily interested in the moment I heard of it. The whole concept sounded incredibly interesting to me. Death Note is one of the first animes ive seen and its also one of the most well known anime of all time. The manga was written by Tsunami Ohba and although it wasn't very long it was still highly successful with over 30 million copies sold. Studio Madhouse made an anime adaption of Death Note and you can almost predict that it was gonna be good at worst, wit",
    "\n                Deathnote is a masterpiece.  This story is interesting in the first episode.  It's interesting in the last episode.  It does not drop your interest.  Light Yagami is an incredible character and his journey with the other characters in this series is one to enjoy viewing.\n\r\nMadhouse delivers a classic that will last far longer than most anime in the minds of anyone who gets the fortune of enjoying this series.  \n\n\r\nPROS:\r\nStoryline 10/10 (The twists and turns.  The story is enthralling)\r\nArt",
    "\n                Death note probably , one of the most intelligent series i have seen. It has one of the dubs that i have seen ever in an anime ,the whole English voice over cast is brilliantly chosen as each an every voice fits the role perfectly ,for example  the role of ryuk which perfectly show's how ryuk doesn't give two shits about light is just there for the sheer fun of it and also is very goofy and  this is perfectly encapsulated by Brian drummond  .\n\r\nStory \r\nThis one of the most intelligent shows",
    "\n                WATCH. THIS. ANIME. I don’t care if psychological animes aren’t your thing. This is the exception. This anime is a masterpiece and I don’t use that very often. My favorite anime of all time, hands down. Of all the people I know who refused to watch this anime because of its excessive popularity, they all enjoyed it once they finally gave in and watched it. \n\r\n(spoiler free)\n\r\nStory - 10\r\nReally smart dude finds book that he can write someone’s name in to kill them....and tries to become a g",
    "\n                Death Note is one of the best stories I've ever witnessed. The introduction of the concept of Death Gods and Death Note, one of the strongest character developments in any piece of media to be found, great and perfectly suited ending and a very good visual and emotional experience.\n\r\nTo begin with, the story starts with an introduction of an educational prodigy Light Yagami, who is bored with the daily and routine life until he finds out a book lying on the ground named Death Note. The rest",
    "\n                I want to take this time to just tell any people who are NEW to watching Anime or just want to BINGE a new season / show that they have never seen. DEATH NOTE is perfect for that. The storyline of this anime is just incredible. From the beginning of the show to the very end of it. It just keeps getting better and better. \n\r\nSummary: This boy finds a book called \" Death Note \" he is very confused about it until he writes a name in it and the person... You know... Dies! There is also this cha",
    "\n                SPOILERS SPOILERS SPOILERS!!!!!!!!!!:\n\n\n\n\n\n\n\r\nI really, really enjoyed this anime...it is an extremely famous one and i can see why BUT there are a few things that i didn't like very much... Death Note's story line at first was truly amazing. I really enjoyed it and wanted to watch more and more but as the anime progressed it seemed to get more boring, yet still sort of enjoyable? It started to go down hill after Light  gave up ownership of the notebook the first time when he was in confine",
    "\n                This anime is honestly my favorite of all time and a lot of that has to do with the battle between the protagonist, Light, and the antagonist, L. Unlike other anime, where the two would battle it out in some huge epic fight scene, Death Note doesn't do that. In fact, unless you count a tennis match (which I don't), there is really only one actual fight between them. This anime is more focused on the two trying to outsmart one another and it instantly got me hooked on the show. Some people s",
    "\n                Death Note is one of those anime shows that you have to watch if you are an anime fan. It is also one of the show I would show to someone trying to break into the world of anime. It's simple but complex, dark but not so dark that you can't find characters to relate to or root for. \n\r\nThe overall story is very simple ( a boy finds a book that allows him to kill people if he writes their name in the book.) but the magic of this anime comes in the mystery and the twists and turns. You follow a",
    "\n                Death Note is at the precipice of all psychological thriller anime. It's one of the anime that could be recommended to anyone without hesitation due to it's universally applicable themes.\n\r\nStory -  Death Note follows the story of a high school genius - Light Yagami that is bored with his life and encounters a Death Note from a shinigamiwith the power to kill anyone. he starts passing judgments on criminals and soon develops a moral rival, the super detective - L. It's the perfect cat and m",
    "\n                  When I was 16 years old, I was aware to the anime ''Death Note''. I always wanted to watch it, but I didn't have a time, because of the studies.\r\nBut after I've graduated and the anime was still popular, after it was finished airing, I decided to watch it after I've finished D. Gray Man in the holidays.\r\nAnd thus, any Wednesday (Every day I am watching a different anime), I found myself as a following after Light's steps on the way to kill his victims, while he uses a powerful notebook wh",
    "\n                Own, Online Viewing, or Evade\r\nI’d say a show Definitely worth Owning.\r\nThe Blu-ray release is the best way to own this great show.\n\r\nOverall Rating 8/10\r\nA notebook falls from the sky and this if found by a bored, high school genius Light Yagami.  The rules written on the inside cover include the title of this review, \"The human whose name is written in this note shall die.\"  \n\r\nIt's a story about shinigami, death gods, and guy who believe's he's the one true judge, jury, and executioner. ",
    "\n                Death Note is an excellent series about a young adult named Yagami Light who gains possession of a Death Note- a small notebook which, if you write the name of a person who's face you know, will kill that person.\r\nThe show revolves around Light and his use of the Note. It took a very interesting social critique aspect after a while and I thoroughly enjoyed the different characters as they popped up through the 25 or so episodes. This show does a very good job of making it's characters chang",
    "\n                Death Note was an anime I originally only watched bits and pieces of on Adult Swim back when the anime was brand new in North America. I honestly had no idea what I was seeing but the clips I did see were really engaging despite knowing not too much about it. Finally, I sat down to watch Death Note in its entirety and I can fully say I am not disappointed at all. There has never been an anime I've seen with this much class, care and story put into it.  \n\r\nThe story is all about a teenager n",
    "\n                Smart, pulse-pounding and beautifully exciting and tragic series. \"Death Note\" is that enveloping mind-bending anime that excels viscerally and intellectually while telling a classic and contemporary tale illustrating the battle to attain divine power, the consequences in seeking it and how despite ones cleverness and ambition can be their own downfall as a result of their own hubris. The balance between the supernatural and real worlds was well done along with the rules in using the Death ",
    "\n                translated by app from Chinese forum\r\n1.Apples and notes\r\nApple is a clue to the link between luc and the moon.In the bible, Adam and eve were tempted by an ancient serpent from the garden of Eden to eat an apple and thus gained knowledge.In this animation, Light obtains death note from the god of death, and thus obtains the god's ability to \"punish mortals\".1) the death note is a metaphor for the contract between a human and a god of death.2) it is a metaphor for the sinful desire of human",
    "\n                Death Note, aw how to start it? This simply is the best anime. I like it a lot, it has great characters, a great story, i enjoyed watching it. And the manga is the same, but now im talking about the anime. This is THE best shonen and a great psychological horror. Light is a great character, L is the same. I didn't like Near as much as L though, i tought he was boring. I recommend everyone this anime, its a classic must-watch. AND A GREAT MEME (ill take a potato chip and eat it). I tought th",
    "\n                I found Death Note more exciting than anything else. There is no way of telling what kind of move the characters shall make next, and it's also not much of a typical anime (no funny faces, no noises, mostly straight up action or tactic). The end (I won't spoil, hold your horses) definitely isn't something you'd expect from the beginning, making it vastly different from the stereotypical anime. \n\r\nStory: Very strong, for me personally the strongest storyline of any show ever, including non-a",
    "\n                I've only recently started watching anime when I stumbled upon death note. Of course I knew about it due to its reputation and luckily it was on netflix. This just blew me away From the first scene to the last heartbreaking and depressing scene I was kept on edge and impatient to see what happens next. Generally anime, as I've seen anyway is about the maturization of a character into becoming a better self or a hero but this, this is just on a whole other level. This is a work of art almost",
    "\n                When I was looking for something to review on MAL(My Anime List), I decided to review deathnote just to spite all the people who are saying its a masterpeice and deserves to be part of everyones life. \r\nAnd sadly, I have to agree that this series is a superb example of what Anime can do.\r\nThe premise follows the two examples of Shonen by giving a young man(Light, a inteligent man mind you) A incredible power that only he possesses(The Death note, a book where if you write the name of someon",
    "\n                This is my first review. I had heard the name Death Note quite alot but until very recently ignored it. What a mistake this was from the first episode I was hooked ok it was not the best first episode out there but it left that feeling of wanting to know what happens next so I promptly put the next episode on and that was it full blown hooked. the introduction of L was pretty decent but it was not until I saw L's true identity that I fell in love with character his addiction to the sweeter ",
    "\n                I avoided this anime for several years because I was worried it would be too dark for me. However, as I got older the more I heard about how great it was, and I decided to give it a shot. \n\r\nAnd, wow, I was not disappointed.\n\r\nDeath Note is a truly interesting and engaging anime that asks some of humanity's most unanswerable questions. Who decides what is right, and how do we as human beings make that choice? What makes a person good or evil? Is there even such a thing as that kind of black",
    "\n                * This review does not include any spoilers *\n\r\nStory:\n\r\nThe story followes a college-student, Light Yagami who suddenly finds a Death Note. The Note was originally from Ryuk, a Shinigami, however, he was clumsy and the Note Book fell without him noticing.  When a full name is written in this Note Book, that person shall die. Light plans to become a God and he murders every single criminal. L, a very smart man tries to capture 'Kira' and he will have a mind-battle with Light. I was always t",
    "\n                To starting off this show is mediocre as a whole. We start with a simple but a very good idea that follows the show till the end. A notebook that kills people. The magic starts with how the characters use this piece of holy-weapon against the others, and it turns out that the author is magnificent on it. Until he decides to kill one of the greatests characters of the show, L. I don't know what he was thinking when he did this, wrote did or whatever, but a little spoiler here, Kira doesn't w",
    "\n                Hands down, the most intriguing anime to date. With a very interesting story line, and even more interesting characters, Death Note will keep you wanting more, and more as the story progresses. This show is truly a psychological/emotional roller-coaster that you will wish never ends. Every aspect of the show was executed with a soul purpose for the brilliant climax. In my opinion; very few TV shows can hold a torch to this masterpiece. The only flaw worth noting was the lack of closure towa",
    "\n                This anime is all about a notebook which fell from the sky and Light Yagami picks it up. \n\r\nThis notebook is known as \"Death Note\" for whoever's name is written on it, the person will die with sudden death. It will be ineffective on people who are 200 year above age.\n\r\nI first watched death note in the live-action movie.\n\r\nWe are introduced to Light Yagami, a brilliant genius who made good use of the death note to destroy evil. He used his name \"Kira\" to cover up his identity just like Lelo",
    "\n                For the most praised and adored anime, it really isn't anything special.\n\r\nSure it's got the story, Sure it's got plot and twist and turns...\n\r\nbut it's slow, and boring...\n\r\nThis anime put me to sleep numerous times when trying to watch it, and when I finished it, I was not amazed. It was not amazing.\n\r\nNot worthy of the praise of the most ADORED anime ever made...\n\n\n\nIt's got story, don't get me wrong... I like the shinigami Ryuk the most out of anyone but it's really not \"exciting\" It's ",
    "\n                The relationship between the individual and society in the matter of law is nothing new in food for taught. The complication has had it's existence since birth of societies themselves. And has always interested people. Big names occur in this area like Hobbes or Locke to name a few.\n\r\nA common reasoning is that people tend to favor to live in groups because it's in their advantage. Things like the law itself is absolute because humans themselves agreed to it, without it chaos would occur. A",
    "\n                Death note\r\nWell to start this off.This anime gave me such brain problems it wasn’t even funny I still get puzzled at what happened and trying to get an end picture in the end i still just don’t see it. but anyways So why did I rate this amazing/very popular anime a rating a of 8 well with this I point to the last 12 episodes.\r\nSo what happens that make this anime spiral out of control well for non-spoilers sake I’m not going to tell, however you will be able to tell when this happens. \n\r\nA",
    "\n                A very good show.It was truly made by a lot of thinking.\r\nthe first season was very good although it seemed like they were just trying to sum everything up in second season.\r\nhere is a link to my blog if you want to check it out.I wrote all about it.\r\npassionateviews.blogspot.com \r\ndeath note is very cool and if you really got into it I think you would find it very useful too.\r\nhere is something from my blog.\r\n\"Series main character is Light Yagami also known as \"KIRA\", who is hunted down b",
    "\n                Death Note follows the story of a boy who finds a book with the powers to kill anybody he chooses. The anime becomes a hunt to see who can outsmart who is this thriller detective story.\n\r\nStory: The story was very well executed, it felt real and was very captivating from the get-go.\n\r\nArt: Was very stylistic in the sense of lots of sharp edges and muddy colours, made the show very dark and sinister. I especially loved the colours of blue and red to symbolise the different sides. Whether it ",
    "\n                Watching Death Note is like witnessing two chess masters play an epic, years-long game, and being unsure of who's won until long after the game is finished. This is undoubtedly the most intelligent anime out there, and also one of the darkest.\n\r\nDeath gods have books where they record who will die, how, and when. One god loses his book, and unfortunately for him, Light Yagami picks it up. “L” is the genius who tries to figure out how people keep dropping dead.\n\r\nThis is an odd anime because",
    "\n                A popular anime, Detective, murder and psychological play. In my opinion this was a really interesting anime with many dynamics as to why. The anime starts off  quick. What i mean by that is that the story starts quickly paced and follows the distress and line of thinking of MC.\n\r\nDeath note has many concepts of demonology, emotional psychological play and pieces of \"real life\" where detectives look for a murderer. The way the notebook itself is invented was for me something i had never see",
    "\n                Spoilers included:\n\r\nDeath Note is one of the most popular anime series if not the most popular series in the world and this is what I think about it:\n\r\nThe story itself is really interesting and well constructed. We begin with a character named Light Yagami that one day finds a book on ground. He later finds out that the book belongs to a shinigami and that he can kill people with the book by just simply writing their name on it. Light wanted the peace and justice in the world and that's w",
    "\n                    I personally am very late to the Death Note \"train\". Simply because I never looked into it, but now that I have I can say I'm very impressed. \n\r\n    While I can see where people might say that L and Light are both Mary Sues in the story, I can also say that it seems to work quite well in this case. Because the whole anime is centered around these two making sneaky plays, it only makes sense that both MCs should be smart and calculated. It could be frustrating if you aren't really someon",
    "\n                Death Note: The anime that turned gold with just one series, this now legendary title managed to establish itself as one of the smartest and most mind-blowing examples of the hidden detective genre to ever come to both screen and paper.\n\r\nThis anime has fantastic elements that mark the course of events and that these are increasingly convoluted, but they are also at the service of history to make us think about our own way of shaping systems to administer justice and preserve the social ord",
    "\n                Death note\n\r\nAn anime with some brilliant characters in it. You have to focus to keep up with the pace in the anime. You get very much information every episode at a relatively high pace. \n\r\nCharacter design is really good in this anime. Also a really unique and good story. \r\nI bet all people will like the 'good guy' as much as the 'bad guy'.\n\r\nThe characters in the anime are really smart, it even motivated me to learn for school. LOL :p\n\r\nLong story short:\n\n\nThis is a really good anime but",
    "\n                This review contains spoilers. The first few paragraphs do not contain spoilers.\r\n---------------------------------------\n\r\nFirst things first. Do not watch this anime if you:\n\r\nHate extreme manipulation of people.\r\nDislike major character deaths.\r\nWant a love story.\r\nAre not a fan of psychopaths.\r\nDon't want sleepless nights.\n\n\nDon't want to feel depressed for 2 weeks.\n\n\r\nWhile this anime series is indeed great, in which I mean that every character is thoroughly developed and it is easy to",
    "\n                Death Note might be an older anime, but it's absolutely great. It has a very unique and interesting premise, especially in the sense that we're watching it from the perspective of a protagonist that isn't exactly good. Plus, unlike a lot of the more popular anime--Naruto, One Piece, or Fairy Tail, for example--Death Note has no filler, and it doesn't drag things out either. In part, that might be because Death Note is shorter than the anime I listed, at only 37 episodes, but what that means",
    "\n                Well, Death note is definatly one of the best anime i've ever watched, though it was produces like 8 years ago. I seriously like the detective work which gets your mind involved and the love scenes are really overratted and unrealistic (The acting he does with the girls isnt satisfying). The series is epic from the supernatural point of veiw and somwhat unbelievable in the common sense sideway.\r\n            Its actually about a boy (last year in highschool) that gets a weird notebook that s",
    "\n                Dont forget \"I am Justice! I protect the innocent and those who fear evil. I'm the one that will become the god of a new world that every one desires!\" \r\nDefinitely recommend this show. If you havent watched this masterpiece what have you been doing. This is biased but Death Note ranks number 1 in the shonen anime category. After watching this show I am sure that you will share this opinion with me. Death Note gets straight into the story without some of the crusty, empty, and meaningless f",
    "\n                Okay, so let’s talk about Death Note. This anime? It’s like the kind of show that pulls you in and doesn’t let go. I’m sure you’ve heard of it, and if you haven’t, well, you need to. It’s been around for a while—2006, to be exact—but it’s still one of the most talked-about anime ever, and for good reason.\n\r\nThe Basics\r\nAt its heart, Death Note is about a high school genius named Light Yagami who gets his hands on this supernatural notebook. This isn’t any ordinary notebook though—it’s a Dea",
    "\n                Very good title perfectly shows that power corrupts watching we can see that Light Yagami has a God complex, he believes that everything he does is necessary to create a new better world, each of his killings is justified by the fact that he wants to create an ideal world without bad people, at the same time losing himself in his actions he started to murder even people who tried to stop him we have here an interesting perspective on what could potentially happen if a man got his hands on a",
    "\n                SUMMARY: Very good psychological and suspenseful anime.\r\nI can not say anything else that others have not said but I would like to contribute this grain of sand.\r\nThis anime is fucking good, from the first chapter they show you the rules and the tone of the story, without saying that the protagonist is different from the typical super good and kind protagonist that abounds in this industry.\r\nSomething that this anime does very well is to summarize things and not extend and still understand ",
    "\n                Death Note is a masterful anime that delves deep into the realms of morality, ethics, and the consequences of wielding immense power. The story follows Light Yagami, a brilliant high school student who stumbles upon a mysterious notebook called the Death Note. With the power to kill anyone whose name he writes in it, Light becomes Kira, a self-proclaimed god of justice aiming to rid the world of criminals. However, as his actions draw the attention of the enigmatic detective L, a psychologi",
    "\n                All I'll say is that if someone said that Death Note was objectively the best anime ever made, I don't think they'd be all that far off. It's one of those anime that it's just objectively a good anime. It did so much right that it's practically impossible to take anything away from it. The dynamic between Light and L, the way in which the different characters are written, the complex and thought provoking ideas, themes, and philosophies brought up in the story, the flawless worldbuilding, t",
    "\n                Okay so death note it is a classic, it's amazing but idk maybe a different ending was needed because after the death of someone i'm not going to mention, the plot was loose and idk a different ending would have made me changed my answer to masterpiece, cause it's the perfect combination between topics of moral, religion, good vs evil.\n\r\nIt's an anime everyone should see if like to see and seek philosophical details.\n\r\nMinimium spoilers\r\nIt makes you think a lot about Kira's plan and if it w",
    "\n                Far away from everything Death Note is absolutely Peak I can't tell how much i I liked the story and what's going on around it. Yagim Light or as the serious world says God of the New World \r\n The fight that was going on between Light and L will surely be immortalized in history. Worth watching \r\nThe world was normal too, except that the Death Note was the only abnormal one. \r\nThe story presented us with a strong template and deep concepts for each character.Ka Yagni Light and and and a lot",
    "\n                Anyone who says that it ain't good is dumb it is my favourite anime even more than naruto and it is perfect it has you question yourself what is good and what is evil ? What is justice and what's not? Who decides what's good and what's evil ? And it wraps everything up with a genius cat and mouse plot Light yagami the smartest student and talent of japan finds a notebook which can kill and uses it to make the world a better place and kill every criminal thinking he is justice eventually he ",
    "\n                idk this anime gets a lot of love and hate it depends on the persons personal view on how they like anime. if you dont mind a lot of thinking and dialog then you can probably watch this. it has this really nice dark tone too it and the main characters in my opnion are really neat. i watched this in grade 6 and i used to love L!!! hes really fcuking cool oh god\r\nand light idk he gets a lot of love and hate and im neither im not so attached to this show but it did leave somewhat of an impact ",
    "\n                I love psychological and crime anime's and Death Note fits perfectly under that.\n\r\nEnjoyment: 10/10\r\nI have a short attention span so it takes me a while to finish anything. I enjoyed watching Death Note SO MUCH I finished all thirty seven episodes in one week. I've never finished anything that quick. I loved how smart the main characters are in Death Note. Even though Light is psychotic he is extremely smart, he even outsmarted himself. L of course is very smart too and it's beautiful to s",
    "\n                Death Note is the anime that made me look at the entire medium differently. I've been hooked on anime ever since.\n\r\nStory: High school student Light Yagami finds a notebook that states whoever's name is written in it will die. With the power of this notebook, he comes up with a scheme to try and change humanity forever. The story turns into a cat and mouse chase between him and the world's best detective named L. The way it narrows down the story so quickly with it's fast pacing to become a",
    "\n                So, Death Note. I've probably started watching this series maybe 3 or 4 different times over the years and this is the first one where I have completely seen it start to finish. And it was okay. The good that everyone draws on is with the first half of the series, which to me is before they move into their \"sci-fi\" headquarters and the Yotsuba arc of the show starts. Before then, there is a nice grounding in reality and feels like a better focus between Light and L as the two outwit each ot",
    "\n                *Note I watched the english dubbed version of Death Note\n\r\nOf course, when one writes about a &quot;suspense/crime/thriller&quot; anime it is hard not to include spoilers while getting to the meat of what makes said anime good in the first place, regardless I shall do my utmost to avoid any such spoilers.\n\r\nFor me, Death Note is one of the most original animes i've seen, rather than using some tired &quot;good vs evil battle&quot; style it is a &quot;good vs evil battle of the minds&quot; a",
    "\n                This is my first time writing a review for any anime, I honestly wouldn't have watched Death Note because I am a rom/com fan but I did anyway due to my friends constantly telling me it's one of the best animes out there. and I had to agree.\n\r\nStory 8: A High school student who so happens to find a notebook that whoever has their name written on it will die, at first I found the idea.. stupid and I really thought this anime's story would be stupid but it wasn't. It showed how a person with g",
    "\n                Prelim Note: The 1st half of the show deserves a 10/10, yet I believe the second half deserves a 5/10. That explains my reasoning so no one thinks I think the anime is above average.\n\r\n(SPOILERS AHEAD)\n\r\nThesis:\r\nDeath Note is a classic anime that I believe is way ahead of its time. Though a few flaws keep me from giving it a perfect score, I do believe it still shines as one anime that deserves a watch if you never watched it before.\n\r\nStory - 7/10\r\nDeath Note, in my opinion, hits a proble",
    "\n                Death Note began with something of an interesting idea executed in a slow and somewhat boring way. Light Yagami seemed the cliche male anime lead and the dark, neutral colors of the show made it appear creepy and unsettling. By the end of the first episode, the show appeared similar to others of its genre and not particularly exciting. However, everything about the first episode could be very graciously forgiven after watching the second. Light's character developed magnificently, making hi",
    "\n                death note may have one of the best first halves of an anime out there in this genre. i just really wish it kept that steam through the entire thing. the first half/arc of death note kept me on the edge of my seat constantly. this giant game of cat and mouse between light and L, all the twists and turns kept me guessing as to how certain things would play out, the characters and their quirks made me fall in love with them and the story. the main problem with death note that keeps me from gi",
    "\n                Death Note strongly resembles \"Crime and Punishment.\" Although I would recommend this work, I think that it has significant flaws.\n\r\nThe anime revolves around strategy / logic games, concepts of morality, and distinctive characters. The central conflict comes from a cat-and-mouse battle between two teenage leads, which is primarily carried out in the form of dialogue.\n\r\nThe strength of the anime comes from our enjoyment of watching the characters develop and foil complex strategies. Because",
    "\n                Death note is a rare anime in that it's best moments are a tennis match between two characters and a scene where the main character eats a potato chip. I have never seen an amine that is so grounded in real life but still so over the top and out of this world. I don't know if it is possible to make another anime like Death note.... Even when the quality starts to drop in the latter point of the series it still has some enjoyment to be found.\n\r\nThe straight up best thing with Death note is t",
    "\n                For me Death Note was one of those anime that I'd do anything to experience for the first time. Although it still is a mainstream anime today, it doesn't change the fact that it is a masterpiece in my opinion. Death Note quickly introduced you to it, and it was very clear. Since the first episode it was very ominous, which gave it a spooky yet exciting sort of vibe. After seeing the first episode you quickly wanted to see the next. The way the story developed throughout the anime was amazin",
    "\n                Anime Perfect !!\r\n The story is distinctive and interrelated events and very great personalities The beginning is strong and the end is charming that the greatest anime at all times, there may be a descent in the level of the second half of the anime, but this does not spoil it anime does not repeat.\r\nI have to say from what I've seen that Death Note goes above and beyond your typical run-of-the-mill action based anime. Whereas a lot of anime strategically relies on action packed battles an",
    "\n                <Potential Spoilers> \n\r\nDeath Note is overtly different from a lot of anime. \n\r\nThe majority of anime fans would agree that death note is a top-class anime. The combination of flawless storytelling, perfect animation, one of the best original soundtracks, and interesting characters. All work to create one of the best anime of all time. \n\r\nThe story of Death Note explores many complex themes like morality, justice, and righteousness. Is it ok for someone to purge all criminals when they are ",
    "\n                *WARNING: THIS REVIEW MAY OR MAY NOT CONTAIN SPOILERS. YOU HAVE BEEN WARNED*\n\r\nStory 8/10\r\nLight Yagami is a high school student who one day discovers a \"Death Note\". With it, he plans to rule the world free from criminals. However, his killings catch the attention of notorious world famous detective, L. Now, it becomes this game of cat and mouse. Who will win at the end?\n\r\nI gave the story 8/10 because the second half of the series was weaker than the first half to me. Like, I'll be honest",
    "\n                Ofcourse, It's an masterpiece. It's thrilling, little sppoky. but amazing story. its just take two episode two get addicted to this anime. There is a huge twist too. which is nice but also somehow upsetting. you will see. Truthfully i would have given it 9/10. But how amazing the show is, and even if after the twist it was lil boring(gotta admit) but the ending was good. so i guss death note deserves the praise. and the sound effect ad everything just.....AMAZING.\n\r\nIt was one of my first a",
    "\n                Do I even need to say it? ...masterpiece. (spoiler warning for second half)\n\r\nThis was one of the first anime I ever saw. I first watched it when I was about 12, so it's a bit hard to remember what my first impressions were, but I remember being totally blindsided by the genius and complexity of it. I'll try to skip talking about the stuff that everyone talks about and agrees are the best things - the moral ambiguity of Light and L, whether or not the Death Note can be used for good, and th",
    "\n                This is the anime which really got me into binging anime. It changed my overall perspective of anime. I used to think anime was a means for kids entertainment , but this proved me wrong ... This series is so well written .. The plot twists , the characters , the music , the story , the pacing everything is just perfect ...\r\nDeath Note is definitely one of the best anime out there, for it presents a deeply unique and compelling story rivaled by few. I can truly say it is one of the best, if ",
    "\n                Death Note is the most popular anime, and I can understand why. Spoilers ahead so if you haven't seen it yet, I warn you. The story has its plot holes, sure, but it didn't bother me at all. What I love about this is the emotion it makes you feel. I was rooting for L and against Kira, but in the end when Ryuk finished him off I actually felt kinda sorry for him. You realize that he was just a college student who went by the wrong path. On one hand, I was satisfied that Light was dead, but on",
    "\n                Hello! It's my first time writing a review, and sorry for my English.\r\n----------------Story-----------\r\nDeath note is the best anime I have watched(watching anime since 2k10).\r\nEverything is perfect except for 2 things:\r\n-KIRA's death\r\n-L's successor\r\nKira tried so hard in his career and everything, but he lost some spoiled brat. That brat is not so good as L  . He just comes and finished, that's it. I hate the ending. \r\n------Non-story------\r\nI understand I need to change and improve myse",
    "\n                Death note goes to show not every anime need fighting to be considered amazing.Not only just that the death note anime is drilled with the ideology of something beyond the concept good and bad.The protagonist named light yagami who is not your typical anime protagonist in the slightest but a bright future over achiever.One day he finds a death note which can kill any one if name is written inside it.After finding the death note he starts using it to purge the world of evil with the quest to",
    "\n                THIS REVIEW CONTAINS SPOILERS\n\r\nDeath Note, the anime that made me and many other people an anime fan. This was my favourite anime for a really long time. I'll try my best to give it justice in this review.\n\r\nStory  9/10\r\nAnyone who read the synopsis of Death Note instantly got intrigued by the plot. A cat and mouse show is not that unique but Death Note manages to make it unique by keeping it grounded even after adding supernatural elements. The concept of a book that kills by writing name",
    "\n                Note desu - Suiseiseki\n\r\nMany compare it with Code Geass. particularly Light with Lelouch. That hardly holds any water. Light not only far less smart, but also very different from Lelouch on fundamental level. \n\r\nLight does not try to change the system and make world a better place. Nor does even has interest in learning more about anything. He just kills criminals based on his simplistic black and while morality, that erroneously divide people into good and bad guys. Because of that this s",
    "\n                Story:\r\nI won't jump into bandwagons. Really.. umm.. well maybe a little but this will be a bit different since I'm not a blind follower, if that makes sense. If you get what \"unpredictable\" means, then you won't find Death Note any less unpredictable. As far as \"unpredictable's\" meaning can go, it was a masterpiece during the first 25 episodes, sadly, the story took a significant turn downhill because what happened after pretty much ruined the dignity and honor of the show. Perhaps I liked",
    "\n                In all honesty, I did not finish Death Note all at once. I started Death Note 4 years ago, and I put the anime on hold at episode 25. Why? I didn't like what happened in that episode, and I'm sure most people didn't either. For that reason in mind and several other reasons (such as plot exaggerations, holes, etc), many people were probably like me: putting the anime on hold, dropping the anime, or simply giving the anime a poor rating. But gave Death Note another try because it deserves ano",
    "\n                Ah, Death Note...I really recommend this anime...to basically...anyone...\n\r\nI'm one of those otaku that like the girly girl anime- shoujo or BL for this girl...very typical. And I saw a lot of Death Note on anime sites but I never tried it because it didn't look like my kind of thing...I sure was wrong though!\n\r\nIt's not scary! It's more like a mystery, and that's what pulled me in. At the end of each episode there was a cliffhanger which made it so I HAD to watch the next episode. It's one",
    "\n                Death Note is pretty good and has such an interesting story, indeed. BUT... here's a few reasons why it's not that great.\n\r\n1) it's really sexist. I noticed how only the male characters are \"awesome\" (like Light and L) and all the female characters are either there just because (like Light's mom and sister) or are there just to be submissive over men (like Misa and Takada).\n\r\nNot only that, but countless characters say sexist shit as well: the detective on early episodes saying that once hi",
    "\n                I don't write reviews for anything but I really feel like I need to explain why this is such an incredible anime and why it is easily one of the best and most interesting anime of all time.\n\r\nLets start off with the premise. Its a simple one. A boy finds a notebook and realizes that with it he has the power to kill whoever he wants. This premise, although simple creates an incredibly interesting story line for the series. You are able to hear the premise and instantly you think: \"What would",
    "\n                Such an outstanding story.\n\nDeath Note. It tells you what happen, when a person discovered it. A book that can actually kill people. Instantly. The decision is on your hand. You can control the world. Or destroying it. \n\nThe series itself is not just have a dark or gloomy story, but also engaged you to roll up your minds. Somehow can make you feel tense. The protagonist Light Yagami however, is not what protagonist look like. So does L. In the end it can conclude on one sentence. \"As clever",
    "\n                Imagine you are watching a fella try to make the world utopia via brutal mental and physical conquest for 37 episodes, that's Death Note. The physical conquest is well, writing in the Death Note, not actual punching. (for the most part) The mind games are really where it kicks in though, it's fun and engaging and will have you on the each of your seat the whole time. It's relatively short too, at only 37 episodes. It does go downhill a bit after a certain event which I will not spoil (trust",
    "\n                Many people have praised and reviewed this anime, so why am I repeating the cycle? Because Death Note is amazing. Not to mention that this can be a great gateway into anime if you're unfamiliar. \n\r\nDeath Note is one of those animes that you'll never see anywhere else. It offers a unique perspective of a moral dilemma. Is murder okay when it comes to criminals? The game of cat and mouse between the two main characters is legendary throughout the community. The weakest part of the story consi",
    "\n                Opening Information\n\r\nA chronically bored Shinigami (God of Death) intentionally drops a \"Death Note\" in the human world. The notebook is found and kept by Light Yagami, an extremely prideful boy but an excellent student. He quickly discovers that if you write a person's name in the Death Note while picturing their face, the person will die of a heart attack. Light sets out to make the world a better place by killing dangerous criminals whose names are publicly broadcast. Not everyone agree",
    "\n\r\nSpoilers (duh)\n\n\r\nHonestly, I loved this anime.\r\nIt being one of the first anime's I've ever watched, I personally didn't have good expectations. But my god, it was great.\r\nIt starts of with your perfect highschool student named Light Yagami, with perfect grades, looks, and a perfect life in genral. One day as he's walking on his school campus, he notices a black notebook fall out of the sky that he ends up picking up. It's titled \"Death Note,\" a book that results in a person dying when you write said pe",
    "\n                Death Note is, IMHO, perhaps the most overrated anime of all time. While it starts off as a fun, invigorating thrill ride, it fails after that, for a number of reasons.\n\r\nDeath Note begins with Light Yagami receiving a notebook with a special power: any name he writes in it will die. Immediately, Light makes things interesting by choosing a questionable route: he begins writing in the names of criminals. When he starts pushing it too far the police get involved and a battle of wits ensues b",
    "\n                Death Note is a stunning adaptation of an equally outstanding manga. I read the manga first and then watched this; it features no filler and really doesn't leave out any significant detail, so the two are pretty much comparable.\n\r\nThe story is a thrilling battle of minds. It's intriguing to follow Light and L's competing strategies because it's told at an exciting pace and because the stakes feel very high. The death note's power feels unique and original, and has well-defined limits so tha",
    "\n                Well death note, to be honestIi put this off as I like anime's with a fair bit of comedy and moe so I didn't bother touching this anime. But I saw a youtube video recently which made me watch this anime and O.M.G was i missing out. This anime is so well planned and some of the way the killings are planned in this anime is unthinkable. My favourite character is L as he does have a bit of comedy element to him but to be fair every character is amazing in their own way. But that's not what mak",
    "\n                Death Note to this day is still one of the best anime I have ever watched. The rivalry and the battle of intellect between L and Light is one of the best Battles in anime. But then again when I say that, I mean the first half because the 2nd half though still decent is pretty shit compared to the 1st half. \n\r\n1st Half with L and Light is easily a 10/10 anime and anyone who disagrees I will fucking shoot with a shotgun. JK but come on the first half was fucking amazing how was that not a 10 ",
    "\n                Death Note is one of the most popular anime out there, so I think it needs no introduction. This anime marked my life and I believe it must have had the same effect on many people, and is still one of my favorite animes.\n\r\nStory (10/10): The story of Death Note is indeed one of the most original stories ever created, especially if you consider how battle shonens have already supersaturated among other cliches, this anime was created in this context, even published in Shonen Jump! as an alte",
    "\n                Death Note is probably the most popular anime. I can understand why. The show is a must-see whether or not you are new to anime. Death Note's most memorable aspect is the characters in the show. The characters are all quite likable. It makes the show even more enjoyable. I already quite liked the story idea. \r\nMy only problem with the show is it tends to lag on. After the first half of the show, I began to lose interest. I powered through and I do not regret it. Overall the show is not actu",
    "\n                I am not the most detailed person about these types of things. I rarely write reviews, but I recently rewatched the series. Outside of what I would call the second half of the show? This show is a masterpiece through and through.\n\r\nThe relationship between Light and L is something to watch unfold. I really don't want to spoil a single thing about the series for anyone even considering watching this anime. It is worth the watch.\n\r\n If you want to introduce someone to anime and don't want to ",
    "\n                One of my first anime that I watched as a serious anime fan. A lot of people online thought of this anime as masterpiece, so, as a normie, I wanted to check it out. \r\nI was impressed. \r\nAs a person who is not as intelligent, this series managed to leave me thinking, what I, as very emotional person, tend not to do. What is justice? Who was on the right side? I had to stay neutral about that. \r\nOur main character, Light, is also the villain. Villains tend to be antagonists in books, comics, ",
    "\n                F's REVIEW:\r\nDeath Note is an anime that reached its popularity thanks to the intellectual battles that its characteres are submitted through the plot. It's just a shame that, we, as a public, don't take part in any of those battles. \n\r\nFor more worked-out arguments, it's necessary to remember just a little about the narrative: Yagami Raito finds, by chance, a notebook that belongs to the gods of death (\"shinigamis\", popular figures from the japanese culture), which has the supernatural abi",
    "\n                I got introduced to this anime because I remember my young cousin mentioning it. Before I knew it I was poking around pages of information and mentioning it to other anime enthusiasts. Ultimately I decided to watch some of the series for myself, and I was instantly hooked. This is, hands down, one of my favorite anime, and for good reasons.\n\r\nStory: Death Note has one of the most compelling stories I have seen. To me, a psychological thriller about an insane mass murderer with a perverted s",
    "\n                     This is an excellent concept that had unlimited potential.  The power of judgment via death is given to the brightest young mind in Japan and his ridiculously in-depth strategies to remake the world in his image and avoid capture.  The antagonist is one of the most finely tuned and fascinatingly entertaining characters I have encountered &ndash; the great detective L.\r\n     I will do my best to not put spoilers in my reviews but let it be known that about 2/3 through this series it&rsq",
    "\n                This anime was so good it made me want to just go outside start walking around to see if there are notebooks on the ground that I can pick up and write my professor's name into it.\n\r\nThis anime is so well thought out that it's unbelievable. The supernatural beginning will immediately draw your attention. Like a mentally challenged kid running to candy, you will be glued to the anime.\n\r\nEven if the logic in the anime isn't real it still managed to make the readers feel as if it's genuinely i",
    "\n                Story (Tsugumi Ohba): If you have a taste for mystery, then Death Note is the Anime/Manga for you. Despite all the absence of gun-slinging, kicking and punching and all the stuff like that, Death Note is still somewhat....acceptable as an action-genre. For some reason. Death Note, for me is and will always be one of the most unique and mind-blowing Anime/Manga in recent history. Let's face it; when you see \"Shonen Jump\" on the front of the page you will probably think it's a bad manga. But ",
    "\n                Death note is easily one of my favorite animes, though my opinion may be bias since it was the first anime i watched. One thing i love about it is that it doesn't have any filler episodes, and every episode has you hooked. i finished death note in about 2 days and it was amazing. The ending is a controversial topic, personally i found it depressing. But honestly it depends on what your idea of justice is. The thought put in to the anime is mind blowing, just when you think its about to go d",
    "\n                If you were to create a utopia, would it be okay to kill to achieve it?\n\r\nThis is one of many intriguing philosophical questions that the anime poses when bored teenage genius, Light Yagami, stumbles across an otherworldly notebook that allows him to kill anyone whose face and name he knows. He eventually decides to use the notebook to punish criminals as a means to discourage crime and create his idea of a perfect “new world”. The central conflict of the story stems from Light attempting t",
    "\n                Death Note is one of my favourites anime ever and one of the most famous animes in the history. \r\nMy first review :)\n\r\nTHIS REVIEW MAY CONTAIN SPOILER.\n\r\nStory 9/10:\r\nThe first half was pretty good i liked it a lot, when the shinigami came with his notebook and explained the rules i thinked \"what would I do with that power?\", well the protagonist decided to make \"Justice\" in his own way killing every criminal to create a \"perfect world\" and be \"the god of the new world\" and he almost did it",
    "\n                This was amazing when I tell you I was on the edge of my seat the whole time!! I really enjoyed this anime it was one of the first ones I watched so it might be a little biased, but it really is good. I love how clever light did everything(The potato chips scene!) I love crime and mystery types of stuff it was cool to be on the side my the \"bad guy\". I like how they made you root for this clearly insane main character. I enjoy a lot of animes where you follow the bad guy cause it is much mo",
    "\n                For the first part of the series it is insanely good. Mind games, plot twists and good character development. Once you get a bit further from halfway through the show gets more boring in my personal opinion. You start getting less interested due to characters that end up disapearing.\n\r\nOverall still a good series if you like criminal related topics.\n\r\nIf you are looking for a series with the lastest graphic quality this is not it. This one is an old school but it really doesn't matter becau",
    "\n                Sometimes more than having any legit gripes, you'll be unable to get into something just because it's \"after your time.\" I just don't get the appeal of Death Note, it's like anime for the Hot Topic/nu-metal crowd. Really bad metalcore music, angst angst angst, a general goth pseudo-creepy vibe, and characters who seem to have more obvious quirks than personality. (Imagine all the awkward middle-schoolers who probably tried to imitate that tired looking guy's weird mannerisms and try not to ",
    "\n                Death Note is the most popular anime ever in the West. Over 1.5 million people have seen it on MAL alone, and I'm sure the general public has had many an outdated meme thrown in their faces, whether they watch anime or not. If you hadn't heard of it by 2017, it got a very poorly-received live-action film only on Netflix (thankfully). It was my first anime, too. So, I thought I'd review it, even though no one's going to even see it buried under almost 800 reviews.\n\r\nDeath Note, if you don't ",
    "\n                ***SPOILER WARNING***\n\r\nFor the first 2/3 of the series, I really enjoyed this show. I've put it on hold because Light has become a complete prick, and I can no longer enjoy watching him do his petty egotistical manipulations of the people who care about him. He's become shallower and more selfish with each episode since L died, and I have better things to do than watch Light masturbate (metaphorically) to his image of himself. The writers of this story started off building a cathedral and ",
    "\n                Okay, before everyone goes all psycho on me...\n\r\nDeath Note is, and will continue to be, one of my favorite animes. Then why rate it so low, you ask? Well... I'm trying my best to review honestly, and not let the hype get in the way. (If the above sentences made no sense at all, well... think of it like this.. I'm very critical of animes that receive endless applause and praise. There must be /something/ wrong with it. XD Take, for instance, Twilight. Why's it so popular if the writing's tr",
    "\n                Where do I begin with Death Note? I loved the manga (for the most part). The series was a brilliantly thought out game of cat and mouse with dark undertones. It was like watching/reading a twisted mental chess game between L and Light. Oh...L and Light. As a girl who loves Death Note, most people would assume I'd go all girly over the fanservice given in the anime series. The scene on the roof in the rain where Light seems all concerned for L's health and even helps him dry off on the stair",
    "\n                There are many paradigms about who the real heroes of the truth. Some say he is the person who has super strength, he is a policeman, he is a soldier, he was a detective, he was the one who makes the rules, people are intelligent or even a Shinigami (death god). Anime Death Note will provide a bit of views on how it is we live to see it.\n\r\nDeath Note is so phenomenal even ranked first in the MAL in the category \"Most Popular\" and even raised in the Live Action is not only that even many cou",
    "\n                Sigh........\n\r\nThe first 25 episodes of this show were absolutely amazing. If this show had ended at episode 25, I would've given it a perfect 10/10 easily. The battle between Light and L had me on the edge of my seat every episode. I have re-watched these first 25 episodes at least 4 times without getting bored. They were really that good.\n\r\nUnfortunately the last 12 felt like a cheap attempt at replicating what the first 25 did so well. The twists felt forced, the characters felt like car",
    "\n                A very good series to watch. I have seen this anime more than 15 times. the art style, sound system, character design everything is outstanding. \r\nTalking about story line ...ok i won't give any spoiler but the story line is really good.\n\r\nok now about the story. A story about a ordinary school boy. Who wants to change the world. This world is filled with evil and crimes. but a normal person can't do anything. So a school student called light yeagami cross a path with the shinigami world an",
    "\n                I thought this anime was fantastic. It's a story of hubris and arrogance and extremism and how what seems positive at first can lead to injustice and the betrayal of one's ideals... the \"tyranny of good intentions\".\n\r\nI like that the story authors simply showed Light's actions without condemnation or apology, allowing the audience to form its own conclusion.\n\r\nThe philosophical question at the heart of the story is profound: What would I do if I had this power? Who wouldn't be tempted to us",
    "\n                How do I even begin this review? If you don't know what Death Note is, than you probably are a parent of a child that watches anime and randomly came across it. There is no other explanation. If you haven't watched it yet, stop reading this review and go do it now. Although I'm sure you already did.\n\r\nYou might like this anime if:\r\n-You like great, dark stories\r\n-You enjoy watching a battle of wits rather than strength\r\n-You like anti heroes\r\n-You are looking for a show to get sucked in for",
    "\n                Death note was not only my first ever anime to watch, it was also the only anime that has made me question my own morals and beliefs, which had never been done before. One of the greatest things about death note is how it explores the value of life and death, the audience themselves are in a crossroad not knowing who the bad guy or the good guy is, or even if there is a set hero. \n\r\nWith death note it allows the viewer to make up their own mind when it comes to who's in the right and who's ",
    "\n                i didin't liked it. to say thruth, when i ended to whach it, i thought : for what in the hell i used my time for? to whatch a shit? man, it was sooo booring... just the fact that L was beutifull, and the best of all of them made me whatch death note. uh, and maybie also the fact that almost all of my friends who whatched it, said oooh how can you not like it, blah blah blah blah blah blah, death note is the best anime ever.... NO, IT IS NOT! sorry, death note's fans, but it's what i think a",
    "\n                Death Note.\n\r\nThis is the best anime i've seen, Untill they destroyed it. I enjoyed every minute of the anime, for story, and what made me like it is that most people would act like Light if they had the guts.\n\r\nHowever the series is unbearable after 15 episodes, and there is where they destroyed this anime. They had the option of making the worlds most watchable anime or they had the option of creating a sucking cloaka that wouldn't even be touched by roaches. Seriously I were angry and sc",
    "\n                Ah, it pains me to write this review. Well, to be more precise, this is more of a commemoration of the good parts of Death Note, (a.k.a. The first 20 some episodes), while strenuously acknowledging the steady decline of the series as it progressed. \n\r\nThis anime had great potential, as in, it would've recieved a solid score of 8, if it had ended with a short conclusion after the obvious climax. It possessed a good set up, easily transitioning into the actual plot. The portrayal of our socio",
    "\n                SPOILERS\r\nI'm disappointed in the ridiculous worship this anime series has gotten.  The problem is that the story has WAY too many fake contrivances.  Moreover, it suffers from perhaps the most common failing when a writer tries to write a story about geniuses...  Because the writer himself is not a genius, he will necessarily fail at coming up with believable strokes of genius.  Instead you get contrivances.\n\r\nWould a genius really think the way to make Earth a paradise is to implement the",
    "\n                Story:\r\nDeath Note is one of the most popular anime around. For a good reason ! Death Note starts of with a highschool student ( Yagami Light ) who's the smartest kid in the entire school ! He's bored with his life , mysteriously he finds a notebook named 'Death Note' in the death note it describes the rules and how it Death Note works. But there is a click a Shinigami ( Death God ) drops his Death Note from the Shingami realm to Earth. Who ever picks up the notebook the Shinigami must be w",
    "\n                English.\r\nAn anime with one of the most interesting concepts I've ever seen. What would happen if we had a notebook where if we put the name of a person, it dies immediately? Here we start to see the different ideas that the anime will deal with (giving a quick example: the morality of killing someone indirectly with the Death Note will make you a murderer).\r\nIn addition to the above, the anime has a beautiful animation with a photograph that makes the viewer shudder.\r\nThe story makes the v",
    "\n                Ready or not, here comes another review!\n\r\nAlright, let's spice things up! Death Note is an anime series that will have you hooked from the get-go. It's like a scenic railway ride with a killer plot! Imagine a smartypants named Light Yagami stumbling upon a Death Note, a supernatural notebook that can make anyone kick the bucket. Talk about a game-changer!\n\r\nThe characters in this show are an absolute riot. The light goes from being a bored nerd to a full-blown psycho killer. It's a transfo",
    "\n                I want to express how enjoyable to watch this anime. I was discourage to watch this because of excess recommendation and huge popularity. But, I was wrong. It's not the best because of flaws which I feel is not good for my taste. Here's the following:\n\r\n-Slave-esque element (particularly with women)\r\n-The 100% probability of suspecting which I think take away the suspense of the anime.\n\r\nAs for the story, it feels unique as I can't think of any supernatural-like element that resemble to thi",
    "\n                Dear Death Note,\r\nthe beginning was thrilling and it hooked me up, One thing I love about this anime, is that how it made me think about what is indeed morally correct and even if we have a good sense of judgement, do we really have the right to end someone's life? what gives us that power? surely not a shinigami. God does not exist, it's a mere social construction that society created to give hope to the lost. Therefore, we have no right to entitle ourselves as God of a fairer world. And e",
    "\n                If you want to feel \"What will happen next?\" with every episode, Watch it right now! \n\r\nA mind gets surprised by tons of moments that this series has! I started watching it after seeing its name in the \"most popular anime\" list. Normally I don't watch suspense and thriller without romance, so it wasn't catching my attention in the beginning, but then I started liking it after 2nd episode. It's almost IMPOSSIBLE to drop this series in the middle! (this itself proves how amazing the series is",
    "\n                Death Note is definitely one of the best anime series of all time, for it presents a deeply unique and compelling story rivaled by few. I can truly say it is one of the best, if not the best anime I've watched.\n\r\nStory: The story is unique. A notebook falls from the sky, and the human who writes a name in it is capable of killing the individual pictured in his mind (I left out the details that you don't care about). This presents the viewers with a highly debatable theme based on morals and",
    "\n                It took several years to get around Death Note, simply for the fact that when I wanted to watch Death Note, I was 6 years old. Man, Ryuk and Light terrified me back then. They looked evil and I was right... 2022, I'm older. I just finished it and I loved it!  \n\r\n*edit: I forgot to click the SPOILERS box, i'm sorry!*\n\r\nFirst point is the story, of course. Very interesting concept: A God of Death drops his deadly notebook into the human world out of boredom and a sociopath/narcissistic very i",
    "\n                Death Note; It is a decent series at best, starting with the fact that most of the characters are irrelevant, I wish they had focused more when Light has to leave the Death Notes, since he began to have direct contact with L, so he could there having further explored the morality of the characters and speaking of morality, the fact that there is no typical model of religion is a problem, since Light obtains the default reason for being a world where nobody goes to heaven and hell, going to ",
    "\n                Death note has creative idea but not being used it well\r\n.The story is exciting and enjoyable until episode 25, but the characterization has major problems. The motivation of the people is interesting, but their reasons are not clear.But the biggest problems come from episode 25 onwards.  The story is no longer exciting and two very bad characters enter the story (probably the worst you have ever seen) and with all these problems the ending of the story is acceptable.death note would be bet",
    "\n                GREAT!!!!! Anime with amazing story and high IQ level of characters. Music is at another level. Best for beginners.But the end that I don't like.L is very smart and high IQ level character.After the death of L the anime becomes little bit boring.Light yagami uses good mind but l is smarter than light.Question: Is the Death Note anime worth watching? Answer:Yes, sure. Death Note is one of the best anime I've ever seen. It is a thought-provoking anime and will carry you along with the storyli",
    "\n                Before I start, I think I should mention that my average rating is above 9, at least at the time of reviewing, therefore this is a below average rating for me.\n\r\nI loved the series in general, but there were two things that made it lower than most other animes I've watched. First, it just didn't feel right for a masterpiece in my eyes. Second, I felt the end was very unsatisfying\n\r\nSpoiler warning:\n\r\nWhat I found unsatisfying about the end is the way that the character that had been the pro",
    "\n                Death Note, a symbolic piece of anime, something everyone who has watched anime for any period of time as likely come across, and for good reason, with Death Note becoming a symbol in the anime community you can expect it to be for either a really messed up reason, or for being a top quality anime that lives up to its hype, and Death Note definitely lives up to it's hype. With #1 most popular anime on MyAnimeList alone, it definitely lives up to that reputation and fulfils all expectations.",
    "\n                This anime deserves to continue it's series forever with such entertainment it shows you. The show death note entertains with the secrets the characters hide and there thoughts, but there is nothing more said from me that this show is for many who like suspense and drama. Death note can entertain in many ways with it's parts that will always be a shock to you if you see it over and over, there maybe some scenes in this show that might make you more curious, but with the shows series ended i",
    "\n                Death Note is very good. Most Hollywood movies couldn’t do it any better. There is variety in faces, so nobody looks the same and most characters change clothes all the time. There are also too many static frames that ruin a perfect mark but aside from that it is excellent, as long as you like dark palette colours. Opening and ending songs are simply mind numbing.\r\nThe story is about the Death Gods in the series getting really bored with their existence, and from time to time playing tricks",
    "\n                I'm well aware that Death Note is an incredibly popular anime but I didn't expect it to be number 1 on this sites popularity list. That being said Death Note really does deserve it. Despite a few gripes that I have with the show, it's definitely worth the watch.\n\r\nStory:\r\n The story for the first 25 episodes fall nothing short of fucking epic. For a shounen anime, there's not that many fight scenes but the show doesn't need them because the show blends suspense with careful strategizing on ",
    "\n                I would highly recommend watching the show before reading this, as I will be explaining my opinion on later plot points. You know the drill.\n\r\n“Follow the teachings of god\r\nthen the blessings of the sea will be bountiful\r\nand there will be no storms”\n\r\nThose are the words that we first hear from Yagami Light, the main character of this show. And in many cases, this represents that we are about to watch. A god who will bless those who follow his teachings, and strike a storm on those who don",
    "\n                THIS REVIEW CONTAINS SPOILERS AT THE END \n\r\nDeath Note... To be honest, I tried watching it in my early anime days, but put on hold because it didn't really catch my eye, and I had some other shows I wanted to watch. After long 4 years, I decided to give this legendary anime another go, and realized how right other critics were. There's no doubt about it, Death note is a masterpiece and even though it's pretty old, it aged really well, so present anime watchers can enjoy it the same way oth",
    "\n                Okay, let's start where I liked it. The anime, in the beginning was perfect, Ligth showing to be very intelligent with a \"weapon\" of those in his hand, he could do something fucking fucking, he managed to gain the trust of the person who was protecting himself before the arrival of L, he made a fucking strategy. When L came up, he proved to be smarter still, you can even realize that in the game of tennis they have, they both think of things that would really happen if they played in such a",
    "\n                Despite what some would say, I believe that this is one of the only few anime to come out in the past 2 decades that was well worthy of all the hype it got. I've seen Death Note 3 times over and no matter how hard I try; I cannot find a single thing wrong with it. People bash the second half of the series and say it fell off; I say no, I thought it held up until the very end, start to finish.\n\r\nI believe this anime to be the poster-child of the psychological genre. It brings up many topics ",
    "\n                [This review is spoiler-free and focuses on personal opinions.]\n\r\nWatching an episode of Death Note always makes me smile.  It manages to be philosophical and tense, yet quirky and somewhat humorous at the same time.\n\r\nWhat makes Death Note great is the fact that it doesn't take itself too seriously. I'm not sure if I would've fallen in love with this show so if most of it wasn't so.. mundane.\r\nThe characters are extremely unusual, but the show rarely elaborates upon it through the characte",
    "\n                If you are a otaku. You already know what Death note is.\r\nThis is what i called the Pinnacle of story line.\n\r\nActually i can't say,, is it a beginner level anime or not ?\r\nWhy because you don't know which character you should support,,,in this anime every character is Gary...\n\r\nSome time you will feel Light is villain \r\nAnd sometime you will feel 𝐿 is the main character.\r\nYeah it's very common. It's actually depends on how you see the world and what you feel about justice.\n\n\n\nI think The ho",
    "\n                Summary:\r\nFinishing Death Note felt like I finished a masterpiece. I felt super satisfied with the ending, not because of what happened but because everything felt perfectly delivered and it went the way things should go despite some twists and unexpectancies. There were no overly \"lucky\" moments that don't make sense at all rather so much things happened the way it would make sense in real life. (Apart from the whole *Death Note* and 'God's of Death' concept itself) The villain (our protag",
    "\n                (SPOILER FREE REVIEW)\n\r\nStory (7): Honestly, I really rarely care much for the typical trope of 'high school boy gets whisked away on a fantastical adventure (usually accompanied by a myriad of cute girls)', and generally go into such plot lines with low expectations. This anime, while technically about a high school age student, avoids pretty much all the problems associated with that type of story line, and focuses more on building and paying off suspense and tension. Avoiding a general s",
    "\n                The best 25 episode anime in history.\n\n\r\n\"Wait but this is a 37 episode anime!\", yeah, well, you'll get what I mean when you watch :))\n\r\n*** Slight Spoilers ahead ***\n\r\nThere are 12 complementary episodes for kids and fans of fairy tail that prefer idealistic endings for a total of 37 :))\n\r\nI am someone that actually hates shows in the police mystery genre, so if someone like me gives this anime a 10, you should know what it means. It goes without saying that this only holds true for the fi",
    "\n                Okay so, Death Note is by far one of my favourite anime. Lemme just say that. And yes, i know i might not be as much of a credible source as other's because I've only watched a fraction of the anime others have, but dear god Death Note is good.\n\r\n------------------------------------------Story: 10-----------------------------------\r\nDeath Note is an anime that really hooked me in with the premise. The whole story of a bored high-school student that happens to find a notebook on the ground t",
    "\n                This was a very strategic anime. It was a great psychological thriller with very intelligent characters. It was cool to see the battle of wits in nail-biting suspense. The potato chip scene will never fail to make me laugh. This anime also pokes holes into the watchers' psych and see how they would react under the same circumstances and whether or not the means justify the ends. \n\r\nI absolutely adored L's character and how witty he was. He is certainly eccentric but that is what makes him w",
    "\n                I’ll try my best to avoid spoilers, but this review might contain a few.\n\r\nDeath Note is about a student named Light Yagami who finds a notebook capable of killing people. What he does with that power results in a game of cat and mouse between Light and the people dedicated to stopping him and his newfound weapon.  \n\r\nWhen I first watched Death Note almost a decade ago what got me was the battle between the characters. Upon rewatching, Light’s evolution and that of the world around him were",
    "\n                Death Note is a masterpiece. \n\r\nI say this because of the brilliancy put into the plot, themes, and characters. Death Note is also unique in the fact that Light- the protagonist- is the \"villain.\" The antagonist, L, is the \"hero,\" which is the opposite setup of most anime out there. Our story of Death Note is told through Light's perspective, as he slowly loses his sanity over the power given to him through the Death Note. A great showcase of how power corrupts.\n\r\nPeople are trying to find ",
    "\n                Death Note is an anime that has captivated audiences with its intricate storyline, complex characters, and thrilling cat-and-mouse game between Light and L. The show does an excellent job of building up the relationship between these two characters, showcasing their intelligence and wit as they try to outmaneuver each other in a game of life and death.\n\r\nHowever, many viewers were left disappointed with the death of L, which came as a shock and a disappointment to many. L was a fan-favorite",
    "\n                Death Note has many unique things in it that I have seen no where else and would 100% recommend it.\n\r\nStory: Death Note is a very unique anime and I haven't seen anything like it before. The actions in it are very unpredictable at time and its very thrilling. One of the things I particularly enjoy about the way it was made is that it gives a perspective of both sides of situation at hand and its up to the viewer's interpretation to decide who they thing is the one in the right and the one i",
    "\n                To be honest, I loved the show in the beginning. I was so hooked on the battle between L and Light. However, when Misa arrived my enjoyment went downhill. That isn't to say Misa is a bad character. I actually did really like her. The problem was what her character brought plot wise. There will be some spoilers. When Misa gets caught by the police that causes Light to give up his Death Note and hers to lose his memory. This caused an arc that was so unbelievably boring that I dropped the sho",
    "\n                The first anime I saw, a month before the quarantine started in my country.\r\nSo I can say that this high note is not because of nostalgia.\r\nStory (9): I admit that when I first saw the name and synopsis, I thought the idea was a little silly. But luckily, Death Note isn't just a story about a teenager's magic notebook, it's also a clash between two genius minds, one wanting to capture his opponent. And they create so much fascinating strategy throughout the anime that you never find it bori",
    "\n                The reason Death Note is masterclass is due to the fact that it's so different from your typical Shounen anime. Whereas some of the more popular anime's are all about fighting and the main characters searching for new ways to level up and defeat a powerful enemy, Death Note is completely different. The story is centred around Light Yagami, a typical high school student who come's across a mysterious notebook which changes everything. The story line focuses on Justice/ right & wrong and how ",
    "\n                OK I forgot I watched this show like a year ago and I'm a tinge drunk while writing this but here goes...\n\r\nDeath Note is really REALLY good starting out,\r\nThere's constant suspense building up, the situations are crazy and gradually grow in size. It has its emotional melancholic moments and most of the characters are pretty neat and fun to watch.\n\r\nThen randomly on like episode 20 something it just destroys itself into one of the most triumphant downfalls of all time. They kill one charact",
    "\n                Death Note merupakan salah-satu anime yang membuat saya memutuskan terjun sebagai penggemar anime. Menurut saya, Death Note merupakan anime yang harus masuk ke dalam wishlist tontonan karena memiliki alur cerita uang menarik. Anime ini menggabungkan elemen psikologis dan misteri dengan cara yang luar biasa, sehingga memberikan pengalaman menonton yang mendebarkan dari awal hingga akhir film. \n\r\nDeath Note menceritakan kisah Light Yagami, seorang siswa SMA yang sangat cerdas namun merasa bos",
    "\n                Everyone knows about this. It's a classic. One of the best and most famous. Still, I decided not to give it 10/10 like a lot of people would so I'll just say why.\n\r\nThe very beginning is the best part. It's better than 10/10, honestly. But this anime has certain 'milestones' and it gets worse each time. So I'd say it's at its peak for a few episodes, and my favourite part ends with Misora. (So when I rewatch Death Note it's to this moment, usually!) Then the anime gets slightly worse. The n",
    "\n                This review will be in two parts, the reason is because, for me I feel like the plot changes a lot after episode 25. So in this review I'll call every episode from 25 and before season 1, and every episode after 25 season 2.\n\r\n{Season 1} \n\r\nStory(10/10): It's hard, really hard to make a good characters... Its even harder to make him seem highly intelligent. It's also hard to give an intelligent protagonist a realistic threat... But the story achieves this perfectly and it feels like their i",
    "\n                7. Continuing from my Bleach, One Piece and Naruto reviews, I am still documenting my anime journey.\r\nFor a young man, Shounen has proven that there can be amazing shows like One Piece but also failures like Bleach.\n\r\nWhile I was mad dashing through random anime of my own choosing (which will lead to my next disaster review of Dragonaut), I decided to listen to what people on the net had to say. They all recommended Fullmetal Alchemist and Death Note.\n\r\nWhen I went into Death Note, I had ab",
    "\n                The animé basically starts off with high-school student and class prodigy Light Yagami finishing at the top of his class and getting the best grades, until one day when he discovers a strange notebook on the floor, called the Death Note. When Light picks up the Death Note, he reads that it has the power to kill people via heart attack just by writing their name in it. Believing this to be a joke, Light decides to test it by writing a random criminal's name down and finds out the Death Note ",
    "\n                What happens when an unstoppable force meets an unstoppable force?\r\nWhat happens when someone is given ultimate power?\r\nIs anyone ever fully right or wrong?\r\nDeath note poses these questions, but leaves it up to the audience to pick a side. \r\nStory: great.\r\nI will only be looking at season one, as that's as far as I got while still enjoying it. The story is full of twists and turns, and it's very entertaining to watch the show's two protagonists match wits and try to figure out the other's ",
    "\n                despite an initial pitch that i loved, along with a few redeeming characters thrown in the mix for good measure (looking at you aizawa & mellow); i found death note to be an absolute failure of a show in execution. nor was it a really ambitious failure you could get behind ~ it just kind of pissed away 37 episodes filled with lackluster intellectual pandering and poor characterization. i know that this puts me in the minority of takes regarding the series, but having high standards isn't a ",
    "\n                The first half of the first series is pretty good but gets tiresome as it is just rinse and repeat for the rest. The second season is a waste of time.\n\r\nI'm not entirely sure about the fuss around this anime. It starts off well, but it is the definition of dragged-out. The whole story just goes on far too long. It would be better if it lasted 24 episodes maximum (although, I think even that would be too long), but full amount was far too much and it strayed into some ridiculous territories.",
    "\n                Death Note is an amazing anime. The first 10 episodes or so show what kind of amazing story it could tell. Unfortunately, it was unable to reach its full potential.\n\r\nStory: 7/10\r\nThe elevator pitch for this show is quite compelling and for good reason. Into the hands of a high school student falls a notebook with the capability of killing anyone. Such a premise could go any number of ways, and a battle of wits between two intelligent people is a natural way of developing this premise into ",
    "\n                No spoilers, or summaries in this review, just an opinion-based, general discussion.\n\r\nI'm sorry, but this anime is so overrated. After all of the hype people were giving me about it, I was expecting a lot more...substance. Honestly, it started getting weird for me from episode 9 on. After that it just felt like a period where I was watching a completely different anime from what I had started with and there was so much fluff that I couldn't see through it! I feel like no depth was added to",
    "\n                How To Use It\r\nThe human whose name is written in this note shall die.\n\r\nDeathNote is a Mystery/Psychological anime based on the manga by Tsugumi Ohba and published by Shueisha. The 37 episode anime comes from Madhouse, originally airing from October 2006 to June 2007. Viz Media holds rights to both the anime and manga series. Two light novels, two games, and two live-action film adaptations were also created between 2006 and 2009.\n\r\nLight Yagami is an ace student with great prospects, who'",
    "\n                First I think I should say that I LOVE Deathnote .It’s really amazing in almost every way but I think anime ruined it. I bought Deathnote box set with all 13 manga (yes 13! The thirteenth one was detail review of all characters story and tons of cool stuff like how to draw characters and extra chapters from other characters life's). Manga is really much better! If you like Deathnote and haven't read it then you must (and if you can BUY IT. Believe me it’s much better to have it around and m",
    "\n                Death note is a well done strategy anime and deserves its hype.\n\r\nThe fun of the death note is the it isn't just shock value like Madoka Magica, Attack On Titian and SAO,it is more about how he goes about killing people in creative ways. \n\r\nNot just pity death, but real weight behind them.\n\r\nThe protagonist, Light Yagami,(like keima from the TWGOk).is one of the more genuinely smart protagonists. He is smart not just cause of his status and knowledge, but how he uses what he  knows.\n\r\nLong ",
    "\n                \"This world is rotten.\"\n\r\nIrrespective of the side you take while watching the show, can you dare disagree with Light Yagami on this one point? In an age where you hear woman being murdered for the sake of a pervert's pleasure, gatherings being bombarded for the sake of a person's religion, family members killing each other over some land... I didn't wanted to make my first MAL review so depressing but... did I say anything factually incorrect? We do often hear news that makes our blood boi",
    "\n                This is one of the best psychological thrillers out there. \n\r\nIt sucks you in right off the bat and when the two main characters pit themselves up against each other, you feel as though you're right in the middle of them. It really stimulates your mind and even when you think you're one step ahead of the characters, they knock you backwards. \n\r\nTowards the end, it fell slightly short in some episodes, but nevertheless, a truly fantastic piece of art! I almost NEVER re-watch anime, but I hav",
    "\n                (Note: this is my opinion)\r\nDeath Note is a quality anime. The plot centers around Light Yagami, a high school student who is known for being very smart, finds the Death Note, a notebook that kills anyone whose name is written in it as long as the person writing the name has memorized their face.\n\r\nLight Yagami's only challenge is the brilliant detective L who is basically a discount batman. L was orphaned at a young age and is armed with lots of money and a butler.\n\r\nThe first 25 episodes ",
    "\n                Death Note could be a masterpiece but the motivation of Kira unconvincing.\r\nPut yourself in the place of Light, if you received a death note, you could kill people with only 17 years old.\r\nWith 17 years his biggest concern is their school grades but to Light Yagami this is not a problem because it is considered one of Japan's brightest students. In the first episode, Light says that the world is rotten, lost. This does not justify you want to be a God and punish people. For example, The Pun",
    "\n                I used to be an investigator, a detective of sorts, so I was highly sceptical about this anime as it was so greatly praised to be (the central focus of this psychological show is about detective work, after all).\r\nThroughout this anime, I've tried to make as many predictions as possible as to what would happen next, who was doing what, ect.\r\nImagine my surprise when I only had one of my predictions and assumptions come true, and that was that Near would have known what Light's plan was.  \r\n",
    "\n                Yagami Light finds himself a notebook, dropped by a Shinigami: the Death Note. If you write down the name of a person in this Death Note, he’ll die, no matter what. With this new Death Note, Light begins to create a perfect world, killing off all criminals. Then, a detective who goes by the name of “L” gets assigned to catch him.\n\r\nLet me first state that Death Note is unique amongst shounen-anime. There are nearly no fights, and nearly the entire anime consists out of people planning and p",
    "\n                Overview:\r\nThis series is overrated.\n\r\n'Overrated' does not mean 'bad', it means 'overrated', as in 'not the amazing masterpiece a lot of people make it out to be'. Now, before you all start throwing hissy-fits and accuse me of not understanding or whatever, just bear with me for a bit and let me explain my position, because I can give plenty of good reasons as to why I feel the way I do. It's a very good series- I don't mind admitting that- but it has a lot of glaring flaws that people ten",
    "\n                This is probably one of the best mystery/thriller animes you can watch right now, and even with the age of this anime it still holds as one of my favorite animes and has some of my favorite characters. My brother introduced me to this anime when I was much younger and when I finally got around to watching it myself, I loved it! The way the story manages to keep you on the edge of your seat, and manages to stay so unpredictable makes the anime so interesting and unique. This anime definitely",
    "\n                A single japanese youth with no name, L, is better than all the best detectives and intelligence agencies of the world! Then of course lighto-kun only has 100% on all tests and is olympic medalist tennis player... Just like L! And then L finds out about Light being Kira in the first 10 episodes, yet doesnt arrest him because... The anime would end right there. So L won yet the anime continues because \"he's not 100% sure\". \n\r\nThis is what happens when characters are \"too intelligent\" for the",
    "\n                I’m sure this may trigger a lot of people and perhaps set some ablaze when I tell them that Death Note is one of the most boring anime series I have watched. Now, before you light me on fire and write my name in the death note you own, hear me out.\n\r\nI originally posted a review on this on 23 May 2021 and left it a bit too short for people to understand why I don’t like this anime. I meant to come back to it within the same month but I got caught up with life so now that I have time again t",
    "\n                Note: I dropped Death Note\n\r\nThis show is kinda bad (if you like it, cool, but it's a no thanks for me). I'm not hating on it because it's popular (and hence has become annoying to see like Dragon Ball/Bleach/Naruto), I tried giving it a real chance because of Misa. I adore female yanderes and have heard/read numerous times she's legendary. I couldn't make it past 5 mins of the 7th episode. There's so much wrong with this show. Light is 100% insufferable, a total edgelord, and not well writ",
    "\n                Death Note is one of, if not the most popular anime of all-time. It is something that can be appreciated by beginners of anime and veterans alike. Now diving into the review of Death Note.\n\r\nStory 10/10- Death Note has one of my favorite concepts of any piece of fiction I have read/watch. The idea of the Death Note and the cat and mouse game that Light and L play throughout the series is the most entertaining thing in anime I have ever watched. A lot of people complain the show falls off in",
    "\n                Every popular anime finds itself stuck in the same situation when it gets too popular, that situation being the \"oh, this anime is way overhyped. It's not that good\" kind of opinion. Death Note, the anime celebrating its 15 anniversary this year, certainly faces this situation, though I'm sure it's just a vocal minority. I do not think Death Note is a masterpiece, however, I still think it is one of the best mainstream anime out there and is probably the best gateway anime to people who kno",
    "\n                This is without a doubt, on the upper list of anime that are absolutely essential for anyone looking to begin delving into the genre. My only complaint if any, revolves around the end and halfway mark of this story. Which if you're familiar with it, can probably guess the reasons why. \r\nHowever, just to clarify this story is top notch and is a prime example of an engaging and original concept, especially within the Shonen Jump landscape. The story is dark, and filled to the brim with antihe",
    "\n                This is anime at its best. I'm fairly new to the world of anime, but I have to say from what I've seen that Death Note goes above and beyond your typical run-of-the-mill action based anime. Whereas a lot of anime strategically relies on action packed battles and fights, Death Note is a refreshing change of pace. It's slick, clever, and witty with the eccentric \"L\" heading the investigation. It's a constant game of cat and mouse as the lead investigator and the suspected \"Kira\" or \"Killer\" a",
    "\n                I'm going to be VERY critical for an 8/10 Review. And let me preface this by saying, I don't think this is a bad show. Or even a mediocre show. I still think its FANTASTIC. The first 26 episodes are chocked full of the most engaging mystery ever shown on Television. A one-of-a-kind cat and mouse chase. However, no spoilers, after Episode 26...I just couldn't convince myself the show is as captivating as it once was. Mello and Near are some of the most unenticing and unengaging characters I ",
    "\n                This one hurts so bad and I hate that I had to give this a 9. This was the 3rd anime series I had ever seen and what a ride it was. Before (you know what happened), this show was an absolute 10/10 no question about it. I hadn't been this invested in a show in a very long time and I'm so glad that I was able to capture that feeling while watching this one. However after \"the event\", this show took a turn for the worse. I still think it was good anime, but when compared to the previous episod",
    "\n                It's hard to talk about the story or characters in much detail without spoiling anything, and I believe that this would be best experienced blind.\n\r\nThat being said, I did unfortunately know one particular detail that occurs between the \"arcs\" of the show, but it's still so entertaining that it's worth watching either way. The protagonist and deuteragonist, Light and L, are easily two of the best, or at least most entertaining characters to watch, in the anime I've seen so far. The english ",
    "\n                OK \n\r\nI JUST FINISHED DEATH NOTE!!!!\n\r\nAnd I love it so much because the story and the characters are so well written and the music is amazing(I'm listening to the openings and the OST everywhere I go)\n\r\n1)I liked how Light was so evil and even if he wants to change the world by killing criminals,he became to obsesed of power and he uses Misa to kill everyone he wants.\n\r\n2)I really liked L because he's not the classic detective from any cop movie, he's diffrent and I like his good moral per",
    "\n                Loved the First part of the Show until somebody died and someone else rose up. The show and Overall story was incredibly good that's mostly why I rate a 9 because of how the good the story was. But to me after the first half of the show the story kind of died. I loved the overall quality of the for being made in the late 2000's as I am mostly judge a Show on how good it looks*. Personally to me the show was incredibly great and all but in the end I didn't like that one character \n\n\n\n\n\n\n\n\r\n*",
    "\n                This review contains spoilers!\n\r\nokay i've finally watched death note and i think it does all the hype and praise it gets...the 1st half was flawless literally, i mean there were minuscule stuffs but i will probably just sound nitpicky if i complain about them... the 2nd half tho thats were it begins to crack...the 2nd half is predictable and it was messy...i will give u few examples\n\r\nwhy were N and M only contacted after 6 years?? wouldn't watari's msg reach them immediately? why would th",
    "\n                Intro\r\nIf I get to introduce anyone into the world of anime, my best recommendation would be Death Note, written by Tsugumi Oba and drawn by Takeshi Obata. This anime not only will make you question your actual morals but it will give you a hint on what humans are capable of when acknowledging the tremendous power of having someone’s life in their hands.\n\r\nStory\r\nThe premise is simple; death gods take human lives by writing their names in a notebook called Death Note. The shinigami Ryuk ‘lo",
    "\n                My fellow weeb,\n\r\nDo we need another Death Note review? No. Is this one any better than the others? Unlikely. Will I write it anyway? Indubitably.\n\r\nAs you know I'm sure, the Death Note - which belongs to the Shinigami -  can kill someone by writing their name. A very interesting concept. There are many more rules and quirks but they are irrelevant to the review. A young lad named Light Yagami happens upon this book and can read English - as the entire book is written in English - he unders",
    "\n                Death Note is one of the best anime I’ve ever watched! It’s an incredible series that evokes strong emotions, especially with the confrontation between L and Light and the many epic moments throughout. What I particularly loved is the originality of the story; it’s so unique and very well-executed in the anime. The themes are serious and thought-provoking, addressing issues like the death penalty, justice, good and evil, religion, deception, and the many facets of human nature, such as deni",
    "\n                This the first time I wrote a review for an anime since the day 1 I'm into anime. Honestly, I kinda regret watching Death Note. Why? BECAUSE GOD DAMN IT'S THE BEST ANIME I'VE EVER WATCHED. I'm afraid I can't watch anime with the same excitement again because goshhh now I only expect something like Death Note.\n\r\nI've been a fan of mystery/suspense/thriller/dark anime for a long time but I only finished few that I think worth to be finished and special/original, not just your typical mystery ",
    "\n                No le pongo un 10 porque la segunda parte decae un poco. Aún así, es el típico anime que se ve todo el mundo cuando está empezando asique si alguien nunca ha visto un anime este es muy recomendable para empezar. Los personajes son una maravilla sobre todo L y Light, que te pueden gustar más o menos pero eso no quita que sean unos personajes increiblemente buenos. La historia está super bien trabajada y no muchos animes consiguen engancharte desde el inicio como lo hace este. En cuanto a la "
]