[
    "\n                As 'good' as the normal naruto series. \r\nReminicent of Inuyasha - characters keep running around and nothing really (ever!) happens plot-wise(what plot? There is no plot!) for the next 300 manga chapters  and 500 anime eps... Will Inyasha, ops I mean naruto, save kagome, ops I mean sasuke.... Seriously.... \n\r\nMost of the time is spent showing characters: running around (mostly jumping from tree to tree, it seems), standing tensely, with the wind blowing between them...Very productive and oh so tense. oh, almost forgot sakura's endless whining about poow nawuto and/or sasuke or someone/something else equally as unamusing. And naruto's whining about sasuke.\n\r\nHad to watch\n                  \n\nmost of it on FF (3 second skip) towards the end of the eps I had.\n\r\nAnother useful parallel quality-wise, would be DBZ...Except DBZ probably had more variety in the lack of plot :D. But about as much action, except characters there stood around powering up for half an ep. Which is ALSO present in naruto. \n\r\nSave yourself, watch something else...",
    "\n                Another Shippuden Review\r\nby radiantfire\n\r\nContext:\r\nThis review analyses Naruto: Shippuuden (simply referred to as Shippuuden from herein), an anime adaptation of Masashi Kishimoto's shounen manga Naruto. At the time of writing, I have watched 39 episodes of the series.\n\r\nStory:\r\nTwo and a half years after Naruto has ended, Shippuuden picks up with fresh new characters and story arcs. Although the anime generally remains true to the manga, small fillers give the story an unnecessary drag. It's somewhat amazing how, in some instances, 1 chapter can equal 2 or more episodes. However, I do find some fillers a pleasant addition to the general plot of the series.\n\r\nAnimation:\r\nThe animation, in\n                  \n\ngeneral, is good. Most of the time, you get decent to good animation. Other times, however, offer repetitive frames as well as poor cases of movement and facial expressions. In fact, some positions just looks so awkward. Nonetheless, I find it decent to watch.\n\r\nSound:\r\nThe BGM is decent but it is incomparable to the amazing work of Toshio Masuda (main composer of Naruto). Emotions and moods aren't expressed as clearly by the BGM. Sound effects are generally alright, so too is the voice acting. \n\r\nCharacter:\r\nShippuuden, at least, captures the essence of the characters. I like how they're generally portrayed. Evil characters are evil, good characters are good. What more can you ask for?\n\r\nEnjoyment:\r\nAs a sequel, Shippuuden doesn't match up to Naruto (that is, if you don't consider all those fillers). As a separate entity, however, it's a pretty decent anime. I'm pretty sure there'll be mix comments on how people have enjoyed the series. I, for one, find it okay to watch.",
    "\n                Naruto: Shippuuden review\n\r\nNaruto: Shippuuden is one of the most famous anime of all time, but sometime, being famous doesn’t mean it is good. People generally just base their opinion on what they liked but not on what they disliked about Naruto so that’s why you might have heard that it is a good show. If people love so much this anime, it is basically just because they found it entertaining or because they grew up with it, but if we look at it objectively we can clearly see that it is a huge waste of time and attention.\n\r\nFirst, the main story line is about Naruto\n                  \n\ndealing with Obito’s past. Let me explain myself, Obito was in love with a girl called Rin when he was around twelve years old. That girl died because she had a beast sealed inside of her that was supposed to destroy her village. Instead of coming back to Konoha, she decided to kill herself to save some life. Even if she suicides, Obito couldn’t bear it so since that day he decided to avenge her by destroying the ninja world. Naruto will have to counter all his plan to save the ninja world and his precious comrades. So what sucks about this is that Obito is now a lot older and still didn’t get over it, which is just stupid. Almost everything that’s going to happen in this anime was indirectly or directly because of that incident that happened many years ago. It is so exaggerated, the Akatsuki exist because of Obito and there will be another Great Ninja War that last for more than the half of the anime (which is 500 episodes!). \n\r\nSecond, the psychology of all the characters is messed up. You will learn the story of a lot of them and it might seem like a good thing at the beginning because it justified the fact that some of them are evil. In facts, it makes the anime last a lot longer for no reason because they all have the same story. There is more than one hundred characters and none of them has a unique story, including Naruto they are all thinking the same way so they all doing the same thing. Here’s a few of the characters story that you’ll see many times:\r\n1.\tThe character loses someone he holds dear, so he will want to avenge him by destroying the responsible and his village (Ex: Obito, Nagato, all the member of the Akatsuki)\r\n2.\tThe character is a total failure for martial arts and has a genius (a genius in Naruto is only someone who his not totally stupid cause they are honestly never doing anything smart) in his team, so he’ll try to surpass him and become hokage (Ex: Obito, Naruto, Guy sensei).\n\r\nThird, as I said before it is too long for no reason, but not only because of all the unnecessary character’s story. A fight in Naruto: Shippuuden can last for many episodes because of all the efforts of the director that wanted to make it epic. I remember that fight against Orochimaru that was like 4 episodes and two of them were basically Naruto standing in the middle of a bridge just to show the power of his beast and Orochimaru talking to Naruto in beast form that can’t answer him back. All the things that Orochimaru said were useless, it was only a reaction to Naruto’s power. Another proof of that is clearly the Ninja war that last for hundreds of episodes. Every time that Naruto’s side finally succeed at beating Obito or Madara, there will be a stupid reason for them to come back with more strength. You’ll see that those two will be beaten two or three times each, but there’s always an excuse for them to recover. \n\r\nFourth, there are a lot of character (especially girls) that are useless. Sakura for example which should be one of the three principal characters after Naruto and Sasuke isn’t doing anything and gives nothing to make the story go further. She is only in love with Sasuke since she saw him and always try to stop Naruto that want to bring him back to the village. Pretty much every female Ninja student in this anime exist because they love someone or just because some teams miss a girl. Even the Hokage (the chief of the village) is useless. She is one of the most unqualified person to take that role. She is very weak and dumb, the only thing she knows to do is how to lose a fight and give orders, but again she is a girl and her team needed one when she was young.\n\r\nFifth, Naruto’s way of thinking just doesn’t make sense. He is always saying that what he wants the most is to protect his friends, but you’ll see that he will excuse Obito for killing a lot of them and his parents just because the guy said that he hoped for Naruto to become Hokage. All the bad things that happened to Naruto were in some way because of Obito and he wants to forgive him because of some worthless words? That is ridiculous! Normally I wouldn’t waste time on one specific characters like this, but it is the main one, so I think it is worth mentioning. \n\r\nTo conclude, I think that Naruto: Shippuuden only has one quality, it is entertaining. Unfortunately, this one isn’t enough to make this anime a good one because of all the defaults that it has. If you are looking for an anime that has a good story, good characters, relationships with real feelings or some interesting psychology, you are not at the good place because it is too simple, too repetitive and doesn’t feel real for a bit. If you are interested, I can suggest you Katanagatari which has some theme in common with Naruto: Shippuuden but certainly a lot more mastered. Also, you can go look at Ranma ½ that inspired Naruto, a little bit too much in my opinion (It is a lot better, but not a masterpiece).",
    "\n                Naruto Shippuuden. One of the most popular anime series to ever be created. But did you see what I said? I said popular. Not best, not deepest, and not the saddest. But it is far from being, and I mean far, a bad anime. I came on to MAL completely surprised when I saw that it was rated #510, and even more so that Naruto was #800 something. I sat and thought \"why in the world is it rated so low?\". I looked around on MAL for a little while, and I figured out that there are a couple reasons it is so bagged on.\n                  \n\n1. Filler. People decide that because Naruto has more filler than the other \"Big 3\" that it has a horrible plot and deserves a 5 for a score. To you people that do that, you should be ashamed. Where do you get off rating a wonderful anime like this one, a 5 because you think there are too many fillers? It's just stupid, honestly. 2. People like to throw rocks at things that shine. I've talked to people who, no joke here, rate low because it is popular. That isn't as common here, but I still see it. and 3. People come in to Naruto already thinking they're going to hate it. News flash, if you come in like that, you come in looking for flaws. And trust me, you will find flaws, Naruto is definitely not perfect. Although, those flaws don't merit this anime the score it has here. \n\r\nThat's all I wanted to say. I didn't come here to talk up Naruto, I came to defend it. And sure, you can call me a fanboy. You'd be right, but I'm not so \"fanboyish\" to let it get in the way of my judgment. \n\r\nI've decided that I wont make this into a \"real\" review because I'm satisfied with the other reviews. I just really wanted to get that off my chest.",
    "\n                Like many people know Naruto it's one of the most famous animes and a smash-hit manga that sold 5 million of copies or more just in U.S. and besides that it's one my favorite animes that I could watch and rewatch it many times. Although many people say that it's not so good as they expect it i think Naruto and Naruto Shippuden ( but more this one) it's that kind of anime that we learn something usefull to our lifes since muscular strenght until the strenght that comes from our Heart, and that can't be paid at any circumstances.\r\nIf you're thinking in starting to\n                  \n\nsee it I advise you to do it because it's that kind of anime that when we stop watching and then we have 20 episodes of delay we can't stop watching, and yes it sure has a lot of fillers but you don't have to watch it.",
    "\n                Naruto is and always will be one of the great long shonen series out of all the shonen series. It has provided a story that still makes its fans wanting more, it has revived criticism for its filler but when filler is not being aired  it is excellent.\n\r\nStory 10/10\n\r\nNaruto Shippuuden is the sequel of the first series of naruto and continues on from when naruto goes to train with his personal sensei jiriya so he can get stronger to find and rescue his best friend and rival sasuke. But the story of naruto becomes much more than that as the series progresses with so\n                  \n\nmany unexpected twists and turns. If you want a good story i strongly recommend this anime.\n\r\nArt 7/10\n\r\nNaruto has shown that is has many strong points when it comes to animation but when it comes to consistency of quality in animation it dose not fair to well. The anime has had moments when the quality has strongly declined (Battle of Pain) but most of the time the anime keeps up the quality.\n\r\nSound 9/10\n\r\nThe sound fx of Naruto Shippuden to the soundtracks and sounds of attacks are nothing short of awesome. The music playing while people are fighting in the anime have an elegant sound to them and gives a nice feeling of relaxation while watching the fight unfold.\n\r\nCharacter 10/10\n\r\n The Characters are nothing short of amusing and interesting every single one of the are different and they all have different goals in mind. Which leaves you wondering in naruto shippuden every time a new character come on screen you become intrigued about what the character will be like.\n\r\nEnjoyment 10/10 \n\r\nI Saw the original series for the first time in 2006 from a recommendation from a friend and i loved it after a few episodes once i finished i had to go on into shippuuden which was twice as good. The original naruto was differently a calm before the storm for shippuden because of the amount of enjoyment that shippuden gave later on.\n\r\nOver al 10/10\n\r\nI would recommend this series to anyone in a heart beat regard less of their anime preference.",
    "\n                        *********it's not a review it is just a oneway conversation from my heart********** and yes it is has spoilers \n\r\nToday at 5 o'clock in the evening something came to an end it was series which I cherished for the longest time since I can remember with the end of the series I want to share something with some one whoever they may be. I clearly remember the first ep of naruto which I ever watched its was a episode from the chunin exam when naruto is writing the test which he doesn't know but the way he\n                  \n\nhandles the situation was pure epic then I watched the first season of the series the zabuza arc and I was star strucked. The strong desire of the main character to be acknowledged by by his village and his friends was something that resonated with my thinking's. Then the series was such a great part of my life that I cannot put it into words\n\r\nWhen naruto cried I also feel the pain when he work hard he inspired me to do the same and when he achieved some thing it made me so happy that tears started to flow from my eyes\r\nThere were many moments  which I will never forget like say for instance \r\nThe first time he defeats neji after he wins he takes a victory lap around the arena and everyone in the audience is just shocked to see him win. At that time I was feeling like this is what I want to be. And the infamous scene from after naruto returns the village after defeting pain and the scene in which iruka is telling his story was so heart touching that it made me proud. \r\nThe story itself was so good that I can overlook many things \r\nThe back story of naruto was so sad I clearly remember the ep 'thank you' in which he meets with his mother it was just so beautiful \n\r\nAt this point you may be thinking that he is just overestimating the series so yes I am. But I too cannot ignore the curse which was making a epic series a avrg one 'filler' it was bullshit pure bulshit, no no it was worse the bullshit\r\nOnly the novel adaptations were worth mentioning. \r\nBut living that aside it was a good series and for me a inspirational one\r\nSo seeing the last episode made me a bit emotional it was 9 years of journey for me and yes I am happy that it ended but I also feel a bit sad \r\nSo if you have not watched naruto a you feel that you are a failure I think you should give it a try Bcz I know if you can connect with it you will not be disappointed.",
    "\n                Story: Its the continuation of Naruto so its got alot of back story and character history, right now there is alot of people who dont like how this series is turning out and is not much to compaire to early naruto. But if you love the series and want more after the end of the first chapter of naruto then this is what you have been waiting for.\n\r\nAnimation: Characters have changed a bit, nothing much besides that, same style.\n\r\nSound: Same as naruto. nothing note worthy\n\r\nCharacter: Everyone is back and they added someone new people to and it will just get better. However naruto is still\n                  \n\npretty lame so it isn\\'t perfect.\n\r\nEnjoyment: You get to see what happens after naruto, thumbs up to that.\n\r\noverall: Meh, IMO it should have been done like the manga and they shouldnt have changed the name of the show but hey atleast they havent had a single filler because of the giant span in story between the manga and anime. Maybe all that filler was worth it...NAH :)",
    "\n                So it goes like this - Akatsuki a criminal organization of rogue ninjas is on the move to capture all the jinchurikis. Naruto is on the move to bring Sasuke back. Sasuke is on the move to kill his brother Itachi who is an Akatsuki member. Other characters are inconsequential in the eyes of the writer.\n\r\nThere are a whole lot of problems with this series but the main problem is Naruto himself. Why would he go so far to bring back a dick like Sasuke who does not give a shit about him or any other person. Naruto completely sidesteps his ambition to become a\n                  \n\nhokage. His new goal is to bring back Sasuke. Why the hell is Sasuke so important? For this series to work Sasuke should have been a real great guy who was loved by and who was a real hero but Sasuke is a self centered dick,piece of shit,asshole. The only persons who care about Sasuke are Naruto and Sakura and it is an established fact that both of them are retarded. So the main problem with me is the motivation of the hero which is completely illogical.\n\r\nThe second problem is the hero itself. Naruto is a weak person. He has had his balls removed. He is a self pitying piece of shit who cries on a drop of a hat , who treats important people like shit and sucks up to Sasuke. It would have been great if the hero had been a guy like Edward Elric because Ed also has a tendency to get emotional and well up but no one can call him a sissy pants.\n\r\nHowever the most excruciating aspect of the series is its pacing. It just goes on and on and on. It eats up a whole episode to do something which requires merely 5 - 6 mins. There are flashbacks to remind you about what happened five minutes ago and this also happens during action sequences which kills the momentum and intensity which is already lacking.\n\r\nFinally I am so angry because I think this series had so much more potential. It throws you into a complex and interesting world of ninjas but focuses on the faggots - narusasu. It gives us awesome characters like Kakashi and Ero Sennin and sidesteps them completely. They should have been the heroes. It also treats female characters like shit and portrays them as worthless (Sakura' Ten Ten,Hinata)  ***THAT IS ALL END OF RANT***",
    "\n                I would like to let people know that this anime is awesome and i grew up watching it. If your wondering why the overall is only 4 is because the creators are complete jerks.\r\n They are able to make masterpiece episodes but they have utterly no respect for their fans. Half of an entire season is fillers that are irrelevant to the main story. I watch this anime to see the great action and story following Naruto and his friends. Not some imagined on the spot character that brings up a over-dramatic life. \r\nThey take more \"breaks\" than they make episodes. \r\nJust recently they came\n                  \n\nback to the main story after a few months of fillers i have no interest in but just after that one main episode they decide to take a few weeks for a break, then they did it again.. and again.. and again.\r\nI use to see stores with anime fan toys and souvenirs, They prohibited all their merchandise and decided to monopolize it at a overpriced retail.\n\r\nI wish some other company would take over naruto and bring out its full potential instead of soliciting ratings from millions of students and swimming in their pools of yen.",
    "\n                Naruto Shippuuden As you probably Know From Other Reviews, Is A continuation From The original Series &quot;Naruto&quot;, The Difference is That it takes place a few years later, When naruto is Somewhat More mature. OverAll I'd have To say that Shippuuden has to be WAY better then the original Naruto Series, not To Mention More Action Packed. There also Tends To Be less Fillers Then there was in the First Naruto Series, At the Same Time I Believe Even If Most Fillers are completly retarded, that they are Necessarily Because Without Them We Would catch up to the manga, and if we catch up with\n                  \n\nthe manga, Episodes would be delayed like crazy (Just Like our Friend inuyasha). Think About it We're currently 90 Chapters Behind them, And i'd say about 3-4 chapters are in each episode. That leaves around 30 or Less Weeks. at the same time, If We're going at 3 chapters a week, and they're going at 1 chapter a week, without fillers or DELAYS, We would catch up in almost no time at all!\n\r\nOverall Despite The Similar Story For Every Filler, i Would Give this Anime an 8 Out Of 10",
    "\n                Inconsistent the whole way, even when it comes to its strengths. \r\n- Naruto is sometimes his entertaining and cheeky self from before the timeskip, other times he's just a goody two shoes protagonist.\r\n- Sometimes the dialogue is very solid, but other times it falls off the deep end (sometimes even in the same conversation).\r\n- The animation can be anything from appalling to passable, occasionally being amazing. \r\n- Some story arcs are really engaging and fun, others feel like filler.\r\n- Sometimes, the filler episodes feel canon (Itachi's backstory) while some canon episodes feel like filler (anything involving Sai).\r\n- The story felt consistent and cohesive the entire\n                  \n\nway, except at the very end where they create plot holes out of thin air for absolutely no reason.\r\n- The show explores a lot of interesting themes, but some of them get completely butchered (such as hard work vs talent)\r\n- The climax is butchered only to be saved and then butchered again immediately.\r\n- Sometimes the show nails something you would never imagine, but then completely flop on very obvious things.\n\r\nThe one thing I can grant Naruto Shippuuden is that it has the best villains I have seen in any series. There's such a wide variety of villains and they are all interesting in their own specific way. Every villain seems to have their own motives, and the best thing is that all the motives are believable.\n\r\nSkip the filler, but also understand that a lot of the time will be miserable, but there will be some very strong arcs and moments. If you prefer a consistent, entertaining experience, this may not be it. However, if you think strong moments are worth waddling through the mud, you might like it.",
    "\n                It's 2 and a half years since Naruto left to train with the Legendary Sanin Juraiya. You'd expect him to be bad*** right? Guess again. Naruto is still the goofy little kid who still gets his *** handed to him in every fight. What exactly has he learned? No new jutsu to be sure, just learning to control his Kyuuba. That sounds cool but it's really not. This lies a problem with character growth.  It's nonexistant in shippuuden until around episode 50 (avoiding spoilers). Naruto still wants to find Sasuke. Guess what? SASUKE WILL NVR COME BACK, GET THAT THROUGH YOU'RE THICK SKULL!!!!!\n\r\nAnother problem\n                  \n\nis the story. Shippy progresses too slowly. Half an episode is just talking, the other half is the slow fighting. It will literally take 5 minutes just for someone to punch the other guy. And the flashbacks are just silly. Why do I need a flashback for something that happened 5 minutes ago? This has happened quite a few times. The character designs aren't bad except Ino's. She looks like a Britney Spears wannabe and who'd wanna be her?\n\r\nI gave Naruto shippuuden a 7, but my review makes me sound like I hate it which is not true. Shippuuden actually has a deep story. If it progressed fast it'd be epic. More about the Akatsuki's goals are revealed and when a fight actually occurs it can become an awsome fight.\n\r\nNaruto Shippuuden also has a different animation style to it that I enjoy. It sets the mood for a dark and deep story which I enjoy.\n\r\nI gave it a 7 because when something good happens it becomes REALLY awsome. The story pacing just keeps it from it's true potential.",
    "\n                A much more ambitious continuation to its predecessor. Introduces brand new concepts, expands on lore, and keeps up with the themes of bonds/friendship and ending the cycle of hatred. Though it has some pacing issues and polarizing decision-making at times, this remains a favourite series to many for its climactic fights, emotional moments and diverse cast of characters. While the original series is definitely more cohesive and grounded, Shippuden has much higher highs. No beating around the bush, it is a flawed show, but the positives outweigh the negatives and offer some of the most iconic sequences in anime history.\n\r\nAdditionally, Naruto: Shippuden covers a wide\n                  \n\nrange of genres throughout its 500 episode run. There is something for everyone from dazzling fight animation to romantic subplots to fleshed-out side character stories. All in all, this is an absolute must watch for fans of the original series and the universe it's set in. Enjoy the show, and prepare to cry.",
    "\n                Watching this after it has ended and having the luxury to skip over the filler episodes leaves me with no choice but to put Naruto in the GOAT debate. \n\r\nI won't go into any details as I'm sure most people are familiar with the story of Naruto. However, and in true MAL fashion, I have to rate everything as part of my review.\r\nStory: 10/10\r\nCharacters: 10/10\r\nMusic: 11/10\r\nEverything: 10/10\n\r\nNot many animes out there can stand the test of time but Naruto/Naruto Shippuden certainly is one that can and has already done so. The story that started with the clueless orange jumpsuit-wearing kid ended up becoming a global\n                  \n\ncultural phenomenon. Without exaggeration, this anime is responsible for a generational shift in anime culture. As Naruto was probably many people's first anime, it has largely contributed in moving anime to the mainstream. Stories like Naruto has kept audiences captivated for over 15 years keeping those who started it when they young captivated until its end, and until its audience grew older. This anime does not get the credit or the respect it deserves when it is literally one that changed people's perception of anime. \n\r\nAlso, anyone that tries to put Naruto down is an edgelord who tries to stand out from the rest and probably enjoys something lame like slice of life animes.",
    "\n                Naruto has given me many LIFE LESSONS that i honestly didn't recognize until i watched the show. Naruto has given me inspiration in everything that i do. I know this may sound absurd but Naruto somehow made me a BETTER PERSON!\n\r\nStories of love, fear, bonds, hopes, and dreams, gave Naruto a deeper meaning than just brawl and comedy. It serves an inspiration to me in real life.\r\nNaruto brings revolution in people!! Its addiction!!Its faith!! It gives you the strength to believe in yourself!! Even if you’re broke, or faced a break up with your girlfriend, sad, shattered whatever...and even if you don't watch Naruto that\n                  \n\nday...but thinking about it... i don’t know why, but it will make you smile and give you strength!! Naruto is all about determining the way one should treat people after going through everything possible in the name of sorrow and grief in life!! In anime, Naruto Shippuden is god!!!\n\r\nTRUE FANS know the virtue of Naruto!! It’s a feeling, call it an experience which is found in the words used aren't just put to explain the moment and thoughts of the people in it... But it has a meaning in the future!! Every time you watch an episode of it again and again, the interpretation is different!!! I know my comment is weird, and my way of explaining its importance seems to be significantly stupid.. but TRUE FANS...you agree with me right?",
    "\n                Well I dropped this a while back, but I figure I leave a little something regarding it. Naruto was one of the first anime that I did pick up when I was actually getting serious about watching. I watched the original series, OVAs, and movies. It was ok overall, but I felt it could do something with that story. Then comes along Shippuuden, which I thought it would do expand the story and make naruto seriously epic. I was wrong. I don't even know how I managed to get to episode 255 including all those countless filler. I mean sure Bleach and One Piece have\n                  \n\nfillers, but Naruto takes it to a whole different level. I really can barely recall at least 5 episodes for Naruto that were seriously epic. So on that note, no more naruto for me. I may peep the manga from time to time, but its not a priority.",
    "\n                Naruto didn’t just entertain me—it shaped me. As a kid, it wasn’t just a story about ninjas; it was a story about being different, about standing tall when everyone told you to sit down. Naruto’s journey from the outcast nobody believed in to someone who inspired the world felt like my own. Every time he yelled, fought, cried, smiled and showed how he still continued his journey, I believed in myself just a little more. Plus great fights, great complex and connected stories.\n\r\nSure, it’s not perfect—what is? But for me, it’s more than an anime. It’s the late nights trying to pull off a Rasengan,\n                  \n\nthe hours spent working hard in myself, the weeks when I wanted to give up on many things just to remember Naruto's way, and even the tattoo I got as a permanent reminder of what Naruto taught me: that hard work, heart, and stubbornness can beat the odds. Naruto’s story is mine, and it always will be.",
    "\n                With all my heart and soul I recommend to watch this masterpiece!\r\nThis anime is to Express love, experience and desire to never give up.\r\nThis story is about a ninja who just fulfilled his dream and became a hero...\r\nWhen you begin to watch your life will never be the former, I assure you.\n\r\n6-7 year I watch Naruto, oh my god 6-7 YEARS! \r\nI grew up with him (He matured early)\r\nWhen it was sad, I watched Naruto and that made me happy.\n\r\n23.03.2017 anime Naruto ended... The guy fulfilled his dream...\n\n\n\r\nThank you Naruto and Masashi Kishimoto.\n\r\nOf course 10/10!",
    "\n                First off all, I just wanna say that I am super sad that this show has come to an end. I personally tried to watch as slow as possible because I wasn't felt ready to finish it. It is my comfort anime that I watched when I felt myself empty. I fell in love with the emotions, art style and characters in the anime. At first I was very judgmental about watching because of the fillers. But I'm glad that I watched it. I think this text is \"memory\" more than review. \r\n Thanks to the ShnClv for inspiring me about \"The tale of Uzumaki\n                  \n\nNaruto\"",
    "\n                Probably one of my favorite anime of all time. This anime is a really popular anime and even though there are a lot of fillers, I really enjoy it. The sad stories in Naruto always make me cry and there are lots of hilarious moments. In addition, this is one of the few anime where the English dub does not tick me off.  \n\r\nAs viewers we are able to see Naruto's growth as a character from an immature brat to someone who can truly understand the pains of mankind. The only downside for me about this anime is how long you must wait for\n                  \n\nthe episodes to come out. I've been watching Naruto since I was in 6th grade and its been 10 years.",
    "\n                If you like action packed Animes this one is for you, i myself woudlnt recommend watching naruto, only naruto shippuden, but you might want to try reading a bit about naruto to have a background of what you are about to watch.\n\r\nIt´s a Story about a young ninja and his path to become Hokage (Chief of his Village) and change the world for better by overcoming many obstacles through- out his life.\n\r\nPeople might say this show has fillers, but the fillers themself tell you a story that is important, they dont feel as fillers at all, they give us the background story to understanding the\n                  \n\npersonalities of the characters that have appeared on this show, antagonist, protagonist, curcial and trivial throughtout the story.\n\r\nMy final Thoughts : If you like Action combined with a good story and some quality anime this is for you. This anime has touched my feelings in so many ways.",
    "\n                Story: the world building/lore is amazing, the story is incredible, though it may get a bit repetitive when approaching the end of the story. Solid 9/10\n\r\nArt: It starts of very good, though not perfect, but it just keeps getting better throughout the series (except for naruto vs pain LOL). Solid 9/10\n\r\nSound: the music is simply the best i've ever heard. very emotional, exciting music.  Beats fairy tail for me. (same composer tho). 10/10\n\r\ncharacter: absolutely love almost every character. literally everyone is just amazing. the legendary sannin, akatsuki, (previous) kage, itachi, madara, literally everyone. Another reason i adore the show. Well deserved 10/10\n\r\nEnjoyment: I can't\n                  \n\neven describe how much i enjoyed watchen Naruto. Just know i did. Best 10/10 i'v ever given. \n\r\nOveral: a big fat 10/10",
    "\n                I just got into Anime a couple years ago. My most favorite will always be Naruto/Naruto Shippuuden. It's the only anime so far that has gotten me to cry a lot. I feel all the things that the characters are going through. It's about friendship,family,pride of where you come from. This show makes me laugh,makes me cry, I've even yelled at my computer screen when things happen I don't like. lol. I never came across any show like Naruto that had me fall completely in love with it. I do admit when I heard of this show I thought it was just for kids. That\n                  \n\nit was going to be this lame kid show. Boy was I wrong! My sister actually got me into anime and introduced me to Naruto. I'm so glad she did! I thank her like everyday. I love everything about Naruto. The storyline,the characters,music,animation. EVERYTHING!!. Naruto is always in my heart. Hands down the best anime! This is my opinion though. People have others that they love more or what they think is the best ever. I've told some other anime fans that Naruto was my most fav and they would laugh. Doesn't bother me any because it's what I like not what they like.",
    "\n                Building off the great foundation the first series had, Shippuden is nothing short of amazing. The villains are the main draw here. However, the good guys are also awesome as well. \n\r\nI personally love how the fights end without discovering who is the strongest but who that person really is. This show gets a lot of hate and I believe it's completely for stupid reasons. Kishimoto makes bold choices when it comes to his story and some fans don't seem to like those choices. I personally love them all and believe this is one of the best long running anime series alongside other greats like\n                  \n\nOne Piece, Hunter X Hunter and Bleach.",
    "\n                When I joined this site, The first review I ever posted was of Naruto but it's extremely outdated now and my vocabulary was limited 7 years ago so I figured its time to delete that one and totally redo it, So here we are. This is going to be a loooong review including my personal thoughts and how it affected me so strap on!\n\r\nThis review is for the entire Naruto series, keep that in mind.\n\r\nFor most people, the way they got introduced to anime is probably via Dragon ball, Pokémon, Beyblade, Bakugan etc. And while I did watch these shows growing up, no other show\n                  \n\nstood out to me as much as Naruto. My 12 year old self had no idea what he was watching on Cartoon Network one day but I'm glad I was because from that day onward I developed a sort of affliction towards this series. At that point in time I only saw bits and pieces and random episodes on CN, So my knowledge was vague and I only knew two things that this show is Naruto and he's the main character.\n\r\nFast forward a couple of months after that point, our local Cartoon network stopped broadcasting Naruto and Dragon ball Z for some odd reason. So I was left puzzled what to do. Now keep in mind, this is early 2010s and 2011. Our household had no Internet, let alone a computer so my only choice was to search my local markets. I scoured and I actually ended up finding Bootleg dvds of Naruto (I didnt know they were bootleg at the time lmao) Bought a ton of those but even then I didnt properly watch the series. Years passed by, I bought my first console (PS2) solely for playing the Naruto Ultimate Ninja Series (True fans know what I'm talking about haha). That game was my life for that period of time. Then after a while, bought an Xbox 360 and played more Naruto games etc.\n\r\nFast forward to now when its 2015, I made my MAL account and now I had proper internet access and could watch all of Naruto and so I did just that. Then came the time for the war arc of Naruto which had several fillers that it actually ended up making me read the manga for the first time and I read that till the end. Now a few years passed, the anime was actually now at its end and I still remember the day I watched the final episode, Tears flowing from my eyes. It was 2017 and I just graduated from my College and was now preparing for my University entrance exams. I also rewatched multiple scenes and played the games so many times that I felt like I knew the series by heart and Naruto became my profile pic on most online platforms  haha (It was a phase). \r\nI did rewatch the entire series, including fillers in 2020 all in 35 days non stop hahaha xD.\r\nNaruto is the reason why I delved so much into anime and why I now love Anime. I'm proud of the years I spent watching it, almost feels like I grew up with Naruto. This feeling cannot be explained, Its surreal.\n\r\nNow on to the review,\n\r\nStory : One of the best written stories in shounen easily, don't compare this to seinen or other categories because it should be compared with its competitors right? At the time it was competing with Bleach and One piece and they were known as the Big 3. All 3 of these shows are still going on till this day, Boruto counts of course.\r\nYou will find everything in Naruto's story, romance, melodrama, dark themes, war, politics, abuse, action, super powers, mind games. It literally has every single thing that you can think of and it amazingly portrays the journey of Naruto as an individual through his early life till adulthood.\n\r\nCharacters : Boy oh boy, where do we start. Even people who havent watched Naruto are familiar with its characters like Itachi, Kakashi, Sasuke etc. Because of Kishimoto's excellent and charming character designs!\r\nSome of the best side characters and antagonist can be found in Naruto.\n\r\nAnimation : Studio Pierrot has somewhat managed to maintain a standard of quality throughout all the years when it made Naruto.\r\nWhile the animation has its ups and downs, for the most part it does its job pretty well. Nothing is perfect obviously but I think Studio pierrot did their best with what they had.\n\r\nVoice actors : Stellar cast, Everything gave their hearts and poured their all into their roles.\n\r\nSoundtrack : One of THE BEST soundtracks ever, Sad osts, Happy ost, Banger openings and Endings.\r\nI still listen to them to this day while driving my car, the songs and music is that good!\n\r\nVerdict : Beyond a shadow of a doubt, Naruto helped shape an entire generation of Weebs and people like me to whom Naruto became an irreplaceable part of their lives and its the reason why Iam here to today writing this review. Naruto helped shape my personality and I will no doubt show this to my children and partner, If I'm lucky enough! Hehe :)\n\r\nIf you're still reading this review then here's a cookie 🍪. Just go blind and start this journey. Trust me , You wont regret it.\r\nThis is my longest review since I couldnt find the words to write down properly but I did manage to write atleast some of it!\n\r\nThank you for reading!",
    "\n                Naruto Shippuden is my favourite anime of all time. i followed this anime since i was little. this anime may have some lack, i still love this anime.\n\r\nStory : 10/10\r\nthere may many people think naruto is some ordinary anime. i won't say so. From previous series, we knew that naruto dreams to become hokage someday, then he faces new conflict about sasuke is out from the village, and naruto is planning to get sasuke back. We may thinking about this series is about friendship ( getting sasuke back ), but is not as simple as that. Naruto faces a secret organization named akatsuki and they\n                  \n\nhad ambition to take all tailed beast. The akatsuki came, things getting complicated. Things are going beyond naruto and sasuke simple thinking. Sasuke, who has ambition to become stronger and kill his own brother, is regretting after succeeded killed itachi. Itachi has his own reason why he killed all uchiha clan member, and why he joined akatsuki,etc. and itachi kept it as secret. After killed his own brother, sasuke joined akatsuki, then willing to search for the truth about itachi.\r\nNext is naruto. Naruto may be the most sad character. He is targetted by the akatsuki, and succeeded beating some of them. Later he found the truth about her father, mother, and himself.\r\nThe fight in this anime is not meaningless. It's not just fighting the villain after hardwork and win. It teach us many things. Like in the Pain Arc, Naruto is confused by nagato's question about how to make a peaceful world, and many meaningful things, not just that.\r\nAnd my main reason why i liked the story is, everything is explained. The character backpast, the villain's motive, even the beginning of chakra.\n\r\nArt : 9/10\r\nIt may be simple, but liked it. i think it does match with the anime. The fighting scene animation is smooth and i like it.\n\r\nSound : 8/10\r\nI like the soundtrack, especially the opening and the ending. They are great. The sound that inserted in many scenes are matched and great. But, some fighting soundtrack is sounded too heroic, but it's acceptable to me.\n\r\nCharacter : 10/10\r\nThe best. The character in this anime has their uniqueness, like their personality, their skills, etc.. The characters from the previous series are more mature. I really like the character development by feeling sadness and learning the truth.\n\r\nEnjoyment : 9/10\r\nI can't give 10/10 because there are toooo many fillers. Some filler episodes may be touching but they keep using the touching theme and then i bored. They are not important ( obviously ). I usually skip the filler episode ( I know the main story because i read the manga first ).\n\r\nOverall : 9/10\r\nNaruto shippuden is one of my most favourite anime of all time. It has deep story and unique character. Though it has many fillers, and many people hated it.\n\r\n----- Sorry for grammar mistakes, and this is my first review. Thank you for reading.-----",
    "\n                Bottom Line Up Front: It is easy to be disenchanted by typical shonen pitfalls, but if you can get past issues such as abundance of fillers and flashbacks, Shippuden actually has some memorable events which make it worthwhile to watch. It is not the Mecca of anime that it is made out to be by young teens, however it surprisingly has depth when you least expect it.\n\r\nHighs: Humor at times, easy to like protagonist for his abundance of imperfections, periodically deals with mature issues despite its' \"innocence\", death of \"good\" characters, interesting story\n\r\nLows: Superficial at times, over use of filler and flashbacks, adolescent fanbase catering\n                  \n\ndegrades series overall",
    "\n                Naruto Shippuden is a good Anime in my opinion. I know many people look upon Naruto as being \"mainstream\" and somehow inferior to other Anime, they are right and wrong.\n\r\nI like Naruto because of the troubled lives that the Shinobi live and the morals that the show tries to impart to the viewers although that is lost on most people.\n\r\nShippuden has a more refined feel than Naruto part 1 and that's most likely due to the development and maturity of the characters. Naruto as always stimulates powerful moments of emotional empathy from the viewers and always transfers some wisdom to the viewer, most notably relating\n                  \n\nto friendship, family and duty. \n\r\nThe overall main story arc is interesting and has many interesting developments which show what it's like to live the ninja life. There is Naruto's humor which still creates funny moments although that isn't as big of a part of Shippuden as it was in Part 1. The combat is also interesting and fun to watch.\n\r\nNow for the bad parts that makes people view Naruto in a negative way. There is many fillers which seem completely pointless and while that's not really an issue if you are able to trick yourself into liking them, It is very boring to watch. There are repetitive elements which can become stale after a while but if you become a fan you can overlook the repetitiveness. \n\r\nIn short: Naruto Shippuden isn't close to being perfect, but you will learn to care about the characters, mostly Naruto which greatly helps enjoy the show. It's interesting to watch but requires a lot of time since there is so many episodes and if you watch part 1 also (I suggest you do) then that adds up to quite a lot of time. Perhaps find a list of filler episodes and skip them. \n\r\nGive it 10 episodes to see if you enjoy it.",
    "\n                Naruto Shippuden : Review \n\n\r\nStory - 4 with fillers without fillers 9\n\r\nThe story is about ninja kid named naruto who wants to be hokage.\r\nThis anime has most of  genre like action, comedy, adventure, sadness, martial arts, Super Power.   \n\r\nArt - 8 \n\n\n\nThe art style has improved many times since the show started. \n\n\n\r\nSound - 8\n\r\nThere are lots of epic soundtracks & sad soundtracks in this anime\n\n\r\nCharacter - 8\n\r\nAll characters character designs is amazing the only thing i hate is naruto hair in episode 500 but however its still good. \n\r\nEnjoyment - 4 with fillers without fillers 9\n\r\nthis anime is amazing only without fillers.\n\n\n\r\nThis anime has lots good quotes \n\n\r\nEpic Fights \n\n\r\nEpic Deaths\n\n\r\nEpic Soundtracks\n\n\r\namazing powers \n\n\r\nBelieve it or not this anime is awesome only without fillers\n\n\r\nThis is my first review.\n\n\r\ni just hope they don't add any fillers in the next Sequel \n\n\r\nHope you liked",
    "\n                Everybody know Naruto a huge sequel that made a big success and one of the big three : DBZ-One piece-Naruto the manga is amazing with both halves produce an amazing and developed plot.\r\nThe story is about an idiot and hasty shinobi called Naruto uzumaki who dreams to be the highest rank in his village as the Hokage while his life was condemned because he's the host of one of the Tailed beast (nine-tails)  a huge creators with monstrous power, the reason that made him determined to attract the people s'attention by becoming Hokage despite this reason is vanishing throw the development of the series,\n                  \n\nNaruto the hasty boy is assembled with two team-mates , one of the uchiha clan one of the dominating clan in konoha though it completely perished by sasuke s'brother for a reason , and Sakura Haruno a jackass useless girl that has crush not just a crush on sasuke with their leader the captain Kakashi Hatake and now the team 7 goes on an adventure full of action-epic moment-comedy assembly.\r\nArts:art are okay sometimes amazing sometimes medium sometimes crap definition.\r\nplot : as manga amazing, as anime -_________________- always you got hipped but after that those filler episodes take place to ruin your enjoyment\r\nthat's why this anime won't make it over 8 .\r\nthere are some holes in the plot like losing the ninja aspect in the second half and take the seriousness path in many arcs with less comedy , but overall it's entertaining.",
    "\n                A seriously disappointing sequel to the original. \n\r\nHow do people find this story inspiring? The only thing I learned from this extremely predictable story is the importance of god-given gifts in determining your fate. Naruto is like- the ninja equivalent of a trust fund kid. His daddy sealed the nine tails inside of him knowing it would give him access to all the best jutsus, the biggest chakra reserves, etc. It gets hard to sympathize with Naruto after the Pain Arc. \n\r\n If you want a more believable underdog story, watch Black Clover. \n\r\nI know the war arc wasn't originally intended to be a part\n                  \n\nof the series. It is SO OBVIOUS that an entire third of the Shipudden runtime is just a giant cash grab. No hate to Kishi. Shounen Jump and publishing schedules are brutal. What happened in the manga can't be changed, but it seriously undermines the quality of the story. \n\r\nThe issue with female characters is also magnified tenfold during the war arc. Sakura had so much potential to perform more feats on screen. I hate to see her getting crap from shounentards when her medical skills are leagues above Naruto and Sasuke. Seeing her being outdone by Six Paths Naruto who just woke up with the ability to restore AN ENTIRE EYEBALL at will was just a huge middle finger to her years of training under Tsunade.\n\r\nSeriously. God-given talent. Kabuto was right when he imitated Orochimaru. For the talentless, our only hope is to harness the talents of others. Not the message I watched Naruto for, but it is the message I got.",
    "\n                To late but i need this anime up for value, At least for 0.01% to 8.15\n\r\nYou just can't say anything bad in this anime. Because this anime will teach you how to love, to value your friends, and many other Nintendo that really reflect on the real world. It's fiction, but it's as powerful as it gets...to reach a fanbase of millions and millions worldwide.\n\r\n'The Crafting'\n\r\nSuch positive, critical response isn't questionable. The story lives up to his promise to live as long as fifteen years (in whole). It is a burning legacy. It is something no one will ever come up again. Watch Boruto: Naruto\n                  \n\nNext Generations, or various recent Shippuden fillers (Season 5 was said to be the best, and indeed it was [Guren arc.], and you'll know that there will be no other Masashi Kishimoto. Or so I thought. Naruto is an original artwork. For since little of age, Kishi after watching 'Akira' got inspired and once upon a time decided how much he loved to draw and make a story. That story has changed my life; it made me really believe on the fact that some inspirations, tend to grow out on us, live like scars, and will teach us something that will only come from us. A life lesson. A burning 'will of fire'.\n\r\nIt's really stupendous and beyond overwhelming how one man could create an entire universe of action, of tell-tale hearts, of characters that have devil wings but in the end are shown to have a halo. Hundred thousands of fanfictions are up there on the net, extending what Kishimoto left. I included, but let's not get onto that first.\n\r\n[ Kristinachia's]",
    "\n                Although I have not viewed even half of this anime I believe the thoughts and words I have to say are strong and justified. I have gotten watched through the pain arch and it has proved to be a very pivotal moment for my understanding of this show. Whenever Naruto is brought up people often bring up the fact that its laced with filler or other pointless qualities that would degrade the quality of the show. Talk to me about filler before I have seen this arch and I would have agreed but with where I am now I wholeheartedly believe everything this show has\n                  \n\ndone is justified; regardless of how drawn out segments of the show can tend to be. You can only get as much from this series as you are willing to get from it, thus if you want to achieve the most intense take away from this there must be a method to the madness. I believe the best approach is through marathoning significant moments from the series because everything builds. Watching this show has made me finally understand why English teachers love analyzing literature. Its not about the spectacular fight scenes its about the message this show sends to its viewers. The bigger picture this show has to offer is all to relevant to this time period and my interpretation has allowed me to fully appreciate anime of this caliber as a whole. For example they manage to give almost all the core villains fully justified means of their actions. There is so much more to speak of but I feel this is a path of self discovery and I am fully interested in unique thoughts about this show as a whole. To those on the outside it seems like I'm drawing blood from a stone. But lemme tell ya I found a whole lot of blood.",
    "\n                I don't know why people say it's the most cliche anime ever but to me it is most definitely not! The first series was okay saying it was not all actual storyline and some random episodes of nothingness but it's evolved to a complex meaningful storyline if you can't handle a lot of different storylines at once then don't hate on it. It is fun, action packed, exciting and yes sad all at the same time. I won't tell you how it's sad because that's for you to find out but it is a really great storyline and meaningful i would recommend this to people\n                  \n\nwho like action, can handle a lot, or someone who want's a meaningful storyline.",
    "\n                I am a very big fan of Anime & Naruto Shippuuden Its An outstanding Manga & Anime series. Sir a long time ago I had watched the season 4 the fire temple lord chiriku of Naruto Shippuuden. but i am very sad because i am very influenced with the shaolin monks story the twelve guardian ninja in the 4 episode of the season 4th the Great LORD CHIRIKU died i am very sad about that character because he is the last guardian ninja so sir my main aim was to convince you to make some more episodes on lord chiriku on the fire temple. i\n                  \n\nguarantee you that it will surely became a great hit because many people likes the lord chiriku character. THANK YOU SIR i hope you will surely do something about this..................",
    "\n                Naruto Shippuden is LEGENDARY, EXTREMELY GREAT, ACTION & ADVENTURE FILLED ANIME.\n\r\nNARUTO SHIPPUDEN & NARUTO BOTH is LEGENDARY, EXTREMELY GREAT, ACTION &ADVENTURE FILLED ANIME.\r\nACTION & ADVENTURE & STORY & PLOT & CHARACTERS & EXPERIENCE ALL OUT OF THIS WORLD, HEAVENLY LEVELED.\r\nTHIS ANIME DESERVES RATING 10000000000000000000/10⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐\r\nNaruto Shippuden IS GREATEST ANIME EVER\n\r\nwell above is the review of me as a child & what Naruto franchise is to its targeted viewer it's never meant for a grown-up or adult.\r\nbut if still as I have grown I think its a FLAWED-MASTER-PIECE.\n\r\nNeji's story is criminally written his character could provide way more story & thrill his death is cheaply written it\n                  \n\nwould have been way better to watch how he became 1st leader from a branch family & proving himself greatest.\n\r\nMadara realizing his mistakes by Hasirama & TOBIRAMA conversation with him after Naruto & Sasuke defeats him in a more exploring(where their new powers are more exhibited, explaining YIN-YANG RASEN-SHURIKEN & INDRA-ARROW) battle, would be much better.\n\r\nBUT THE LEGEND OF ITACHI UCHIHA HIS DEAPTHNESS GREATNESS MAGNIFICENCE is EXCLUSIVE & GODLY.\n\r\nSAME GOES FOR HOW THE VILLANS ARE ALL SELFLESS Naruto's VILLANS ARE NOT MONSTERS THEY ARE JUST WRONGED DRIFTED SOULS WAITING TO BE SAVED & FREED FROM THE \"CHAIN OF HATRED\". (unlike ambitious greedy monsters they are selfless souls want others to live in peace but their piece is wronged & twisted)\n\r\nand so on this master-piece has so much wasted potential, but for a kid, it is a GLORIOUS JEWEL.\r\nAN INSPIRING HEART-WARMING EXTREMELY SATISFYING MEMORY WHICH WILL EVENTUALLY BECOME NOSTALGIC & IRREPLACEABLE.",
    "\n                It's good, very good.\r\nIt's probably the anime that has inspired me the most after Dragon Ball Z. It's become one of the few happy memory of my childhood and teenage years. \n\r\nStory: 9 \r\nUp until the 4th Ninja War the story was amazing, I don't hate the last arc but I don't think it's great.\n\r\nArt: 7\r\nPierrot (aside from the movies) animates incredible battles from time to time but I wouldn't say it's flawless animation every episode.\n\r\nSound: 10\n\n\nNaruto AND Naruto Shippuden have objectively the best anime soundtrack ever made, period. \r\n...And the seiyuus are very good, as you would expect. \n\r\nCharacters: 9\r\nReally like most of the main ones. Gaara and Itachi are arguably one of the best Kishimoto's creations and are portrayed wonderfully in the anime.\n\r\nEnjoyment: 10\r\nNothing to add. It's good.\n\r\nOverall: 10\r\n Despite the horrible fillers this anime is one of my all time favourites.",
    "\n                As I just completed the 338 episode I just took my time to examine shippuden from the start. Like most animes shippuden has its ups and downs most fillers done by the studio to drain naruto for all its worth isn't what I call  'enjoyable', but if you take your time to watch it wthout the fillers its preety good. Other than some wierd animations here and there I don't see why shippuden isn't awesome... The characters are well created the background sounds are awesome story is great...  The fillers that I would recommend is the chikara arc... I was excited with the\n                  \n\nway the war arc started panning out recently. Overall I give shippuden a 8...",
    "\n                  IS THIS ANIME TIME EFFICIENT ?\r\n  NO. NOT AT ALL; BUT LET ME SAY THIS...\r\n  I ask myself what makes these kind of animes so valuable to me. This anime is nowhere near perfect. Answer is actually pretty clear. I am a viewer who can put his time on this long series and enjoy it. So if you can relate to what I am saying, I can ensure you that this show has the most epic scenes in the world.\r\nIt all comes down to the person who watches. This anime is not for everyone. But those who finished it know how\n                  \n\nthey fucking enjoyed the boner they got when Guy and Madara fought. What I am trying to say is, this show pays off when you put your time on it. Just like other episodic series.",
    "\n                The storyline is so pathetic i could cry.\n\r\nAll it's mainly about is getting back an ex-team who isn't even worth saving.\n\r\n*Spoilers beware*\r\nHe kills Itachi and for that he can gain no redemption. No he may have gotten redemption if he at done wat Itachi would have wanted. But no he declares he's going to get MORE revenge by killing off the entire village? How is that any better than what was done to you? Idiot.\r\n*SPOILER ENDS*\n\r\nthe beginning was exciting. You think, YES Naruto will come back stronger, but no he just comes back with some maturity. Isnt until current manga chapters that he's actually badass.\n                  \n\nAnd even then Sasuke is still in his league? How is this possible?\r\nPathetic.\n\r\nSaving Gaara arc made Sakura actually seem likable until it ended and she reverted back to a loser.\n\r\nNot worth getting hype up over, but still worth watching.",
    "\n                Warning: This review contains some spoilers!\n\r\nNaruto, one of the most popular anime out there and one of the most discussed shows too, inspiring passionate discourse even to this day. Despite being far less popular in Japan compared to it's other shounen contemporary One piece, its better produced anime adaptation has propelled it to equal or even greater fame in the international community. However, unlike One Piece which mostly sticks to a tried and true plot structure, Naruto's plot is far less organized, being largely without direction in it's first part and with bits that drag out, seem contrived or don't entirely make sense towards the\n                  \n\nend. The discussion around the show too is rather unfocused with a lot of the discussion being power level talk, meme tier analysis of characters and largely uninformed takes on the animation. Despite the lack of broad consensus on its messy plot, I do believe that Naruto develops coherent themes through its run. Perhaps this review/analysis will have ideas that have been said before but looking at the state of discourse surrounding the show I'd like to try to change people's opinions on some aspects and offer my perspective on it having finished it fairly recently.\n\r\nPerhaps the main draw of Naruto is in its worldbuilding, with it's ninja villages with buildings of modern looking architecture but wrapped up in traditional Japanese mythos and aesthetic. The ninja in Naruto don't exactly perform the same role as traditional ninja, serving more as a sort of militaristic force. These military villages engage in a sort of power struggle not too unlike nations in our own world. But in the ninja word of Naruto, the villages seek to arm children to use in their fights and even turn them into weapons of mass destruction by sealing powerful spirits in them. Indeed, the Ninja world is one stuck in vicious cycles of hatred, where acts of aggression leave survivors who seek retribution which in turn leave their own seeds of hatred.\n\r\nThe show explores its themes of imperialism and the circular nature of violence through its two main characters, Naruto and Sasuke. Though they've both been through difficult circumstances in the past (despite being just kids), Sasuke is consumed by hatred and his desire for revenge while Naruto remains empathetic. It's this empathy in spite of suffering that is the driving force of the show. From Zabuza to Gaara to Pain and Tobi later in the series, Naruto is able to conquer his own hatred and reach out to those consumed by hatred themselves. Through his empathy he offers an alternative to the extreme measures his enemies are forced to adopt, and by believing in Naruto, they believe in the idea that the ninja world can get past their differences and mutual hatred to reach a common understanding.\n\r\nNaruto reaching out to his enemies is dubbed as \"Talk-no-jutsu\" and is dismissed as one of the quirky, illogical failures of Naruto. But in my opinion, empathy beating hatred through Talk-no-jutsu is the entire point of the show. There is also a belief in the fandom that Naruto was fated to become hokage, having immense power and being a reincarnation of one of the founders of the ninja world. As such, the anime goes against its own message in the first part that fate doesn't matter and that anyone can achieve what they wish for if they don't give up. However I think that the revelation of Naruto being a reincarnation is meant to convey a theme of defying fate rather than being a blessing for Naruto. As reincarnations of Indra and Asura, Naruto and Sasuke are fated to fight to the bitter end being locked in a curse of hating each other through multiple lifetimes. However Naruto is able to make Sasuke accept his way of doing things and breaks this 'curse'. Though this is a bit of a weaker point, I also think that Naruto is able to become hokage not due to his strength from being a Jinchuuriki or reincarnation, but because of his empathetic nature allowing him to bring peace to the ninja world.\n\r\nThere is also a question of how Sasuke is perceived by the fandom. Sasuke becomes Orochimaru's accomplice but is able to obtain use of his resources and improve his abilities without being taken advantage of. And Sasuke isn't really wrong in his decision to seek revenge on Danzo when he learns that he was responsible for nearly wiping out his entire race. In a sense Sasuke belongs to same class of characters that fictional villains like magneto belong to, in that his beliefs are right but the plot requires him to do evil things in order to undermine his rebellion against established powers in the ninja world. While I like the message the series tries to push with Naruto beating his opponents with empathy, it isn't really realistic and Naruto is only able to accomplish what he does thanks to his main character power. Through Sasuke we see a somewhat more realistic take on the story, a flawed teenager trying to change his flawed world.\n\r\nFinally we get to the production aspects of the show. In my watch of Naruto I saw some of the worst as well as the best bits of animation I have ever seen in anime. In particular, I loved the work of animator Norio Matsumoto. He was responsible for some of the best fights in Naruto like the famous Rock Lee vs Gaara fight as well as many others and also the controversial Pain fight. Norio tends to simplify his character models a bit in his work and also incorporates exaggerated squash and stretch movements that are more often seen in western animation. These exaggerated frames are often taken out of context and used to mock the animation in the show. While I'm not fond of his work in the Pain fight, his work on the rest of the show is absolutely top tier so I've always found the mocking of his work really distasteful. He possesses an amazing talent for fight choreography and is able to pull off extremely difficult bits background animation. It wouldn't be an exaggeration to say that the Naruto anime wouldn't be what it is without Norio Matsumoto. Even aside from Matsumoto's work, there are plenty of other talented animators who have worked on the show and I think every animation enthusiast who is into anime should give Naruto a watch. I've even heard stories from animators all over the world who've watched Naruto as kids and been inspired to take up animation as a career partly due to the show. So for people who say 'read the manga' I heavily disagree, just skipping the filler episodes should give you an enjoyable anime experience.",
    "\n                NARUTOOOOOO... eh.\n\r\nNaruto starts off in a direction that I simply wish the show had continued following. Ninja train to complete all manner of jobs, some straightforward, some shady as heck including paid assassinations. Somewhere along the line, they became nothing but dull shonen stereotypes, magic wizards with a Japanese twist. You can call them ninjas if you wish, but they're just punching wizards, powered by friendship, who exist solely to protect their pals.\n\r\n Yes, Naruto IS a shonen anime, but I remember way back reading the manga for the first time, I felt like it was going to take a darker route. I really don't\n                  \n\nlike how the series ended. I never expected it to become some edgy murder fest, but...the need to redeem almost every single bad guy? It's lame, it takes any tension you might feel out of the story when you know that any enemy that gets enough fan love, will eventually help the good guys. The worst offense was what they did to the Kyuubi. The idea that at any time this raging evil with nearly unstoppable power could finally break loose if Naruto was pushed too far, that was cool. Now he's a talking pet dog.\n\n\r\nAnyway, if you want a rather generic, if pretty well done series, Naruto isn't bad as long as you skip the filler episodes. Of which there are Many. \n\r\n  If you're looking for a story where the author wasn't afraid to take chances, this probably isn't for you.",
    "\n                As much as i loved both naruto(Young and older) I'm just going to say that i enjoyed the fact, that i got to play the games reading the manga and watching the anime since they're all good they follow up the story ...not much to say really besides my disappointed reviews on some errors within this series. . .\n\r\n>Sakura not dying. . . .\r\n>Neji's death wasn't really needed,\r\n>Boruto still ninja or Advanced Technology..?\n\r\nI would agree not all animes could normally get in my feelings but this anime gave characters actual hearts which connected and was able to hit mine indeed i was in a hurry\n                  \n\nto wipe years off my face when naruto was talking to his father(edo form) about telling him he was doing well and to give the message to his mother but if you all had this same feeling be sure to let me know.. i'm sure you too could use a shoulder~ :P"
]